#include <a_samp>
#include <crashdetect>
#include <a_mysql>
#include <sscanf2>
#include <streamer>
#include <crp>
#include <foreach>
#include <tr_at>
#include <gvar>
#include <yom_buttons>
#include <strlib>
#include <core>
#include <playerprogress>
#include <mxDate>
#include <mxINI>
#include <fixes2>
#include <zcmd>
#include <crashdetect>
#undef MAX_VEHICLES
#define MAX_VEHICLES 1999
#undef MAX_PLAYERS
#define MAX_PLAYERS 300
#define GAMBIT_VERSION				"GamBit 0.3.9"
#define NO_ACCESS					""gbError"У Вас нет доступа для совершения данного действия."
#define INCORRECT_PLAYER_ID 		""gbError"Вы используете неверный id игрока."
#define PLAYER_MUTED				""gbError"У Вас заблокирован чат, Вы не можете его использовать."
#define NO_MONEY					""gbError"У Вас недостаточно средств для совершения данной операции."
#define mysql_format:%0(			%0[0] = EOS,mysql_format(mysql,%0,sizeof(%0),
#define format:%0(		    		%0[0] = EOS,format(%0,sizeof(%0),
#define IsPlayerLogged(%0)			(GetPVarInt(%0,"uLogin") && IsPlayerConnected(%0))
#define GetCharacterName(%0)		(Player[%0][uRPName])
#define ALOG						( 20 )                                      // Лог Администратора
#define DLOG						( 50 )                                      // Лог Доната
#define TYPE_IC						( 0 )
#define TYPE_OOC					( 1 )
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#include <YSI\y_hooks>
#define function%0(%1)     			forward %0(%1); public %0(%1)
#define setDataText(%0,%1,%2)		SetPVarString(%0,%1,%2)
#define getDataText(%0,%1,%2,%3)	GetPVarString(%0,%1,%2,%3)
#define setDataFloat(%0,%1)			SetPVarFloat(%0,%1)
#define getDataFloat(%0,%1)			GetPVarFloat(%0,%1)
#define setData(%0,%1)				SetPVarInt(%0,%1)
#define getData(%0,%1)				GetPVarInt(%0,%1)
#define giveData(%0,%1,%2)			SetPVarInt(%0,%1,GetPVarInt(%0,%1)+%2)
#define delData(%0,%1)				DeletePVar(%0,%1)
#include "gambit\zones.inc"
new mysql;
enum MYSQL_SETTINGS
{
	HOST,
	USERNAME,
	PASSWORD,
	DATABASE,
	PORT
}
new MySQLSettings[MYSQL_SETTINGS][30];
#define GYM_TYPE_VELO 1
#define GYM_TYPE_BARB 2
#define GYM_TYPE_BENCH 3
#define GYM_TYPE_TRACK 4
#define MAX_CALLS               20
#define MAX_OBJECT              500
enum GYM_DATA
{
	gymType,
	gymStatus,
	Float: gymPosX,
	Float: gymPosY,
	Float: gymPosZ,
	Float: gymPosA,
	gymAreaID
}
new GymData[13][GYM_DATA] = {
	{GYM_TYPE_VELO, false, 772.5620, 8.8898, 1000.7067, 90.0, -1},
	{GYM_TYPE_TRACK, false, 773.4795, -1.2654, 1000.7258, 181.4563, -1},
	{GYM_TYPE_VELO, false, 769.6881,-48.4213,1000.5859,88.1668, -1},
	{GYM_TYPE_TRACK, false, 759.5814,-46.7660,1000.5859,181.8310, -1},
	{GYM_TYPE_BENCH, false, 772.9084, 1.4091, 1000.7210,271.5546, -1},
	{GYM_TYPE_BARB, false, 773.4990, 5.3875, 1000.7802,91.7721, -1},
	{GYM_TYPE_BENCH, false, 766.2820,-47.3575,1000.5859,179.4337, -1},
	{GYM_TYPE_BARB, false, 756.3661,-47.9356,1000.7802,358.0120, -1},//8
	{GYM_TYPE_TRACK, false, 758.3260,-64.2099,1000.6525,181.4217, -1},
	{GYM_TYPE_BENCH, false, 764.9002,-60.5749,1000.6563,0.3367, -1},
	{GYM_TYPE_BENCH, false, 768.5301,-60.4017,1000.6563,357.8300, -1},
	{GYM_TYPE_VELO, false, 775.1597,-69.1647,1000.6541,90.8675, -1},
	{GYM_TYPE_BARB, false, 759.0962,-60.6477,1000.7802,358.4567, -1}
};
new sadoc_eat[4];
new bool: closeserver = false;
new door[25], bool:doorst[24],
	lift[2], lift1door[8];
new bool: caradmin[MAX_VEHICLES];
new gTruckLoadTurn[1][10];
new Text3D:gTruckLoadTurnText[1];
#define GivePVarInt(%0,%1,%2) SetPVarInt(%0, %1, GetPVarInt(%0, %1) + %2)
#define COLOR_BOX 0x00000050
new MedicalSkinList[12] = { 275, 276, 70, 274, 228, 0, 0, 0, 0, 0, 0, 0 };
new MedicalSkinListMale[12] = { 308, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
new PlayerText: gCarInfoBuy;
new Text3D:vehicle3Dtext[MAX_VEHICLES];
new vehiclecallsign[MAX_VEHICLES];
new VehicleObject[MAX_VEHICLES];
#define MAX_RAD_NAME (16)
#define TIME_UPDATE (1500)
new ObjectListLen [] = {978, 979, 981, 1997, 1237, 1422, 1423, 1427, 1434, 11738, 973, 1238, 1424, 1425, 1459, 13011, 12839, 12950, 1437, 1428, 18728, 19834}; //САМИ ОБЪЕКТЫ
new cObjectS;
enum ObjectList
{
	oID,
	Float: Obj_X,
	Float: Obj_Y,
	Float: Obj_Z,
	Float: ObjRx,
	Float:ObjRy,
	Float:ObjRz,
	oModel,
	oObject,
	Text3D:o3DText,
};
new ObjList[MAX_OBJECT][ObjectList];

enum calInfo
{
	cID,
	cName[MAX_PLAYER_NAME],
	Float: cX,
	Float: cY,
	Float: cZ,
	bool: cStatus = false,
	cZone[30]
};
new CallInfo[MAX_CALLS][calInfo];

new RadioVeh [ MAX_VEHICLES ] = { -1, ... };
new RadioVehStation[MAX_VEHICLES][72];
new Radio[ 12 ][ 2 ][ 128 ] = {
	//{ "Gambit Radio", "http://www.g-rp.su/gambitrp.m3u"},
	{ "Radio Los-Santos", "http://ls-gov.ru/lsfm.m3u"},
	{ "Station 88", "http://ls-gov.ru/grind_fm.m3u"},
	{ "Station 92", "http://ls-gov.ru/record_club_320.m3u" },
	{ "Station 133", "http://ls-gov.ru/defjay.m3u" },
	{ "Station 212", "http://ls-gov.ru/bassdrive.m3u" },
	{ "Station 264", "http://ls-gov.ru/classic.m3u" },
	{ "Station 311", "http://ls-gov.ru/jazz.m3u" },
	{ "Station 367", "http://ls-gov.ru/easylisten.m3u" },
	{ "Station 452", "http://ls-gov.ru/metall.m3u" },
	{ "Station 452", "http://ls-gov.ru/dnb.m3u" },
	{ "Station 899", "http://ls-gov.ru:8000/play"},
	{ "Собственная радиостанция", "" }
};
enum Flags:(<<= 1)
{
    YN = 1,
};
new Flags:playerFlags[MAX_PLAYERS];
new KeyYN[MAX_PLAYERS char];
new PlayerText: YNText[MAX_PLAYERS][2];
new PlayerBar: universalbar[MAX_PLAYERS];
#define KEY_AIM                 (128)
enum callInfo
{
	bool: cStatus,
	cPlayerID,
};
new CallInfoList[20][callInfo];
#define V::                     VInfo
#define D::                     DInfo
#define G::                     GInfo
#define OF::                    OFInfo
#define S::                     SkladInfo
#define WD::                    WoodsInfo
#define Bizz::                  BusinessInfo
#define Car::                   CarInfo
#define F::                     FracInfo
#define Border::                BorderInfo
#define Product::               ProductsInfo
#define Fuel::                  FuelInfo
#define AD::                    AdvertInfo
#define MAX_DAMAGES (20)
#define MAX_ZONES               14
#define MAX_GATE                10
#define MAX_TELEPORT            9
#define MAX_MARSH               4
#define MAX_SKLAD               1
#define MAX_WOODS               61
#define MAX_SLOTS               56
#define MAX_HOUSES_OBJECTS      30
#define MAX_NUMBERS_PLAYERS     10
#define MAX_BUSINESS            100
#define MAX_CARS_BUY            2000
#define MAX_FUELS               79
#define MAX_FRAC                10
#define MAX_PRODUCT_INFO        30
#define MAX_FUEL_INFO           30
#define MAX_ADVERT_INFO         10
#define MAX_PAYNSPRAY           10
#define MAX_OBJECTS_DROP        1000
#define MAX_FUEL_IN_ZAVOD       (1000000)
#define MAX_WOODS_IN_VEHICLE    (1000)
#define MAX_MEBEL_IN_VEHICLE    (50)
#define MAX_FUEL_IN_VEHICLE     (2000)
#define MAX_COUNT_BACK_TAXI     (600)
#define MAX_COUNT_BACK_DALN     (600)
#define MAX_COUNT_BACK_BUS      (600)
#define MAX_COUNT_WOOD_ZONE     (60)
#define MAX_TIME_UNFREEZE_P     (2)
#define MAX_TIME_UNFREEZE_J     (10)
#define MAX_PRODUCTS_INCAR      (2000)
#define MAX_BUSINESS_BURGERS    (50000)
#define PRICE_BUSINESS_UPDATE1  (15000)
#define PRICE_BUSINESS_UPDATE2  (15000)
#define PRICE_BUSINESS_UPDATE3  (6000)
#define MAX_PLAYER_KG           (25.0)
#define d_auth                  30
#define d_death           		60
#define d_menu                  90
#define d_taxi                  110
#define d_bus                   200
#define d_daln                  230
#define d_bank                  260
#define d_woods                 290
#define d_house                 310
#define d_create                340
#define d_phone                 370
#define d_a_menu                430
#define d_buy_menu              460
#define d_house_panel           4050
#define d_bizz_menu             490
#define d_bizz                  510
#define d_inventory             560
#define d_fill                  600
#define d_frac                  630
#define d_police                660
#define d_medical               700
#define d_cnn                   710
#define d_licenses              740
#define d_admins                770
#define d_mebelbuy              830
#define d_firedp                860
#define d_meria                 910
#define d_target                940
#define d_salon                 1000
#define d_repair                1100
#define d_returnmoney           1300
#define d_radio           		1400
#define d_donate                1500
#define d_mdc                   1900
#define d_amoniment             2010
#define d_spec             		2100
#define d_makeleader            2200
#define d_apartment             2300
#define d_enterfrac             2400
#define d_accept                2540
#define d_objectlist            2580
#define d_cigg             		2590
#define d_anim                  3020
#define COLOR_FADE1             0xE6E6E6E6
#define COLOR_FADE2             0xC8C8C8C8
#define COLOR_FADE3             0xAAAAAAAA
#define COLOR_FADE4             0x8C8C8C8C
#define COLOR_FADE5             0x6E6E6E6E
#define C_LIGHTRED          	0xFF6347AA
#define C_LIGHTGREEN 			0x9ACD32AA
#define C_GREY2         		0xFFEA6FAA
#define C_YELLOW                0xFFFF00AA
#define C_GRAY 					0xAFAFAFAA
#define C_GREEN 				0x33AA33AA
#define C_PINK 					0xC2A2DAFF
#define C_RED 					0xAA3333AA
#define C_WHITE 				0xFFFFFFFF
#define C_TAXI 					0xFFCC00FF
#define C_BLUE                  0x4a86b6FF
#define C_ORANGE                0xFF9945AA
#define cYELLOW                 "{FFFF00}"
#define cGRAY                   "{AFAFAF}"
#define cGREEN                  "{33AA33}"
#define cPINK                   "{E75480}"
#define cRED                    "{AA3333}"
#define cWHITE                  "{FFFFFF}"
#define cTAXI                   "{FFCC00}"
#define cBLUE                   "{4a86b6}"
#define gbError                  "{AA3333}| {ffffff}"
#define gbAccess                 "{33AA33}| {ffffff}"
#define gbInfo                   "{FFFF00}| {ffffff}"
#define PRESSED(%0) 			(((newkeys & (%0)) == (%0)) && ((oldkeys & (%0)) != (%0)))
#define HOLDING(%0)             ((newkeys & (%0)) == (%0))
#define RandomEx(%1,%2) 		(random(%2-%1)+%1)
#define MAX_CHARS_PER_LINE      80
#define FINAL_DOTS
native IsValidVehicle(vehicleid);
#define IsKicked(%0) GetPVarInt(%0, "kicked")
new
    ataxils[2],
	buscars[2],
	dalncars[2],
	comm[2],
	carsalon[2][4],
	sheriffandpolice[2]
;
new
	Text:FermFon[2],
    Text:dalnmenu[9],
    Text:MenuPlayer[21],
    Text:SpeedFon[3],
    Text:phoneOne[28],
    Text:phoneTwo[19],
    Text:phoneThree[19],
    Text:HungerFon[2],
    Text:phoneFonOne[3],
    Text:phoneFonTwo[3],
    Text:phoneFonThree[3],
    Text:buyingShopFon[16],
    Text:furnitureBuy[6],
    Text:invPlayer[22],
	Text:Logo[4]
;
new
    PlayerTrailer[MAX_PLAYERS],
    PlayerTrailerTime[MAX_PLAYERS],
    PlayerBuyingItemsShop[MAX_PLAYERS][16],
    PlayerBuyingItemsShopProd[MAX_PLAYERS][16],
	PlayerUseDrink[MAX_PLAYERS],
	PlayerCountMinute[MAX_PLAYERS]
;
new PlayerText:JobValueText[MAX_PLAYERS];
new PlayerText:RadioShow[3][MAX_PLAYERS];
new
	PlayerText:FermSelectSkin[3][MAX_PLAYERS],
    PlayerText:dalnmenuplayer[MAX_PLAYERS],
    PlayerText:menuPlayer[3][MAX_PLAYERS],
    PlayerText:invSPlayer[MAX_PLAYERS][61],
    PlayerText:Speed[8][MAX_PLAYERS],
    PlayerText:slotUse[18][MAX_PLAYERS],
    PlayerText:Warehouse[30][MAX_PLAYERS],
    PlayerText:iconUse[3][MAX_PLAYERS],
    PlayerText:HungerProgres[MAX_PLAYERS],
    PlayerText:buyingShopItems[16][MAX_PLAYERS],
	PlayerText:buyingShopInfo[16][MAX_PLAYERS],
	PlayerText:infoIPlayer[MAX_PLAYERS][8],
	PlayerText:furniturePrice[MAX_PLAYERS],
	PlayerText:NewSkinSelect[13][MAX_PLAYERS]
	//PlayerText:TextDrawForBar[2][MAX_PLAYERS]
;

new strZones[MAX_ZONES];
new
    Text3D:InfoFermText[10]
;
new
	PaynSpray[MAX_PAYNSPRAY]
;
new
    countWoods,
	taxicall = -1,
	countSave,
	cBizz,
	cAdvert,
	MebelZavod,
	ToplivoZavod,
	WoodsZavod
;
new
    eng,
	light,
	other1,
	other2,
	other3,
	other4,
	other5,

	adminsPanel[15],
	ghour,
	gminute,
	gsecond,
	weather
;
new
    gDoors[20],
	gDoorsButton[20]
;
new phoneName[MAX_PLAYERS][10][MAX_PLAYER_NAME];
enum pData {
    bool:dTaxiDuty,
    dTaxiKey,
    dTaxiFare,
    dArendTaxi,
    bool:dBusDuty,
    dBusKey,
    dJobMarsh,
    bool:dDalnDuty,
    dDalnKey,
    dArendDaln,
    dWoodsDuty,
    bool:dPhone,
    dRentVehicleID,
    dRentVehicleTime,
    dGymTimer,
	bool: dKilled,
}
new D::[MAX_PLAYERS][pData];
enum vData 
{
	vBuyingCar,
    vRentCar[2],
	bool:vLock,
	bool:vLimit,
	bool:vNoBag,
	Float:vFuel,
	vTaxiDriver,
	vTaxiText,
	vBusDriver,
	vDalnDriver,
	vWoods,
	vMebel,
	vToplivo,
	vProducts,
	vProductsID,
	Text3D:vBusText,
	Text3D:vTextTrailer,
	Text3D:vProductsText,
	Float:vMile,
	Float:vHealth,
	vCountMile,
	vInvSlot[18],
	vInvSlotKol[18],
	vCrime,
	vehicle_boat,
	vehicle_luke,
	Text3D: vehicle_luke_text,
	vehicle_seat,
	vehicle_state_window[4],
	vehicle_water[4],
}
new V::[MAX_VEHICLES][vData];
new Float:toplivoDriver[] = { 104.0, 1486.0, 289.0, 1338.0 };
new JobInfo[][] = {
	"Нет",
	"Водитель такси",
	"Водитель автобуса",
	"Дальнобойщик"
};
enum gInfo {
	gObject,
	Float:gP[6],
	Float:gPe[6],
	gJob,
	gFrac,
}
new G::[MAX_GATE][gInfo] = {
	{968,{1141.64,-1201.89,18.89,0.00,-92.00,90.00},{1141.64,-1201.89,18.89,0.00,-12.00,90.00},1,0},
	{968,{2236.71,-2217.96,13.25,0.00,-90.00,-45.00},{2236.71,-2217.96,13.25,0.00,-5.00,-45.00},3,0},
	{968,{1544.69226,-1630.80334,13.07000,0.0,90.0,90.0},{1544.69226,-1630.80334,13.07000,0.0,0.0,90.0},0,2},
	{968,{1139.35815, -1384.83997, 13.43300, 0.00000, -90.00000, 180.00000},{1139.35815, -1384.83997, 13.43300, 0.0000, 0.0000, 180.0000},0,3},
	{968,{1185.4700, -1312.3979, 13.2850, 0.0000, -90.0000, -91.9800},{1185.4700, -1312.3979, 13.2850, 0.0000, 0.0000, -91.9800},0,3},
	{968,{2317.66992, -1373.80701, 23.75000, 0.00000, 90.00000, 0.00000},{2317.66992, -1373.80701, 23.75000, 0.00000, 0.00000, 0.00000},0,2},//,
	{968,{1144.11304, -1291.15820, 13.20990, 0.00000, -90.00000, 0.00000},{1144.11304, -1291.15820, 13.20990, 0.00000, 0.00000, 0.00000},0,5},
	{968,{1070.680,  1357.709,  10.470,  0.000,  -90.000,  0.000}, {1070.680,1357.709,10.470,0.000,0.000,0.000},0,5 },
	{968,{1133.978,  1362.979,  10.470,  0.000,  -90.000,  180.000}, {1133.978,1362.979,10.470,0.000,0.000,180.000},0,5 },
	{968,{1150.720,  1362.979,  10.470,  0.000,  90.000,  180.000}, {1150.720,1362.979,10.470,0.000,0.000,180.000},0,5 }
};
new gID[MAX_GATE];
new gTime[MAX_GATE];
new bool:gStatus[MAX_GATE];
enum sInfo {
	sFerm[7],
	sProducts,
	wsWoods,
	wsWoodsSklad,
	Text3D:wsWoodsT,
	Text3D:wsWoodsTS[2],
	sMeria[10],
	sHouses,
	sBusiness,
	sNalog[14],
	sBizzSettings[15]
};
new S::[MAX_SKLAD][sInfo];
enum woodsInfo {
	woodObject,
	woodZone,
	bool:woodUse,
	bool:woodIsDrop,
	woodCount,
};
new WD::[MAX_WOODS][woodsInfo];
enum objInfo {
	objObject,
	Float:objPos[3],
	objDrop[2],
	Text3D:objText,
}
new _objectInfo[MAX_OBJECTS_DROP][objInfo];
new BoxUse[MAX_OBJECTS_DROP] = {0, ...};
enum invInfo {
	invName[MAX_PLAYER_NAME],
	invSlot[MAX_SLOTS],
	invSlotKol[MAX_SLOTS],
}
enum invItems {
	invID,
	invName[50],
	invObject,
	invText[300],
	Float:invKg,
	Float:invP[4],
 	invNumber
}
new Inv[MAX_PLAYERS][invInfo];
new _itemsInfo[][invItems] = {
    {0,"Пусто",0,"",0.0,{0.0,0.0,0.0,1.0}},

    {0,"Одежда",1,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 1
    {0,"Одежда",2,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 2
    {0,"Одежда",3,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 3
    {0,"Одежда",4,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 4
    {0,"Одежда",5,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 5
    {0,"Одежда",6,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 6
    {0,"Одежда",7,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 7
    {0,"Одежда",8,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 8
    {0,"Одежда",9,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 9
    {0,"Одежда",10,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 10
    {0,"Одежда",11,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 11
    {0,"Одежда",12,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 12
    {0,"Одежда",13,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 13
    {0,"Одежда",14,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 14
    {0,"Одежда",15,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 15
    {0,"Одежда",16,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 16
    {0,"Одежда",17,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 17
    {0,"Одежда",18,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 18
    {0,"Одежда",19,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 19
    {0,"Одежда",20,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 20
    {0,"Одежда",21,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 21
    {0,"Одежда",22,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 22
    {0,"Одежда",23,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 23
    {0,"Одежда",24,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 24
    {0,"Одежда",25,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 25
    {0,"Одежда",26,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 26
    {0,"Одежда",27,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 27
    {0,"Одежда",28,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 28
    {0,"Одежда",29,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 29
    {0,"Одежда",30,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 30
    {0,"Одежда",31,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 31
    {0,"Одежда",32,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 32
    {0,"Одежда",33,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 33
    {0,"Одежда",34,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 34
    {0,"Одежда",35,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 35
    {0,"Одежда",36,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 36
    {0,"Одежда",37,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 37
    {0,"Одежда",38,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 38
    {0,"Одежда",39,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 39
    {0,"Одежда",40,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 40
    {0,"Одежда",41,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 41
    {0,"Одежда",42,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 42
    {0,"Одежда",43,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 43
    {0,"Одежда",44,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 44
    {0,"Одежда",45,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 45
    {0,"Одежда",46,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 46
    {0,"Одежда",47,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 47
    {0,"Одежда",48,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 48
    {0,"Одежда",49,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 49
    {0,"Одежда",50,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 50
    {0,"Одежда",51,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 51
    {0,"Одежда",52,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 52
    {0,"Одежда",53,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 53
    {0,"Одежда",54,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 54
    {0,"Одежда",55,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 55
    {0,"Одежда",56,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 56
    {0,"Одежда",57,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 57
    {0,"Одежда",58,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 58
    {0,"Одежда",59,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 59
    {0,"Одежда",60,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 60
    {0,"Одежда",61,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 61
    {0,"Одежда",62,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 62
    {0,"Одежда",63,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 63
    {0,"Одежда",64,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 64
    {0,"Одежда",65,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 65
    {0,"Одежда",66,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 66
    {0,"Одежда",67,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 67
    {0,"Одежда",68,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 68
    {0,"Одежда",69,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 69
    {0,"Одежда",70,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 70
    {0,"Одежда",71,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 71
    {0,"Одежда",72,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 72
    {0,"Одежда",73,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 73
    {0,"Одежда",74,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 74
    {0,"Одежда",75,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 75
    {0,"Одежда",76,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 76
    {0,"Одежда",77,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 77
    {0,"Одежда",78,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 78
    {0,"Одежда",79,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 79
    {0,"Одежда",80,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 80
    {0,"Одежда",81,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 81
    {0,"Одежда",82,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 82
    {0,"Одежда",83,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 83
    {0,"Одежда",84,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 84
    {0,"Одежда",85,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 85
    {0,"Одежда",86,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 86
    {0,"Одежда",87,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 87
    {0,"Одежда",88,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 88
    {0,"Одежда",89,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 89
    {0,"Одежда",90,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 90
    {0,"Одежда",91,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 91
    {0,"Одежда",92,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 92
    {0,"Одежда",93,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 93
    {0,"Одежда",94,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 94
    {0,"Одежда",95,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 95
    {0,"Одежда",96,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 96
    {0,"Одежда",97,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 97
    {0,"Одежда",98,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 98
    {0,"Одежда",99,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 99
    {0,"Одежда",100,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 100
    {0,"Одежда",101,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 101
    {0,"Одежда",102,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 102
    {0,"Одежда",103,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 103
    {0,"Одежда",104,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 104
    {0,"Одежда",105,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 105
    {0,"Одежда",106,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 106
    {0,"Одежда",107,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 107
    {0,"Одежда",108,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 108
    {0,"Одежда",109,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 109
    {0,"Одежда",110,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 110
    {0,"Одежда",111,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 111
    {0,"Одежда",112,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 112
    {0,"Одежда",113,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 113
    {0,"Одежда",114,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 114
    {0,"Одежда",115,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 115
    {0,"Одежда",116,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 116
    {0,"Одежда",117,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 117
    {0,"Одежда",118,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 118
    {0,"Одежда",119,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 119
    {0,"Одежда",120,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 120
    {0,"Одежда",121,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 121
    {0,"Одежда",122,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 122
    {0,"Одежда",123,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 123
    {0,"Одежда",124,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 124
    {0,"Одежда",125,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 125
    {0,"Одежда",126,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 126
    {0,"Одежда",127,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 127
    {0,"Одежда",128,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 128
    {0,"Одежда",129,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 129
    {0,"Одежда",130,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 130
    {0,"Одежда",131,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 131
    {0,"Одежда",132,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 132
    {0,"Одежда",133,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 133
    {0,"Одежда",134,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 134
    {0,"Одежда",135,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 135
    {0,"Одежда",136,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 136
    {0,"Одежда",137,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 137
    {0,"Одежда",138,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 138
    {0,"Одежда",139,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 139
    {0,"Одежда",140,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 140
    {0,"Одежда",141,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 141
    {0,"Одежда",142,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 142
    {0,"Одежда",143,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 143
    {0,"Одежда",144,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 144
    {0,"Одежда",145,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 145
    {0,"Одежда",146,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 146
    {0,"Одежда",147,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 147
    {0,"Одежда",148,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 148
    {0,"Одежда",149,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 149
    {0,"Одежда",150,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 150
    {0,"Одежда",151,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 151
    {0,"Одежда",152,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 152
    {0,"Одежда",153,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 153
    {0,"Одежда",154,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 154
    {0,"Одежда",155,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 155
    {0,"Одежда",156,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 156
    {0,"Одежда",157,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 157
    {0,"Одежда",158,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 158
    {0,"Одежда",159,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 159
    {0,"Одежда",160,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 160
    {0,"Одежда",161,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 161
    {0,"Одежда",162,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 162
    {0,"Одежда",163,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 163
    {0,"Одежда",164,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 164
    {0,"Одежда",165,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 165
    {0,"Одежда",166,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 166
    {0,"Одежда",167,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 167
    {0,"Одежда",168,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 168
    {0,"Одежда",169,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 169
    {0,"Одежда",170,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 170
    {0,"Одежда",171,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 171
    {0,"Одежда",172,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 172
    {0,"Одежда",173,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 173
    {0,"Одежда",174,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 174
    {0,"Одежда",175,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 175
    {0,"Одежда",176,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 176
    {0,"Одежда",177,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 177
    {0,"Одежда",178,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 178
    {0,"Одежда",179,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 179
    {0,"Одежда",180,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 180
    {0,"Одежда",181,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 181
    {0,"Одежда",182,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 182
    {0,"Одежда",183,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 183
    {0,"Одежда",184,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 184
    {0,"Одежда",185,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 185
    {0,"Одежда",186,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 186
    {0,"Одежда",187,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 187
    {0,"Одежда",188,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 188
    {0,"Одежда",189,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 189
    {0,"Одежда",190,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 190
    {0,"Одежда",191,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 191
    {0,"Одежда",192,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 192
    {0,"Одежда",193,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 193
    {0,"Одежда",194,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 194
    {0,"Одежда",195,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 195
    {0,"Одежда",196,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 196
    {0,"Одежда",197,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 197
    {0,"Одежда",198,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 198
    {0,"Одежда",199,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 199
    {0,"Одежда",200,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 200
    {0,"Одежда",201,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 201
    {0,"Одежда",202,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 202
    {0,"Одежда",203,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 203
    {0,"Одежда",204,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 204
    {0,"Одежда",205,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 205
    {0,"Одежда",206,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 206
    {0,"Одежда",207,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 207
    {0,"Одежда",208,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 208
    {0,"Одежда",209,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 209
    {0,"Одежда",210,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 210
    {0,"Одежда",211,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 211
    {0,"Одежда",212,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 212
    {0,"Одежда",213,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 213
    {0,"Одежда",214,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 214
    {0,"Одежда",215,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 215
    {0,"Одежда",216,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 216
    {0,"Одежда",217,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 217
    {0,"Одежда",218,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 218
    {0,"Одежда",219,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 219
    {0,"Одежда",220,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 220
    {0,"Одежда",221,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 221
    {0,"Одежда",222,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 222
    {0,"Одежда",223,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 223
    {0,"Одежда",224,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 224
    {0,"Одежда",225,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 225
    {0,"Одежда",226,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 226
    {0,"Одежда",227,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 227
    {0,"Одежда",228,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 228
    {0,"Одежда",229,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 229
    {0,"Одежда",230,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 230
    {0,"Одежда",231,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 231
    {0,"Одежда",232,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 232
    {0,"Одежда",233,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 233
    {0,"Одежда",234,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 234
    {0,"Одежда",235,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 235
    {0,"Одежда",236,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 236
    {0,"Одежда",237,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 237
    {0,"Одежда",238,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 238
    {0,"Одежда",239,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 239
    {0,"Одежда",240,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 240
    {0,"Одежда",241,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 241
    {0,"Одежда",242,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 242
    {0,"Одежда",243,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 243
    {0,"Одежда",244,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 244
    {0,"Одежда",245,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 245
    {0,"Одежда",246,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 246
    {0,"Одежда",247,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 247
    {0,"Одежда",248,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 248
    {0,"Одежда",249,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 249
    {0,"Одежда",250,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 250
    {0,"Одежда",251,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 251
    {0,"Одежда",252,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 252
    {0,"Одежда",253,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 253
    {0,"Одежда",254,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 254
    {0,"Одежда",255,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 255
    {0,"Одежда",256,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 256
    {0,"Одежда",257,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 257
    {0,"Одежда",258,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 258
    {0,"Одежда",259,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 259
    {0,"Одежда",260,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 260
    {0,"Одежда",261,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 261
    {0,"Одежда",262,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 262
    {0,"Одежда",263,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 263
    {0,"Одежда",264,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 264
    {0,"Одежда",265,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 265
    {0,"Одежда",266,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 266
    {0,"Одежда",267,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 267
    {0,"Одежда",268,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 268
    {0,"Одежда",269,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 269
    {0,"Одежда",270,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 270
    {0,"Одежда",271,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 271
    {0,"Одежда",272,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 272
    {0,"Одежда",273,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 273
    {0,"Одежда",274,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 274
    {0,"Одежда",275,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 275
    {0,"Одежда",276,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 276
    {0,"Одежда",277,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 277
    {0,"Одежда",278,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 278
    {0,"Одежда",279,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 279
    {0,"Одежда",280,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 280
    {0,"Одежда",281,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 281
    {0,"Одежда",282,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 282
    {0,"Одежда",283,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 283
    {0,"Одежда",284,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 284
    {0,"Одежда",285,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 285
    {0,"Одежда",286,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 286
    {0,"Одежда",287,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 287
    {0,"Одежда",288,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 288
    {0,"Одежда",289,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 289
    {0,"Одежда",290,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 290
    {0,"Одежда",291,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 291
    {0,"Одежда",292,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 292
    {0,"Одежда",293,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 293
    {0,"Одежда",294,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 294
    {0,"Одежда",295,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 295
    {0,"Одежда",296,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 296
    {0,"Одежда",297,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 297
    {0,"Одежда",298,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 298
    {0,"Одежда",299,"Одевается на вашего персонажа",0.5,{0.000000, 0.000000, 0.000000, 1.000000}}, // 299
	{0,"Синие спорт. очки",19140,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 300
	{0,"Красные спорт. очки",19139,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 301
	{0,"Черные очки",19033,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 302
	{0,"Очки \"Синяя молния\"",19035,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 303
	{0,"Чёрные прозр. очки",19022,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 304
	{0,"Розовые очки",19032,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 305
	{0,"Бежевые очки",19031,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 306
	{0,"Зеленые авиаторы",19029,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 307
	{0,"Жёлтые авиаторы",19028,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 308
	{0,"Оранжевые авиаторы",19027,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 309
	{0,"Фиолетовые авиаторы",19024,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 310
	{0,"Красные очки",19019,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 311
	{0,"Оранжевые очки",19018,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 312
	{0,"Желтые очки",19017,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 313
	{0,"Очки \"X-RAY\"",19016,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 314
	{0,"Серые очки",19015,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 315
	{0,"Очки в клетку",19014,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 316
	{0,"Очки \"Ясный взор\"",19013,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 317
	{0,"Серые очки",19012,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 318
	{0,"Очки \"Гипноз\"",19011,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 319
	{0,"Оранжевые очки",19007,"Аксессуар для защиты глаз от солнца.",0.1,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 320
	{1,"Кастет",331,"Контактное оружие ближнего боя.\nСпособное нанести тяжёлые увечья.",0.5,{0.000000, -30.000000, 0.000000, 1.500000}}, // 321
	{2,"Пол. дубинка",334,"Несмертельное оружие,спецсредство,используемое правоохранительными,охранными органами и силовыми структурами.",1.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 322
	{3,"Нож",335,"Холодное оружие способное наносить режущие и колотые раны.",0.3,{0.000000, -30.000000, 0.000000, 1.500000}}, // 323
	{4,"Бейсб. бита",336,"Бита выполнена в виде круглого в сечении стержня.\nИгрок удерживает биту в её самой тонкой части.\nБита равномерно утолщается, достигая максимальной толщины в части, используемой для удара", 1.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 324
	{5,"Лопата",337,"Ручной инструмент для работы с грунтом.",2.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 325
	{6,"Бронежилет",1242,"Используется для защиты тела от пуль.",8.0,{0.000000, 0.000000, 0.000000, 1.000000}}, // 326
	{7,"Катана",339,"Длинный японский меч",1.7,{0.000000, -30.000000, 0.000000, 1.500000}}, // 327
	{8,"Пурп. Дилдо",326,"В разработке ...", 0.3,{0.000000, -30.000000, 0.000000, 1.500000}}, // 328
	//легальное оружие!
	{9,"Кольт 1911",346,"Самозарядный пистолет под патрон .45 ACP.\n\n"gbInfo"Используемые патроны: 9mm", 2.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 329
	{10,"Кольт 1911 с глушителем",347,"Самозарядный пистолет под патрон .45 ACP.с глушителем\n\n"gbInfo"Используемые патроны: 9mm",2.1,{0.000000, -30.000000, 0.000000, 1.500000}}, // 330
	{11,"Пуст. орел",348,"Самозарядный пистолет большого калибра (до 12,7 мм).\nПозиционируется как охотничье оружие и оружие для самозащиты от диких зверей и гражданских лиц.\n\n"gbInfo"Используемые патроны: .50 Action", 3.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 331
	{12,"Дробовик",349,"Гладкоствольное огнестрельное оружие, использующее энергию фиксированного снаряда \nдля стрельбы некоторым количеством небольших круглых шариков (дробью), либо пулями.\n\n"gbInfo"Используемые патроны: 12mm", 5.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 332
	{13,"UZI",352,"Cемейство пистолет-пулемётов, выпускаемых израильским концерном Israel Military Industries\n\n"gbInfo"Используемые патроны: 9.19mm",3.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 333
	{14,"MP5",353,"Cемейство пистолетов-пулемётов, разработанных немецким \nпроизводителем стрелкового оружия, фирмой Heckler & Koch\n\n"gbInfo"Используемые патроны: 9.19mm", 4.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 334
	{15,"АК-47",355,"Автомат, принятый на вооружение в СССР в 1949 году\n\n"gbInfo"Используемые патроны: 7.62mm",5.4,{0.000000, -30.000000, 0.000000, 1.500000}}, // 335
	{16,"М4А1",356,"Автомат, созданный в США на основе М16А2 изначально для \nвооружения экипажей боевых машин и расчетов техники.\n\n"gbInfo"Используемые патроны: 5.56mm",5.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 336
	{17,"TEC-9",372,"Самозарядный 9-мм пистолет, разработанный в Швеции в 1980-х годах.\nПопулярен в преступном мире из за возможности переделки для ведения автоматического огня\n\n"gbInfo"Используемые патроны: 9.19mm",3.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 337
	{18,"Винтовка",357,"Нарезное стрелковое оружие, конструктивно предназначенное для удержания и \nуправления при стрельбе двумя руками с упором приклада в плечо\n\n"gbInfo"Используемые патроны: 7.62mm", 5.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 338
	{19,"Баллончик",365,"Баллончик наполненый краской различного цвета.", 0.3,{0.000000, -30.000000, 0.000000, 1.500000}}, // 339
	{20,"Огнетушитель",366,"Переносное или передвижное устройство для тушения очагов пожара \nза счет выпуска запасенного огнетушащего вещества.",6.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 340
	{21,"Фотоаппарат",367,"Устройство (прибор, механизм, конструкция) для получения и \nфиксации неподвижных изображений материальных объектов при помощи света.",1.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 341
	{22,"Пурп.Фаллоимитатор",321,"В разработке ...",0.5,{0.000000, -30.000000, 0.000000, 1.500000}}, // 342
	{0,"Армейская кепка",18926,"Для защиты от солнца и для красоты",0.1,{90.000000, -90.000000, 90.000000, 1.000000}}, // 343
	{0,"Кепка \"Синий узор\"",18927,"Для защиты от солнца и для красоты",0.1,{90.000000, -90.000000, 90.000000, 1.000000}}, // 344
	{0,"Кепка \"Кислотная\"",18928,"Для защиты от солнца и для красоты",0.1,{90.000000, -90.000000, 90.000000, 1.000000}}, // 345
	{0,"Кепка \"Чёрный узор\"",18929,"Для защиты от солнца и для красоты",0.1,{90.000000, -90.000000, 90.000000, 1.000000}}, // 346
	{0,"Кепка \"Лава\"",18930,"Для защиты от солнца и для красоты",0.1,{90.000000, -90.000000, 90.000000, 1.000000}}, // 347
	{0,"Кепка \"Молния\"",18931,"Для защиты от солнца и для красоты",0.1,{90.000000, -90.000000, 90.000000, 1.000000}}, // 348
	{0,"Кепка \"Безумие\"",18932,"Для защиты от солнца и для красоты",0.1,{90.000000, -90.000000, 90.000000, 1.000000}}, // 349
	{0,"Кепка \"Серый узор\"",18933,"Для защиты от солнца и для красоты",0.1,{90.000000, -90.000000, 90.000000, 1.000000}}, // 350
	{0,"Розовая кепка",18934,"Для защиты от солнца и для красоты",0.1,{90.000000, -90.000000, 90.000000, 1.000000}}, // 351
	{0,"Жёлтая кепка",18935,"Для защиты от солнца и для красоты",0.1,{90.000000, -90.000000, 90.000000, 1.000000}}, // 352
	{0,"Бандана с черепами",18911,"Головной убор в виде платка большого размера",0.1,{90.000000, 90.000000, 0.000000, 1.000000}}, // 353
	{0,"Бандана \"Чёрный узор\"",18912,"Головной убор в виде платка большого размера",0.1,{90.000000, 90.000000, 0.000000, 1.000000}}, // 354
	{0,"Бандана \"Зелёный узор\"",18913,"Головной убор в виде платка большого размера",0.1,{90.000000, 90.000000, 0.000000, 1.000000}}, // 355
	{0,"Бандана \"Камуфляж\"",18914,"Головной убор в виде платка большого размера",0.1,{90.000000, 90.000000, 0.000000, 1.000000}}, // 356
	{0,"Бандана \"Безумие\"",18915,"Головной убор в виде платка большого размера",0.1,{90.000000, 90.000000, 0.000000, 1.000000}}, // 357
	{0,"Бандана \"Абстракции\"",18916,"Головной убор в виде платка большого размера",0.1,{90.000000, 90.000000, 0.000000, 1.000000}}, // 358
	{0,"Бандана \"Молнии\"",18917,"Головной убор в виде платка большого размера",0.1,{90.000000, 90.000000, 0.000000, 1.000000}}, // 359
	{0,"Бандана \"Чёрный узор 2\"",18918,"Головной убор в виде платка большого размера",0.1,{90.000000, 90.000000, 0.000000, 1.000000}}, // 360
	{0,"Бандана \"Серый узор\"",18919,"Головной убор в виде платка большого размера",0.1,{90.000000, 90.000000, 0.000000, 1.000000}}, // 361
	{0,"Бандана \"Коноплянка\"",18920,"Головной убор в виде платка большого размера",0.1,{90.000000, 90.000000, 0.000000, 1.000000}}, // 362
	{0,"Наушники белые",19421,"Для прослушивания звуковой информации",0.1,{120.000000, 0.000000, 0.000000, 1.000000}}, // 363
	{0,"Наушники чёрные",19422,"Для прослушивания звуковой информации",0.1,{120.000000, 0.000000, 0.000000, 1.000000}}, // 364
	{0,"Наушники розовые",19423,"Для прослушивания звуковой информации",0.1,{120.000000, 0.000000, 0.000000, 1.000000}}, // 365
	{0,"Наушники синие",19424,"Для прослушивания звуковой информации",0.1,{120.000000, 0.000000, 0.000000, 1.000000}}, // 366
	{0,"Шляпа \"Лава\"",18944,"Головной убор",0.1,{-30.000000, -90.000000, 0.000000, 1.000000}}, // 367
	{0,"Шляпа \"Серый узор\"",18945,"Головной убор",0.1,{-30.000000, -90.000000, 0.000000, 1.000000}}, // 368
	{0,"Шляпа \"Линия\"",18946,"Головной убор",0.1,{-30.000000, -90.000000, 0.000000, 1.000000}}, // 369
	{0,"Чёрная шляпа",18947,"Головной убор",0.1,{-30.000000, -90.000000, 0.000000, 1.000000}}, // 370
	{0,"Синяя шляпа",18948,"Головной убор",0.1,{-30.000000, -90.000000, 0.000000, 1.000000}}, // 371
	{0,"Зелёная шляпа",18949,"Головной убор",0.1,{-30.000000, -90.000000, 0.000000, 1.000000}}, // 372
	{0,"Красная шляпа",18950,"Головной убор",0.1,{-30.000000, -90.000000, 0.000000, 1.000000}}, // 373
	{0,"Жёлтая шляпа",18951,"Головной убор",0.1,{-30.000000, -90.000000, 0.000000, 1.000000}}, // 374
	{23,"Ключ от машины",3435,"Ключ от вашего личного транспорта\nэтим ключом вы можете открыть свой личный транспорт!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 375
	{24,"Ключ от дома",3435,"Ключ от Вашего личного дома\nэтим ключом вы можете открыть дверь своего дома!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 376
	{25,"Ключ от закусочной",3435,"Ключ от Вашей закусочной\nэтим ключом вы можете открыть дверь своей закусочной!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 377
	{27,"Подарок 'Аксессуары'",19057,"Из этого подарка Вам может выпасть:\n\nКепки\nБанданы\nОчки\nШляпы\nНаушники\nGMoney",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 378
	{28,"Подарок 'Оружейный'",19055,"Из этого подарка Вам может выпасть:\n\nБронежилет\nОружие\nGMoney",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 379
	{29,"Подарок 'Большой'",19054,"Из этого подарка Вам может выпасть:\n\nБронежилет\nОружие\nДеньги ( Сумма рандомная )\nКупон '100 репутации'\nКупон 'Лицензии'\nКупон 'Повышение веса'\nGMoney",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 380
	{26,"",2684,"",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 381 - вырезано, старый купон
	{30,"Купон 'Таксопарк'",2684,"Позволяет получать зарплату на 50 процентов больше на работе водителя такси!\n\n24 часа с момента активации.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 382
	{31,"Купон 'Автостанция'",2684,"Позволяет получать зарплату на 50 процентов больше на работе водителя автобуса!\n\n24 часа с момента активации.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 383
	{32,"Купон 'Транспортная компания'",2684,"Позволяет получать зарплату на 50 процентов больше на работе водителя!\n\n24 часа с момента активации.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 384
	{33,"",2684,"",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 385
	{34,"Купон 'Лесопилка'",2684,"Позволяет получать зарплату на 50 процентов больше на лесопилке!\n\n24 часа с момента активации.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 386
	{35,"Патроны 9мм",2037,"Патроны которые используются для такого оружия как:\n\nКольт 1911\nКольт 1911 ( с глушителем )",1.5,{-30.000000, 0.000000, 0.000000, 1.500000}}, // 387
	{36,"Патроны .50 Action",2037,"Патроны которые используются для такого оружия как:\n\nПустынный орел",1.5,{-30.000000, 0.000000, 0.000000, 1.500000}}, // 388
	{37,"Патроны 12мм",2043,"Патроны которые используются для такого оружия как:\n\nДробовик",1.5,{-30.000000, 0.000000, 0.000000, 1.500000}}, // 389
	{38,"Патроны 9.19мм",2040,"Патроны которые используются для такого оружия как:\n\nUZI\nMP5\nTEC-9",1.8,{-30.000000, 0.000000, 0.000000, 1.500000}}, // 390
	{39,"Патроны 7.62мм",2040,"Патроны которые используются для такого оружия как:\n\nAK-47\nВинтовка",1.8,{-30.000000, 0.000000, 0.000000, 1.500000}}, // 391
	{40,"Патроны 5.56мм",2040,"Патроны которые используются для такого оружия как:\n\nM4A1",1.8,{-30.000000, 0.000000, 0.000000, 1.500000}}, // 392
	{0,"Серый телефон",18874,"Мобильное устройство для связи и не только",0.1,{90.000000, 180.000000, 0.000000, 1.000000}}, // 393
	{0,"Зелёный телефон",18871,"Мобильное устройство для связи и не только",0.1,{90.000000, 180.000000, 0.000000, 1.000000}}, // 394
	{0,"Синий телефон",18872,"Мобильное устройство для связи и не только",0.1,{90.000000, 180.000000, 0.000000, 1.000000}}, // 395
	{0,"Фиолетовый телефон",18869,"Мобильное устройство для связи и не только",0.1,{90.000000, 180.000000, 0.000000, 1.000000}}, // 396
	{0,"Красный телефон",18870,"Мобильное устройство для связи и не только",0.1,{90.000000, 180.000000, 0.000000, 1.000000}}, // 397
	{0,"Голубой телефон",18866,"Мобильное устройство для связи и не только",0.1,{90.000000, 180.000000, 0.000000, 1.000000}}, // 398
	{0,"Золотой телефон",18865,"Мобильное устройство для связи и не только",0.1,{90.000000, 180.000000, 0.000000, 1.000000}}, // 399
	{0,"Чёрный телефон",18868,"Мобильное устройство для связи и не только",0.1,{90.000000, 180.000000, 0.000000, 1.000000}}, // 400
	{0,"Оранжевый телефон",18867,"Мобильное устройство для связи и не только",0.1,{90.000000, 180.000000, 0.000000, 1.000000}}, // 401
	{41,"Содовая",1546,"Сладкий бесцветный газированный напиток",0.3,{0.000000, 0.000000, 0.000000, 1.500000}}, // 402
 	{42,"Бургер",2703,"Котлета из фарша, которую подают на круглой булке",0.1,{-90.000000, 90.000000, -30.000000, 1.000000}}, // 403
 	{43,"Хот Дог",2769,"Сэндвич с сосиской или колбаской",0.1,{-90.000000, 0.000000, 0.000000, 1.000000}}, // 404
 	{44,"Кусок Пиццы",2702,"Круглая лепёшка из теста покрытая ингредиентами",0.1,{0.000000, 0.000000, 90.000000, 1.000000}}, // 405
 	{45,"Пончик с кофе",2223,"Ароматный кофе с пончиком",0.3,{-30.000000, 0.000000, 90.000000, 1.000000}}, // 406
 	{46,"Малый обед",2219,"Комплексный обед из салата,картофеля,куска пиццы и содовой",0.5,{-30.000000, 0.000000, 90.000000, 1.000000}}, // 407
 	{47,"Средний обед",2355,"Комплексный обед из салата с куринным филе, соусом и содовой",0.7,{-30.000000, 0.000000, 90.000000, 1.000000}}, // 408
 	{48,"Большой обед",2353,"Комплексный обед из большой порции салата,хот дога, соуса и содовой",1.0,{-30.000000, 0.000000, 90.000000, 1.000000}}, // 409
 	{49,"Ключ от бара",3435,"Ключ от Вашего бара\nэтим ключом вы можете открыть дверь своего бара!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 410
 	{50,"Ключ от ресторана",3435,"Ключ от Вашего ресторана\nэтим ключом вы можете открыть дверь своего ресторана!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 411
 	{51,"Ключ от магазина одежды",3435,"Ключ от Вашего магазина одежды\nэтим ключом вы можете открыть дверь своего магазина одежды!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 412
 	{52,"Ключ от магазина электроники",3435,"Ключ от Вашего магазина электроники\nэтим ключом вы можете открыть дверь своего магазина электроники!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 413
 	{53,"Пиво",1951,"Хмельной напиток малой крепости",0.5,{0.000000, 0.000000, 0.000000, 1.500000}}, // 414
 	{54,"Виски",1669,"Крепкий ароматный алкогольный напиток, получаемый из различных видов зерна",0.3,{0.000000, 0.000000, 0.000000, 1.500000}}, // 415
 	{55,"Виски (1679)",1668,"Крепкий ароматный алкогольный напиток, получаемый из различных видов зерна",0.4,{0.000000, 0.000000, 0.000000, 1.500000}}, // 416
 	{56,"Пиво \"Lime\"",1544,"Хмельной напиток малой крепости с добавлением сока лайма",0.5,{0.000000, 0.000000, 0.000000, 1.500000}}, // 417
 	{57,"Пиво \'Светлое\"",1543,"Хмельной напиток малой крепости светлого оттенка",0.6,{0.000000, 0.000000, 0.000000, 1.500000}}, // 418
 	{58,"Коньяк",1520,"Крепкий алкогольный напиток, производимый из определённых сортов винограда по особой технологии",0.3,{0.000000, 0.000000, 0.000000, 1.500000}}, // 419
 	{59,"Водка \"Чёрная\"",1664,"Спиртной напиток, бесцветный водно-спиртовой раствор без выраженного вкуса и запаха.",0.6,{0.000000, 0.000000, 0.000000, 1.500000}}, // 420
 	{60,"Ключ от Автосалона",3435,"Ключ от Вашего автосалона\nэтим ключом вы можете открыть дверь в своём автосалоне!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 421
 	{61,"Ключ от Магазина оружия",3435,"Ключ от Вашего магазина оружия\nэтим ключом вы можете открыть дверь в своём магазине оружия!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 422
 	{62,"Ключ от Магазина мебели",3435,"Ключ от Вашего магазина мебели\nэтим ключом вы можете открыть дверь в своём магазине мебели!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 423
 	{63,"Ключ от Клуба",3435,"Ключ от Вашего клуба\nэтим ключом вы можете открыть дверь в своём клубе!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 424
 	{64,"Ключ от Заправки",3435,"Ключ от Вашей заправки\nэтим ключом вы можете открыть дверь в своей заправке!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 425
 	{65,"Пол. дубинка ( Сл. )",334,"Несмертельное оружие,спецсредство,используемое правоохранительными,\nохранными органами и силовыми структурами.",1.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 426
	{66,"MP5 ( Сл. )",353,"Cемейство пистолетов-пулемётов, разработанных немецким производителем \nстрелкового оружия, фирмой Heckler & Koch", 4.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 427
	{67,"М4А1 ( Сл. )",356,"Автомат, созданный в США на основе М16А2 изначально для вооружения \nэкипажей боевых машин и расчетов техники.",5.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 428 //пд оружие!
	{68,"Пуст. орел ( Сл. )",348,"Самозарядный пистолет большого калибра (до 12,7 мм).\nПозиционируется как охотничье оружие и оружие для самозащиты от диких зверей и гражданских лиц.", 3.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 429
	{69,"Дробовик ( Сл. )",349,"Гладкоствольное огнестрельное оружие, использующее энергию фиксированного снаряда для \nстрельбы некоторым количеством небольших круглых шариков (дробью), либо пулями.", 5.0,{0.000000, -30.000000, 0.000000, 1.500000}},// 430
	{70,"Бронежилет ( Сл. )",1242,"Используется для защиты тела от пуль.",8.0,{0.000000, 0.000000, 0.000000, 1.000000}}, // 431
	{71,"Наручники",19418,"Устройство в виде двух колец с замками (браслетов), соединённых между собой цепью, \nиспользуемое органами охраны порядка или военными для ограничения свободы действий задержанного.",0.3,{0.000000, 0.000000, 0.000000, 0.100000}}, // 432
	{72,"Полицейский щит",18637,"Устройство, используемое для защиты сотрудников охраны порядка при массовых беспорядках",4.0,{90.000000, 0.000000, 0.000000, 1.000000}}, // 433
	{73,"Аптечка ( Сл. )",11736,"Сумка, содержащая все необходимое, для оказания первой медицинской помощи",0.5,{90.000000, 0.000000, 20.000000, 1.000000}}, // 434
	{74,"Ящик с инструментами ( Сл. )",3052,"Ящик, содержащий все необходимые иснтрументы для ремонта автомобиля",3.0,{-30.000000, 0.000000, 0.000000, 1.000000}}, // 435
	{75,"Дорожные шипы",2899,"Устройство,используемое для ограничения проезда и ликвидации,задержки подозреваемых в транспорте.",5.0,{90.000000, 0.000000, 90.000000, 1.000000}}, // 436
	{76,"Запасное колесо",1025,"Запасное колесо,для замены в случае прокола основного.",5.0,{0.000000, 0.000000, 90.000000, 1.000000}}, // 437
	{77,"Ограждение тип 1",1237,"Плотно закрепляемое цилиндрическое ограждение.",5.0,{0.000000, 0.000000, 0.000000, 1.000000}}, // 438
	{78,"Ограждение тип 2",1423,"Небольшое ограждение с маячками.",5.0,{0.000000, 0.000000, 0.000000, 1.000000}}, // 439
	{79,"Ограждение тип 3",1425,"Небольшое ограждение с надписью \"Объезд\".",5.0,{0.000000, 0.000000, 180.000000, 1.000000}}, // 440
	{80,"Ограждение тип 4",1459,"Деревянное ограждение сигнальной окраски на стойках.",5.0,{0.000000, 0.000000, 0.000000, 1.000000}}, // 441
	{81,"Канистра с топливом",1650,"Канистра с топливом на 20 литров.",2.0,{0.000000, 0.000000, 0.000000, 1.000000}}, // 442
	{82,"Пицца",2814,"Пицца в фирменой коробке",0.5,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 443
	{83,"Десерт",2221,"Сладкий десерт с кофе",0.2,{-20.000000, 0.000000, 90.000000, 1.000000}}, // 444
	{84,"Бизнес-Ланч",2213,"Бизнес ланч, включающий в себя все необходим для хорошего обеда занятого человека",0.2,{-20.000000, 0.000000, 160.000000, 1.000000}}, // 445
	{85,"Бокал вина",1667,"Бокал красного вина с окантовкой из черного хрусталя",0.1,{0.000000, 0.000000, 90.000000, 1.000000}}, // 446
	{86,"Бутылка вина",1669,"Бутылка красного вина хорошей выдержки",0.3,{0.000000, 0.000000, 90.000000, 1.000000}}, // 447
	{87,"Бутылка полусухого",1668,"Бутылка полусухого белого вина",0.3,{0.000000, 0.000000, 90.000000, 1.000000}}, // 448
	{88,"Бутылка виски",1520,"Бутылка виски с хорошей выдержкой",0.3,{0.000000, 0.000000, 90.000000, 1.000000}}, // 449
	{89,"Ящик с инструментами",3052,"Ящик, содержащий все необходимые иснтрументы для ремонта автомобиля",3.0,{-30.000000, 0.000000, 0.000000, 1.000000}}, // 450
	{90,"Медицинская сумка",11738,"Сумка с медикаментами, необходимыми для оказания первой помощи",3.0,{0.000000, 0.000000, 0.000000, 1.000000}}, // 451 
	{91,"Документы",1581,"Документ удостоверяющий личность.",0.1,{0.000000, 0.000000, 180.000000, 1.000000}}, // 452
	{92,"Купон 'Очки работы'",2684,"Данный купон дает по 50 очков работы.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 453
	{93,"",2684,"",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 454 купон репутации - вырезан
	{94,"Купон 'Лицензии'",2684,"Купон позволяет Вам, получить все лицензии доступные на сервере.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 455
	{95,"Купон 'Повышение веса'",2684,"Данный купон позволяет вам увеличить кол-во переносимого веса на 10кг.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 456
	{96,"Автомобильная аптечка",11736,"Аптечка для оказания первой помощи.",3.0,{90.000000, 0.000000, 20.000000, 1.000000}}, // 457 
	{97,"Снайперская винтовка ( Сл. )",358,"Боевая винтовка, конструкция которой обеспечивает\n повышеную точность стрельбы", 5.0, {0.000000, -30.000000, 0.000000, 1.500000}}, // 458
	{98,"Купон 'Смена возраста'",2684,"Позволяет изменить возвраст Вашего персонажа.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 459
	{99,"Купон 'Смена роли'",2684,"Позволяет выбрать роль Вашего персонажа заново.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 460
	{100,"Купон 'Снятия предупреждений'",2684,"Позволяет Вам снять Все тукущие варны.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 461
	{101,"Сухой паёк",2663,"Еда для быстрого применения, используйется для Национальной гвардии",1.0,{0.000000, 0.000000, 0.000000, 1.000000}}, // 462
	{102,"Купон 'Смены имени'",2684,"Позволяет Вам сменить свое игровое имя на новое.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 463
	{103,"Отмычка",19348,"Специализированный инструмент, использующийся для открытия замков без использования ключа или разрушения замка",0.5,{0.000000, 150.000000, 0.000000, 1.000000}}, // 464
	{104,"Косяк",1485,"Психоактивное средство, получаемое из конопли.",0.3,{10.000000, 20.000000, 30.000000, 1.299999}}, // 465
	{105,"Кокс",1265,"Метиловый сложный эфир бензоилэкгонина, алкалоид тропанового ряда, обладает местноанестезирующим и психостимулирующим действием.",0.5,{10.000000, 20.000000, 30.000000, 1.299999}}, // 466
	{106,"Марка",1865,"Полусинтетическое психоактивное вещество из семейства лизергамидов.",0.3,{10.000000, 20.000000, 30.000000, 1.299999}}, // 467
	{107,"Спайс",7230,"Обладает психоактивным действием, аналогичным действию марихуаны.",0.5,{10.000000, 20.000000, 30.000000, 1.299999}}, // 468
    {108,"Boombox",2226,"Бумбокс - Тип переносного аудиоцентра.\n"gbInfo"/music - воспроизведение музыки",0.5,{0.000000, 0.000000, 200.000000, 1.000000}}, // 469
	{109,"Коробок спичек",2346,"Спички - используются для разжигания костра/бочек",0.5,{-200.000000, 0.000000, 50.000000, 1.000000}}, // 470
	{110,"Мангал",1481," ",4.0,{0.000000, 0.000000, 180.000000, 1.000000}}, // 471
	{111,"Дрова",1463," ",1.0,{0.000000, 0.000000, 150.000000, 1.000000}}, // 472
	{112,"Клюшка для гольфа",333," ", 0.5,{0.000000, -30.000000, 0.000000, 1.500000}}, // 473
	{113,"Удочка",18632," ", 0.3,{0.000000, 0.000000, 180.000000, 1.000000}}, // 474
	{114,"Пляжный мяч",1598," ", 1.0,{0.000000, 0.000000, 0.000000, 1.000000}}, // 475
	{115,"Кий",338," ", 0.2,{0.000000, -30.000000, 0.000000, 1.500000}}, // 476
	{116,"Наживка",2751," ", 0.7,{0.000000, 0.000000, 100.000000, 1.000000}}, // 477
	{117,"Деревянный лежак",1255," ", 3.5,{0.000000, 0.000000, 100.000000, 1.000000}}, // 478
	{118,"Лежак с полотенцем",1646," ", 4.5,{0.000000, 0.000000, 100.000000, 1.000000}}, // 479
	{119,"Букет цветов",325," ", 0.3,{0.000000, -30.000000, 0.000000, 1.500000}}, // 480
	{120,"Синия рыбка",1604," ", 0.2,{0.000000, 0.000000, -300.000000, 1.000000}}, // 481
	{121,"Цветная рыбка",1600," ", 0.2,{0.000000, 0.000000, -300.000000, 1.000000}}, // 482
	{122,"Желтая рыбка",1599," ", 0.2,{0.000000, 0.000000, -300.000000, 1.000000}}, // 483
	{123,"Ключ от Все для отдыха",3435,"Ключ от магазина Все для отдыха\nэтим ключом вы можете открыть дверь своего магазина!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 484

	{124,"Army Box", 2358, " ", 0.2,{-50.000000, 0.000000, 180.000000, 1.000000}}, // 485
	{125,"Купон 'Обнуления'",2684,"Данный купон позволяет Вам увеличить количество очков до максиума",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 486

	{126,"Ключ от Аренды Автомобилей",3435,"Ключ от Аренды Автомобилей\nэтим ключом вы можете открыть дверь своего бизнеса!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 487
	{127,"Ключ от Спортзала",3435,"Ключ от Спортзала\nэтим ключом вы можете открыть дверь своего бизнеса!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 488
	
	{128,"Абонемент 'Бокс'",2684,"Абонемент сроком на 1 день, даёт возможность заниматься в спортзале Гетто.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 489
	{129,"Абонемент 'Кунг-Фу'",2684,"Абонемент сроком на 1 день, даёт возможность заниматься в спортзале Лос-Сантоса.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 490
    {130,"Абонемент 'Бокс'",2684,"Абонемент сроком на 7 деней, даёт возможность заниматься в спортзале Гетто.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 491
	{131,"Абонемент 'Кунг-фу'",2684,"Абонемент сроком на 7 деней, даёт возможность заниматься в спортзале Лос-Сантоса.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 492
	{132,"Абонемент 'Кик-бокс'",2684,"Абонемент сроком на 1 день, даёт возможность заниматься в спортзале Округ-Рэд.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 493
	{133,"Абонемент 'Кик-бокс'",2684,"Абонемент сроком на 7 деней, даёт возможность заниматься в спортзале Округ-Рэд.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 494
    {134,"Рация",19942,"Рация — переносное приёмопередающее устройство.",0.2,{0.000000, 0.000000, 0.000000, 1.500000}}, //495
	//нелегальное оружие
	{135,"Кольт 1911",346,"Самозарядный пистолет под патрон .45 ACP.\n\n"gbInfo"Используемые патроны: 9mm", 2.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 496
	{136,"Кольт 1911 с глушителем",347,"Самозарядный пистолет под патрон .45 ACP.с глушителем\n\n"gbInfo"Используемые патроны: 9mm\n\n"gbInfo"Не имеет серийного номера",2.1,{0.000000, -30.000000, 0.000000, 1.500000}}, // 497
	{137,"Пуст. орел",348,"Самозарядный пистолет большого калибра (до 12,7 мм).\nПозиционируется как охотничье оружие и оружие для самозащиты от диких зверей и гражданских лиц.\n\n"gbInfo"Используемые патроны: .50 Action\n\n"gbInfo"Не имеет серийного номера", 3.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 498
	{138,"Дробовик",349,"Гладкоствольное огнестрельное оружие, использующее энергию фиксированного снаряда \nдля стрельбы некоторым количеством небольших круглых шариков (дробью), либо пулями.\n\n"gbInfo"Используемые патроны: 12mm\n\n"gbInfo"Не имеет серийного номера", 5.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 499
	{139,"UZI",352,"Cемейство пистолет-пулемётов, выпускаемых израильским концерном Israel Military Industries\n\n"gbInfo"Используемые патроны: 9.19mm\n\n"gbInfo"Не имеет серийного номера",3.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 500
	{140,"MP5",353,"Cемейство пистолетов-пулемётов, разработанных немецким \nпроизводителем стрелкового оружия, фирмой Heckler & Koch\n\n"gbInfo"Используемые патроны: 9.19mm\n\n"gbInfo"Не имеет серийного номера", 4.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 501
	{141,"АК-47",355,"Автомат, принятый на вооружение в СССР в 1949 году\n\n"gbInfo"Используемые патроны: 7.62mm\n\n"gbInfo"Не имеет серийного номера",5.4,{0.000000, -30.000000, 0.000000, 1.500000}}, // 502
	{142,"М4А1",356,"Автомат, созданный в США на основе М16А2 изначально для \nвооружения экипажей боевых машин и расчетов техники.\n\n"gbInfo"Используемые патроны: 5.56mm\n\n"gbInfo"Не имеет серийного номера",5.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 503
	{143,"TEC-9",372,"Самозарядный 9-мм пистолет, разработанный в Швеции в 1980-х годах.\nПопулярен в преступном мире из за возможности переделки для ведения автоматического огня\n\n"gbInfo"Используемые патроны: 9.19mm\n\n"gbInfo"Не имеет серийного номера",3.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 504
	{144,"Винтовка",357,"Нарезное стрелковое оружие, конструктивно предназначенное для удержания и \nуправления при стрельбе двумя руками с упором приклада в плечо\n\n"gbInfo"Используемые патроны: 7.62mm\n\n"gbInfo"Не имеет серийного номера", 5.0,{0.000000, -30.000000, 0.000000, 1.500000}}, //505
	{145,"Гильза оружейная",2061,"Гильза оружейная — тонкостенная закрытая с одного конца трубка\n (стакан), предназначенная для помещения метательного заряда\n и средств воспламенения, служащая оболочкой унитарного оружейного патрона.\n\n"gbInfo"Не имеет серийного номера", 0.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 506
	{146,"Флаш США",11245,"Памятный предмет с Дня Независимости США!", 0.1,{0.000000, -30.000000, 0.000000, 1.500000}}, //507
	{147,"Мороженое",19320,"Замороженная сладкая масса из молочных продуктов с различными добавками.", 0.1,{0.000000, -30.000000, 0.000000, 1.500000}}, //508
	{148,"Ключ от квартиры",3435,"Ключ от вашей квартиры\nэтим ключом вы можете открыть свою квартиру!",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 509
	{149,"Купон 'Смена номера'",2684,"Позволяет изменить Ваш текущий номер телефона.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 510
	{150,"Купон 'Смена номера машины'",2684,"Позволяет изменить Ваш текущий номер автомобиля на\nлюбой удобный.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 511
	{151,"Купон 'Изучение стилей боя'",2684,"Позволяет Вам изучить выбранный стиль боя\nна максимум.",0.0,{0.000000, 0.000000, 0.000000, 1.500000}}, // 512
	{152,"Игральные кости", 1852, "Простые игральные кости",0.0,{0.000000, 0.000000, 30.000000, 1.500000}}, // 513
	// Halloween Vovanm93
	{153,"Праздничная конфета", 19602, "Конфета подготовленная жителями деревни Паломино Крик",0.0,{0.000000, 30.000000, 30.000000, 1.500000}}, // 514
	//
	{154,"Пачка сигарет Wind", 19896, "Пачка дорогих сигарет. \nПриятный на вкус табак и качественная бумага.", 0.0, {75.000000, 140.000000, 0.000000, 0.500000 }}, //515
	{155,"Пачка сигарет C&K", 19897, "Пачка недорогих сигарет.\nТабак и бумага среднего качества.", 0.0, {75.000000, 140.000000, 0.000000, 0.500000 }}, //516
	// Halloween
    {156,"Halloween Электрогитара", 19319, "Старая электрогитара", 0.0, {0.000000, 0.000000, 0.000000, 1.0 }}, //517
    {157,"Halloween Шляпа ведьмы", 19528, "Шляпа ведьмы", 0.0, {0.000000, 0.000000, 0.000000, 1.0 }}, //518
    {158,"Halloween Чемодан торговца", 19624, "Декоративный чемодан торговца который не открывается", 0.0, {0.000000, 0.000000, 0.000000, 1.0 }}, //519

	// Premium
	{159,"Купон на премиум аккаунт «Light»", 2684, "Премиум аккаунт уровня «Light»", 0.0, {0.000000, 0.000000, 0.000000, 1.0 }}, //520
	{160,"Купон на премиум аккаунт «Medium»", 2684, "Премиум аккаунт уровня «Medium»", 0.0, {0.000000, 0.000000, 0.000000, 1.0 }}, //521
	{161,"Купон на премиум аккаунт «Hard»", 2684, "Премиум аккаунт уровня «Hard»", 0.0, {0.000000, 0.000000, 0.000000, 1.0 }}, //522
	
	// Fire Department
	{162,"Спасательная бензопила", 341, "Спасательная пила специально разработана для применения пожарными,\nна основе опыта пожарных бригад в США и Европе.", 7.1, {0.000000, -30.000000, 0.000000, 1.500000} }, // 523
	{163,"Огнетушитель",366,"Переносное или передвижное устройство для тушения очагов пожара\nза счет выпуска запасенного огнетушащего вещества.",6.0,{0.000000, -30.000000, 0.000000, 1.500000}}, // 524

	// Premium
	{164,"Купон на премиум аккаунт «Platinum»", 2684, "Премиум аккаунт уровня «Platinum»", 0.0, {0.000000, 0.000000, 0.000000, 1.0 }}, //525
	{165,"Подарок 'Рабочий'",19058,"Из этого подарка Вам может выпасть:\n\nКупон 'Лесопилка'\nКупон 'Транспортная компания'\nКупон 'Автостанция'\nКупон 'Таксопарк'\nКупон 'Очки работы'\nGMoney",0.0,{0.000000, 0.000000, 90.000000, 1.500000}}, // 526

	{166,"Снайперская винтовка",358,"Боевая винтовка, конструкция которой обеспечивает\n повышеную точность стрельбы", 5.0, {0.000000, -30.000000, 0.000000, 1.500000}} // 527
};


#include "../include/coordinates.inc"

enum bInfo {
	bID,
	bOwner[MAX_PLAYER_NAME],
	bName[25],
	Float:bEnter[7],
	bUpdate[3],
	bSettings[8],
	bBizzRent,
    SellDate,
    bOwnerID,
	//--------------------------------
	Text3D:bText,
	bItems[16],
	bProdItems[16],
	bool:bCamera,
	//-------[Одежда]-----------------
	Text3D:bTextBuy[5],
	bObjects[351],
	//-------[Клубы]------------------
	bAObject[54],
	Text3D:bAText,
	bMusicName[64],
	bMusicZone,
	bMusicON,
	bool:bProds,
	bActor,
    bSellHour,
    bRating
};
new Bizz::[MAX_BUSINESS][bInfo];

enum prodInfo {
	bID,
	bCount,
	bPrice,
	bool:bStatus,
	bool:pStatus,
}
new Product::[MAX_PRODUCT_INFO][prodInfo];

enum fuelInfo {
	bID,
	bCount,
	bPrice,
	bool:bStatus,
}
new Fuel::[MAX_FUEL_INFO][fuelInfo];

enum cInfo {
	cID,
	cOwner[MAX_PLAYER_NAME],
	cModel,
	Float:cPos[4],
	cSettings[8],
	cTunning[18],
	Float:cFloating[3],
	cDamage[4],
	cLastTeh[25],
	cStatus[2],

	cInvSlot[18],
	cInvSlotKol[18],

	cCar,
	Text3D:cNumberLabel,
	cNumber[12],
	cWanted,
	
	// Found
	bool: c_delete,
	c_delete_timer,
}
new Car::[MAX_CARS_BUY][cInfo];

enum fInfo {
	fID,
	fName[32],
	fLeader[MAX_PLAYER_NAME],
	fSkins[15],
	fGuns[6],
	fRank[7]
}
new F::[MAX_FRAC][fInfo];
new FRank[MAX_FRAC][15][32];

enum borderInfo {
	bObjects,
	Float:bP[3],
	bool:bStatus,
	bObject,
	bMember,
}
new Border::[MAX_PLAYERS][borderInfo];

enum advertInfo {
	adText[128],
	adName[MAX_PLAYER_NAME],
	adPhone,

	bool:adUsed,
}
new AD::[MAX_ADVERT_INFO][advertInfo];
new bool:newsCalling = false,bool:EtherStatus = false,newsLeaderEther = INVALID_PLAYER_ID,newsClientEther = INVALID_PLAYER_ID,bool:newsEtherSMS = false;

main() {}

#include "gambit\header.inc"
//#include "gambit\test.inc"
#include "gambit\functions.pwn"
#include "gambit\script\anticheat.pwn"

public Streamer_OnPluginError( error[] ) {
	printf( "[STREAMER] %s", error );
	return true;
}

public OnGameModeInit() {
	clear_massive();
	Streamer_ToggleErrorCallback( true );
    #include "../include/vehicles.inc"

    //надписи для дверей без пикапов
    CreateDynamic3DTextLabel("ALT",C_BLUE, 1554.1320,-1661.2086,2494.2458,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
    CreateDynamic3DTextLabel("ALT",C_BLUE, 1541.5314,-1366.0793,2494.2458,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
    CreateDynamic3DTextLabel("ALT",C_BLUE, 1531.0587,-1348.8101,2494.2458,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
    CreateDynamic3DTextLabel("ALT",C_BLUE, 1318.7401,-1499.5507,2494.2458,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
    CreateDynamic3DTextLabel("ALT",C_BLUE, 1538.1112,-1656.2904,2494.2458,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
    CreateDynamic3DTextLabel("ALT",C_BLUE, 1315.7203,-1523.1245,2494.2458,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
    CreateDynamic3DTextLabel("ALT",C_BLUE, 1526.7980,-1660.6204,2494.2458,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
    CreateDynamic3DTextLabel("ALT",C_BLUE, 1299.9723,-1528.5564,2494.2458,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
    //
    CreateDynamic3DTextLabel("ALT",C_BLUE, -130.9097,-1867.8627,2504.7559,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
    CreateDynamic3DTextLabel("ALT",C_BLUE, -132.5123,-1861.1058,3001.0859,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
    //двери Шерифы
    CreateDynamic3DTextLabel("ALT",C_BLUE, 639.2568,-587.2856,1997.7660,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
    CreateDynamic3DTextLabel("ALT",C_BLUE, 643.9077,-580.9860,2594.0859,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
    CreateDynamic3DTextLabel("ALT",C_BLUE, 316.2371,-170.1205,999.5938,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
    //CreateDynamicPickup(1239,23,654.3426,-1767.3691,-1);
	for(new i;i<20;i++)
	{
		if(i<10) gTruckLoadTurn[0][i] = INVALID_PLAYER_ID;
	}
	gTruckLoadTurnText[0] = CreateDynamic3DTextLabel("_",-1,1018.9197,-321.5060,73.9922,30.0);
	
	new createactor;
	CreateDynamic3DTextLabel("[ Тренер ]\n\n"cBLUE"ALT",0xFFFFFFFF,767.9103,-29.7298,1000.5859+1.5, 10.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, -1);
	createactor	= CreateActor(204,767.9103,-29.7298,1000.5859,182.4651); // ??????? #6
	ApplyActorAnimation(createactor, "DEALER","null",0.0,0,0,0,0,0);
	ApplyActorAnimation(createactor, "DEALER","Dealer_idle",4.1, 1, 0, 0, 0, 0);
	SetActorVirtualWorld(createactor, 88);
	
	CreateDynamic3DTextLabel("[ Тренер ]\n\n"cBLUE"ALT",0xFFFFFFFF,764.6592,9.3981,1000.7114+1.5, 10.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, -1);
	createactor	= CreateActor(80,764.6592,9.3981,1000.7114,267.0659); // ??????? #6
	ApplyActorAnimation(createactor, "DEALER","null",0.0,0,0,0,0,0);
	ApplyActorAnimation(createactor, "DEALER","Dealer_idle",4.1, 1, 0, 0, 0, 0);
	SetActorVirtualWorld(createactor, 87);
	
	CreateDynamic3DTextLabel("[ Тренер ]\n\n"cBLUE"ALT",0xFFFFFFFF,766.6108,-65.0944,1000.6563+1.5, 10.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, -1);
	createactor	= CreateActor(81,766.6108,-65.0944,1000.6563,352.9434); // ??????? #6
	ApplyActorAnimation(createactor, "DEALER","null",0.0,0,0,0,0,0);
	ApplyActorAnimation(createactor, "DEALER","Dealer_idle",4.1, 1, 0, 0, 0, 0);
	SetActorVirtualWorld(createactor, 89);

	for(new x; x < sizeof(GymData); x ++) {
		GymData[x][gymAreaID] = CreateDynamicSphere(GymData[x][gymPosX], GymData[x][gymPosY], GymData[x][gymPosZ], 1.0);
		GymData[x][gymStatus] = INVALID_PLAYER_ID;
		CreateDynamic3DTextLabel("[ Тренажер ]\n\n"cBLUE"ALT",0xFFFFFFFF,GymData[x][gymPosX], GymData[x][gymPosY], GymData[x][gymPosZ], 5.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, -1);
	}

    //showPlayerDialog(playerid,d_priton,2,"Управление наркопритоном","1. "cGRAY"Информация о притоне{ffffff}\n2. "cGRAY"Сейф{ffffff}\n3. "cGRAY"Настройки притона{ffffff}","Далее","Закрыть");

    CreateDynamic3DTextLabel("[ Выдача оружия ]\n\n"cBLUE"ALT",0xFFFFFFFF,2350.5449,-2733.9705,698.1811, 10.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, -1);
    
    CreateDynamic3DTextLabel("[ Продажа рыбы ]\n\n"cBLUE"ALT",0xFFFFFFFF,1585.5896,-1512.2379,13.5669, 10.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, -1);
    CreateDynamic3DTextLabel("[ Продажа рыбы ]\n\n"cBLUE"ALT",0xFFFFFFFF,1589.7001,-1509.3075,13.5750, 10.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, -1);
   	CreateDynamic3DTextLabel("[ Доступ к камере ]\n\n"cBLUE"ALT",0xFFFFFFFF,2740.7913,-2297.7004,908.7573, 10.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, -1);
    CreateDynamicPickup(2663,23,2739.0186,-2444.8369,811.4900,-1);
    CreateDynamic3DTextLabel("[ Сухой паек ]\n\n"cBLUE"ALT",0xFFFFFFFF,2739.0186,-2444.8369,811.4900, 10.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, -1);
    CreateDynamic3DTextLabel("[ Сдача боеприпасов ]\n\n"cBLUE"ALT",0xFFFFFFFF,2789.8435,-2418.5100,13.6332, 10.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, -1);
    CreateDynamic3DTextLabel("[ Сдача боеприпасов ]\n\n"cBLUE"ALT",0xFFFFFFFF,2790.4063,-2420.5288,13.6330, 10.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, -1);
	//1442
	
	CreateDynamic3DTextLabel("[ СТО ]\n\n"cBLUE"H",0xFFFFFFFF,2507.3267,-1518.7054,23.9319,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ СТО ]\n\n"cBLUE"H",0xFFFFFFFF,603.5276,-1506.5304,14.9765,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ СТО ]\n\n"cBLUE"H",0xFFFFFFFF,1367.7867,196.2260,19.5189,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	CreateObject(18759, 3959.89966, -942.35260, 2.84273,   0.00000, 0.00000, 0.00000);

	DisableInteriorEnterExits();
 	EnableStuntBonusForAll(0);
 	ShowPlayerMarkers(1);
 	SetNameTagDrawDistance(20.0);
    ManualVehicleEngineAndLights();
    gettime( ghour, gminute, gsecond );
    SetWorldTime( ghour + 3 );


    SetGameModeText( GAMBIT_VERSION );
    SetTimer("OnSecondTimer",1000,true);
    SetTimer("OnMinuteTimer",60000,true);

	CreateDynamicPickup(1210,23,1126.71, -1226.29, 3905.34,-1); // Такси работа пикап
    CreateDynamicPickup(1210,23,1794.1667,-1763.4535,2513.5859,-1); // Автобусники блять
    CreateDynamicPickup(1210,23,2127.6643,-2275.2849,20.6719,-1); // дальнобойщики
    CreateDynamicPickup(1239,23,1037.1237,-305.9707,76.6459,-1); // Выбор прицепа
    CreateDynamicPickup(1210,23,-526.3150,-70.5220,2773.8861,-1); // Устройство лесопилка
    CreateDynamicPickup(1275,23,-529.7124,-76.6541,2773.8778,-1); // Одежда лесопилка
  //  CreateDynamicPickup(1275,23,1082.6572,-1415.2507,2998.6310,-1); // Одежда медики / пожарные
    CreateDynamicPickup(1239,23,1072.4669,-342.6463,1797.7004,-1); // Центр купли - продажи
    CreateDynamicPickup(1239,23,1065.0851,-339.9360,1797.7010,-1); // Центр купли - пикап2
    
    //warehouse
    CreateDynamicPickup(1239,23,2596.7729,-833.8965,879.5870,-1); // Центр купли - продажи'
    CreateDynamicPickup(1239,23,2776.6360,-716.4243,883.0959,-1); // Центр купли - продажи
    CreateDynamicPickup(1239,23,-2842.7400,-55.5776,999.0289,-1); // Центр купли - продажи
    CreateDynamicPickup(1239,23,-2737.1760,841.4919,996.6509,-1); // Центр купли - продажи
    CreateDynamicPickup(1239,23,2623.4070,-183.9477,879.5859,-1); // Центр купли - продажи
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,2596.7729,-833.8965,879.5870,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,2776.6360,-716.4243,883.0959,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,-2842.7400,-55.5776,999.0289,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,-2737.1760,841.4919,996.6509,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,2623.4070,-183.9477,879.5859,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);

    CreateDynamic3DTextLabel("[ Центр купли-продажи ]\n\n"cBLUE"ALT",0xFFFFFFFF,1072.4669,-342.6463,1797.7004,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Копии ключей ]\n\n"cBLUE"ALT",0xFFFFFFFF,1065.0851,-339.9360,1797.7010,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Банк ]\n\n"cBLUE"ALT",0xFFFFFFFF,1463.8583,-1006.0172,2725.8800,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Банк ]\n\n"cBLUE"ALT",0xFFFFFFFF,1459.5745,-1006.0161,2725.8800,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Банк ]\n\n"cBLUE"ALT",0xFFFFFFFF,1455.4482,-1006.0210,2725.8800,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Банк ]\n\n"cBLUE"ALT",0xFFFFFFFF,1451.4005,-1006.0151,2725.8800,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Таксопарк ]\n\n"cBLUE"ALT",0xFFFFFFFF,1126.71, -1226.29, 3905.34,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Одежда ]\n\n"cBLUE"ALT",0xFFFFFFFF,-1048.1682,-1205.3153,895.4160,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Автостанция ]\n\n"cBLUE"ALT",0xFFFFFFFF,1794.1667,-1763.4535,2513.5859,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Транспортная компания ]\n\n"cBLUE"ALT",0xFFFFFFFF,2127.6643,-2275.2849,20.6719,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Аренда прицепа ]\n\n"cBLUE"ALT",0xFFFFFFFF,1037.1237,-305.9707,76.6459,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Лесопилка ]\n\n"cBLUE"ALT",0xFFFFFFFF,-526.3150,-70.5220,2773.8861,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Одежда ]\n\n"cBLUE"ALT",0xFFFFFFFF,-529.7124,-76.6541,2773.8778,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    
    CreateDynamic3DTextLabel("[ Одежда ]\n\n"cBLUE"ALT",0xFFFFFFFF,754.4679,-40.2419,1000.5926,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Одежда ]\n\n"cBLUE"ALT",0xFFFFFFFF,756.2339,5.8996,1000.6987,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	CreateDynamic3DTextLabel("[ Одежда ]\n\n"cBLUE"ALT",0xFFFFFFFF,759.4854,-77.9573,1000.6523,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	CreateDynamicPickup(1275,23,754.4679,-40.2419,1000.5926,-1);
	CreateDynamicPickup(1275,23,756.2339,5.8996,1000.6987,-1);
	CreateDynamicPickup(1275,23,759.4854,-77.9573,1000.6523,-1);
	//--------------------------------------------------------------------------------------------------------------------------------------------------
    CreateDynamic3DTextLabel("[ Рекорды ]\n\n"cBLUE"ALT",0xFFFFFFFF,2344.1797,-2742.7698,698.1976,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);

    CreateDynamicPickup(1559,23,-467.1220,-94.9726,773.8900,-1);
    CreateDynamicPickup(1559,23,-468.3763,-72.0642,773.8900,-1);
    CreateDynamicPickup(1559,23,-468.4299,-92.4901,773.8900,-1);
	CreateDynamicPickup(1559,23,-470.7334,-97.0103,773.8900,-1);
	
    CreateDynamic3DTextLabel("\"Утилизация транспорта\"\n\n[ 50% от стоимости авто ]",0xFFFFFFAA,208.1662,-236.6810,3.0,25.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);

    // Фракции
    CreateDynamicPickup(1275,23,1527.8334,-1680.4747,2494.2458,1);
    CreateDynamicPickup(1275,23,404.3445,-1866.0304,2501.0859,1);
    CreateDynamic3DTextLabel("[ Одежда ]\n\n"cBLUE"ALT",0xFFFFFFFF,404.3445,-1866.0304,2501.0859,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamicPickup(1275,23,-134.1429,-1888.1531,2501.0859,1);
    CreateDynamic3DTextLabel("[ Одежда ]\n\n"cBLUE"ALT",0xFFFFFFFF,-134.1429,-1888.1531,2501.0859,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamicPickup(1275,23,908.4117,-1855.7367,2501.0859,1);
    CreateDynamic3DTextLabel("[ Одежда ]\n\n"cBLUE"ALT",0xFFFFFFFF,908.4117,-1855.7367,2501.0859,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    
    
    
    CreateDynamic3DTextLabel("[ Одежда ]\n\n"cBLUE"ALT",0xFFFFFFFF,1527.8334,-1680.4747,2494.2458,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    
    CreateDynamicPickup(1239,23,629.8479,196.1600,2001.0836,-1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,629.8479,196.1600,2001.0836,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamicPickup(1239,23,392.9364,-1882.3732,2501.0859,-1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,392.9364,-1882.3732,2501.0859,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamicPickup(1239,23,-134.7845,-1897.9773,2501.0859,-1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,-134.7845,-1897.9773,2501.0859,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamicPickup(1239,23,907.3466,-1845.6542,2501.0859,-1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,907.3466,-1845.6542,2501.0859,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	//
    CreateDynamicPickup(1239,23,312.5520,-166.1330,999.6010,-1); // 312.5520,-166.1330,999.6010
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,312.5520,-166.1330,999.6010,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);

	// Кофе и пончики
	CreateDynamicPickup(1239,23,624.3196,-562.0367,2594.0859,-1);// SADoC
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,624.3196,-562.0367,2594.0859,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamicPickup(1239,23,-141.9430,-1878.3663,3001.0859,-1);// LSPD
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,-141.9430,-1878.3663,3001.0859,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	CreateDynamicPickup(1239,23,1374.8418,-1733.8414,2949.9790,-1);// LSFD
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,1374.8418,-1733.8414,2949.9790,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);

	CreateDynamicPickup(1239,23,1178.4286,-1315.2794,2804.5207,-1);// Medic
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,1178.4286,-1315.2794,2804.5207,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamicPickup(1239,23,1667.0906,-1628.2998,4698.9728,-1);// CNN
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,1667.0906,-1628.2998,4698.9728,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);

    CreateDynamicPickup(1239,23,71.2379,-342.3935,2101.0859,-1);// SADoC столовая
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",C_BLUE,71.2379,-342.3935,2101.0859,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);

	// - Утилизация авто
 	CreateDynamicPickup(1239, 2, 205.5953,-229.0132,1.7786);
 	strZones[11] = CreateDynamicSphere(205.5953,-229.0132,1.7786,5.0);

    // - LSPD

    gDoorsButton[0] = CreateButton(1555.39038, -1671.58252, 1099.51709, 0.0);
    gDoorsButton[1] = CreateButton(1555.39038, -1671.72253, 1099.51709, -180.00000);
    gDoors[0] = CreateDynamicObject(3089, 1553.51501, -1671.65527, 1099.50562, 0.00000, 0.00000, 0.00000);


    gDoorsButton[2] = CreateButton(1555.39319, -1682.44653, 1099.51709, 0.0);
    gDoorsButton[3] = CreateButton(1555.39319, -1682.60645, 1099.51709, 180.00000);
    gDoors[1] = CreateDynamicObject(3089, 1553.51501, -1682.53528, 1099.50562,   0.00000, 0.00000, 0.00000);

    gDoorsButton[4] = CreateButton(1552.90662, -1683.05261, 1099.51709, -90.00000);
    gDoorsButton[5] = CreateButton(1552.76660, -1683.05261, 1099.51709, 90.00000);
    gDoors[2] = CreateDynamicObject(1495, 1552.85889, -1684.95496, 1098.23999,   0.00000, 0.00000, 90.00000);

    gDoorsButton[8] = CreateButton(1576.95276, -1683.20508, 1099.51709, 90.00000);
    gDoorsButton[9] = CreateButton(1577.19275, -1683.18506, 1099.51709, -90.00000);
    gDoors[4] = CreateDynamicObject(1495, 1577.08997, -1684.97498, 1098.23999,   0.00000, 0.00000, 90.00000);

	CreateDynamic3DTextLabel("F",C_BLUE,1622.1864,-1628.0428,1584.3396,2.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	CreateDynamic3DTextLabel("F",C_BLUE,1621.9664,-1628.0428,1584.3396,2.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	CreateDynamic3DTextLabel("F",C_BLUE,1618.5948,-1628.0445,1584.3396,2.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	CreateDynamic3DTextLabel("F",C_BLUE,1618.3549,-1628.1046,1584.3396,2.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	CreateDynamic3DTextLabel("F",C_BLUE,1644.0156, -1630.8198, 1584.4525,2.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	CreateDynamic3DTextLabel("F",C_BLUE,1643.9956, -1631.0198, 1584.4525,2.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);

    CreateDynamicPickup(1239,23,1540.0371,-1679.9851,2494.2458,1);
	CreateDynamic3DTextLabel("[ Оплата штрафов ]\n\n"cBLUE"ALT",0xFFFFFFFF,1540.0371,-1679.9851,2494.2458,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	
	CreateDynamicPickup(1239,23,1544.2462,-1679.9846,2494.2458,1);
	CreateDynamic3DTextLabel("[ Получение номеров ]\n\n"cBLUE"ALT",0xFFFFFFFF,1544.2462,-1679.9846,2494.2458,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	// -

    CreateDynamicMapIcon(621.1418,-1508.1208,14.9562, 27, 0xFFFFFFFF, -1, -1, -1, 999.0);
	CreateDynamicMapIcon(2529.3794,-1516.0413,24.0029, 27, 0xFFFFFFFF, -1, -1, -1, 999.0);
	CreateDynamicMapIcon(1372.6450,205.8610,19.5547, 27, 0xFFFFFFFF, -1, -1, -1, 999.0);
	// - Иконки
	CreateDynamicMapIcon(626.9651,-571.7659,17.9207, 30, 0xFFFFFFFF, -1, -1, -1, 999.0);
	CreateDynamicMapIcon(1555.5061,-1675.7169,16.1953, 30, 0xFFFFFFFF, -1, -1, -1, 999.0);
	CreateDynamicMapIcon(1172.0797,-1323.3346,15.4030, 22, 0xFFFFFFFF, -1, -1, -1, 999.0);
	CreateDynamicMapIcon(-516.0958,-506.3793,25.5234, 38, 0xFFFFFFFF, -1, -1, -1, 999.0);
	CreateDynamicMapIcon(-575.9564,-502.6200,25.5234, 51, 0xFFFFFFFF, -1, -1, -1, 999.0);
	CreateDynamicMapIcon(1459.2772,-1009.9228,26.8438, 52, 0xFFFFFFFF, -1, -1, -1, 999.0);
	CreateDynamicMapIcon(725.5730,-1440.4501,13.5318 , 55, 0xFFFFFFFF, -1, -1, -1, 999.0);
	CreateDynamicMapIcon(1684.1975,-2323.0776,13.0409 , 5, 0xFFFFFFFF, -1, -1, -1, 999.0);
	CreateDynamicMapIcon(2203.1719,-2661.2793,13.2043 , 9, 0xFFFFFFFF, -1, -1, -1, 999.0);
	CreateDynamicMapIcon(1653.9314,-1655.5659,22.5156 , 25, 0xFFFFFFFF, -1, -1, -1, 999.0);
	
	CreateDynamicMapIcon(2314.9470,-1372.9753,24.0245, 30, 0xFFFFFFFF, -1, -1, -1, 999.0);
	CreateDynamicMapIcon(2013.6409,-2121.1035,13.5469, 30, 0xFFFFFFFF, -1, -1, -1, 999.0);
	
	// -

	// - SFPD
	gDoorsButton[6] = CreateButton(247.6364, 72.8405, 1003.8966,0.0);
	gDoors[3] = CreateDynamicObject(1495,245.6280, 72.5611, 1002.6413, 0.0,0.0,0.0);
	gDoorsButton[7] = CreateButton(247.6364, 72.3205, 1003.8966,180.0);
	CreateDynamicObject(2922,247.6364, 72.8405, 1003.8966,0.0000,0.0000,0.0000);
	CreateDynamicObject(2922,247.6364, 72.3205, 1003.8966,0.0000,0.0000,180.0000);
	CreateDynamic3DTextLabel("F",C_BLUE,247.6364, 72.8405, 1003.8966,2.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	CreateDynamic3DTextLabel("F",C_BLUE,247.6364, 72.3205, 1003.8966,2.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	// -

	// - Баг со скрой и такси
	CreateObject(8553, 1103.07703, -1239.89624, 14.71223,   0.00000, 0.00000, 0.00000,999);
	CreateObject(8553, 1104.85510, -1342.75464, 10.88263,   5.00000, 0.00000, 0.00000,999);
	CreateObject(5737, 1131.00745, -1303.43140, 6.48700,   0.00000, 0.00000, 0.00000,999);
	CreateObject(5737, 1112.21423, -1303.46423, 6.48696,   0.00000, 0.00000, 0.00000,999);
	// -

	// - Автосалоны
	CreateDynamicPickup(1210,23,1053.9259,684.9886,4924.6525,-1);
	CreateDynamic3DTextLabel("[ Покупка ]\n\n"cBLUE"ALT",0xFFFFFFFF,1053.9259,684.9886,4924.6525,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	// -

	// - Medic
	
	CreateDynamicPickup(1210,23,1160.5388,-1311.7430,2804.5148,-1);
	CreateDynamic3DTextLabel("[ Одежда ]\n\n"cBLUE"ALT",0xFFFFFFFF,1160.5388,-1311.7430,2804.5148,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	// -

	// - CNN
	CreateDynamicPickup(1239,23,1670.8842,-1646.3506,4698.9738,-1);
	CreateDynamic3DTextLabel(""cBLUE"ALT",0xFFFFFFFF,1670.8842,-1646.3506,4698.9738,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	// -

	// - СТО
 	CreateDynamicPickup(1239,23,2517.6382,-1542.6737,24.0029,-1);
	CreateDynamic3DTextLabel("[ Дубликат ключей ]\n\n"cBLUE"ALT",0xFFFFFFFF,2517.6382,-1542.6737,24.0029,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	CreateDynamicPickup(1239,23,595.0700,-1504.2452,15.2091,-1);
	CreateDynamic3DTextLabel("[ Дубликат ключей ]\n\n"cBLUE"ALT",0xFFFFFFFF,595.0700,-1504.2452,15.2091,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	CreateDynamicPickup(1239,23,1362.3319,199.9982,19.7168,-1);
	CreateDynamic3DTextLabel("[ Дубликат ключей ]\n\n"cBLUE"ALT",0xFFFFFFFF,1362.3319,199.9982,19.7168,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	// -

	// - Автошкола
	CreateDynamicPickup(1239,23,1196.6157,1341.1388,1501.6559,-1);
	CreateDynamic3DTextLabel("[ Покупка прав ]\n\n"cBLUE"ALT",0xFFFFFFFF,1196.6157,1341.1388,1501.6559,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	// -


	// - Мэрия
	CreateDynamicPickup(1239,23,1485.1050,-1745.8037,3910.4715,-1);
	CreateDynamic3DTextLabel("[ Получение паспорта ]\n\n"cBLUE"ALT",0xFFFFFFFF,1485.1050,-1745.8037,3910.4715,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	// -

    // Пикапы бизнесов
    //CreateDynamicPickup(1210,23,368.9885,-114.6014,1001.4995,-1); // устройство
    CreateDynamicPickup(1210,23,377.1257,-177.6013,1000.6328,-1); // устройство
    CreateDynamicPickup(1210,23,380.1048,-72.1296,1001.5078,-1); // устройство
    CreateDynamicPickup(1210,23,364.9163,-5.3501,1001.8516,-1); // устройство

    //CreateDynamic3DTextLabel("[ Работа ]\n\n"cBLUE"ALT",0xFFFFFFFF,368.9885,-114.6014,1001.4995,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Работа ]\n\n"cBLUE"ALT",0xFFFFFFFF,377.1257,-177.6013,1000.6328,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Работа ]\n\n"cBLUE"ALT",0xFFFFFFFF,380.1048,-72.1296,1001.5078,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("[ Работа ]\n\n"cBLUE"ALT",0xFFFFFFFF,364.9163,-5.3501,1001.8516,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,379.3506,-190.4740,1000.6328,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,375.5897,-118.8041,1001.4995,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,377.4535,-67.4345,1001.5078,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,369.6813,-6.0225,1001.8589,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,498.0475,-76.0367,998.7578,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,1207.2336,-29.0828,1000.9531,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,-784.1971,500.0738,1371.7422,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,203.8694,-43.2627,1001.8047,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,207.0882,-129.1814,1003.5078,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,161.4221,-83.2581,1001.8047,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,206.3741,-8.1361,1001.2109,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,204.3264,-159.3523,1000.5234,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,-2237.1565,130.1796,1035.4141,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,207.6243,-100.3268,1005.2578,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,274.8398,1085.8550,1913.8648,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,295.5261,-38.5112,1001.5156,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,499.9670,-20.7732,1000.6797,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,473.9651,-392.6142,1117.0730,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,1923.5782,148.9455,1002.8062,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
    CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,-81.9160,-1597.5673,2860.2357,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);

	CreateDynamicPickup(1239,23,295.5261,-38.5112,1001.5156,-1);
	CreateDynamicPickup(1239,23,379.3506,-190.4740,1000.6328,-1); // покупка
    CreateDynamicPickup(1239,23,375.5897,-118.8041,1001.4995,-1); // покупка
    CreateDynamicPickup(1239,23,377.4535,-67.4345,1001.5078,-1); // покупка
    CreateDynamicPickup(1239,23,369.6813,-6.0225,1001.8589,-1); // покупка
    CreateDynamicPickup(1239,23,498.0475,-76.0367,998.7578,-1);
    CreateDynamicPickup(1239,23,1207.2336,-29.0828,1000.9531,-1);
    CreateDynamicPickup(1239,23,-784.1971,500.0738,1371.7422,-1);
    CreateDynamicPickup(1239,23,203.8694,-43.2627,1001.8047,-1);
    CreateDynamicPickup(1239,23,207.0882,-129.1814,1003.5078,-1);
    CreateDynamicPickup(1239,23,161.4221,-83.2581,1001.8047,-1);
    CreateDynamicPickup(1239,23,206.3741,-8.1361,1001.2109,-1);
    CreateDynamicPickup(1239,23,204.3264,-159.3523,1000.5234,-1);
    CreateDynamicPickup(1239,23,-2237.1565,130.1796,1035.4141,-1);
    CreateDynamicPickup(1239,23,207.6243,-100.3268,1005.2578,-1);
    CreateDynamicPickup(1239,23,274.8398,1085.8550,1913.8648,-1);
    CreateDynamicPickup(1239,23,499.9670,-20.7732,1000.6797,-1);


    CreateDynamicPickup(1239,23,473.9651,-392.6142,1117.0730,-1);
    CreateDynamicPickup(1239,23,1923.5782,148.9455,1002.8062,-1);
    // Пикапы бизнесов

    // - Еда
    CreateDynamicObject(1340, -2007.24780, -2358.01270, 30.69280,   0.00000, 0.00000, 45.00000);
	CreateDynamicObject(1342, -2009.84924, -2355.35449, 30.66000,   0.00000, 0.00000, 45.00000);
	CreateDynamicObject(1337, -2004.49939, -2362.72534, 30.27000,   0.00000, 0.00000, 135.00000);
	CreateDynamicObject(1368, -2005.80615, -2361.53687, 30.32590,   0.00000, 0.00000, 135.00000);
	CreateDynamicObject(1368, -2013.36523, -2353.88843, 30.32590,   0.00000, 0.00000, 135.00000);
	CreateDynamicObject(1337, -2009.57434, -2357.82959, 30.27000,   0.00000, 0.00000, 135.00000);
	CreateDynamicObject(1340, -1059.58740, -1199.42688, 129.27631,   0.00000, 0.00000, 0.00000);
	CreateDynamicObject(1337, -1060.86157, -1201.03088, 128.85518,   0.00000, 0.00000, 90.00000);
	CreateDynamicObject(1368, -1060.63660, -1202.83398, 128.91628,   0.00000, 0.00000, 90.00000);
	CreateDynamicObject(1368, -1060.74829, -1209.64648, 128.91628,   0.00000, 0.00000, 90.00000);
    // -

    CreateDynamicObject(2949, 1649.26111, -1642.72290, 82.78280,   0.00000, 0.00000, -135.00000);

    // -
    CreateDynamic3DTextLabel("[ Загрузка товаров ]\n\nНажмите "cBLUE"H",0xFFFFFFFF,1078.9844,-340.3599,73.9922,20.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);

	for(new i; i != MAX_WOODS; i++) {
		WD::[i][woodZone] = CreateDynamicSphere(Woods[i][0],Woods[i][1],Woods[i][2],2.0);
		WD::[i][woodObject] = CreateDynamicObject(660,Woods[i][0],Woods[i][1],Woods[i][2],Woods[i][3],Woods[i][4],Woods[i][5]);
		WD::[i][woodUse] = false;
		WD::[i][woodIsDrop] = false;
		WD::[i][woodCount] = 100;
	}
	for(new i; i != MAX_PAYNSPRAY; i++) {
		PaynSpray[i] = CreateDynamicSphere(paynspray[i][0],paynspray[i][1],paynspray[i][2],10.0);
	}

    strZones[4] = CreateDynamicRectangle(1120.8429, -291.0931, 1008.7490,-379.0820);
	strZones[5] = CreateDynamicRectangle(toplivoDriver[0], toplivoDriver[1], toplivoDriver[2], toplivoDriver[3]);
	strZones[6] = CreateDynamicSphere(-467.1220,-94.9726,773.8900,1.0);
	strZones[7] = CreateDynamicSphere(-468.3763,-72.0642,773.8900,1.0);
	strZones[8] = CreateDynamicSphere(-468.4299,-92.4901,773.8900,1.0);
	strZones[9] = CreateDynamicSphere(-470.7334,-97.0103,773.8900,1.0);
	

	strZones[10] = CreateDynamicRectangle(-609.0396,5.8006, -364.1525,-209.7795);

	loadPrisonVehicle();
    



	for(new i; i != MAX_GATE; i ++) 
	{
	    gID[i] = CreateDynamicObject(G::[i][gObject],G::[i][gP][0],G::[i][gP][1],G::[i][gP][2],G::[i][gP][3],G::[i][gP][4],G::[i][gP][5]);
	    gStatus[i] = false;
		
		switch( i )
		{
			case 7 .. 9 :
			{
				SetDynamicObjectMaterial( gID[i], 0, 19278, "skydiveplatforms", "hazardtile19-2", 0xFFFFFFFF); 
				SetDynamicObjectMaterial( gID[i], 1, 10839, "aircarpkbarier_sfse", "chevron_red_64HVa", 0x00000000);
			}
		}
	}
	
	mysql_tquery(1, "SELECT * FROM `gb_business` ORDER BY `bID`", "MySQLQuery", "dd", 0, 5);
	for(new i = 1; i <= MAX_VEHICLES; i++)
	{
	    if(!IsValidVehicle(i)) continue;
	    caradmin[i] = false;
		
		if(i >= ataxils[0] && i <= ataxils[1]) {
		    V::[i][vTaxiDriver] = -1;
		    V::[i][vTaxiText] = -1;
		    SetVehicleParamsEx(i,eng,light,other1,1,other3,other4,other5);
		    V::[i][vLock] = true;
		    V::[i][vHealth] = 1000.0;
		    V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
		}
		if(i >= buscars[0] && i <= buscars[1]) {
			V::[i][vBusDriver] = -1;
			V::[i][vHealth] = 1000.0;
			V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
		}
		if(i >= dalncars[0] && i <= dalncars[1]) {
			V::[i][vDalnDriver] = -1;
			SetVehicleParamsEx(i,eng,light,other1,1,other3,other4,other5);
			V::[i][vLock] = true;
			V::[i][vHealth] = 1000.0;
			V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
			V::[i][vProducts] = 0;
			V::[i][vProductsID] = 0;
		}
		if(i >= sheriffandpolice[0] && i <= sheriffandpolice[1]) {
		    V::[i][vHealth] = 1000.0;
			V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
		}
		if(i >= lspdcars[0] && i <= lspdcars[1]) {
			V::[i][vHealth] = 1000.0;
			V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
			switch(GetVehicleModel(i)) {
				case 528: {
					V::[i][vInvSlot][0] = 433,V::[i][vInvSlot][1] = 433,V::[i][vInvSlot][2] = 434,V::[i][vInvSlot][3] = 434,V::[i][vInvSlot][4] = 431,V::[i][vInvSlot][5] = 431;
					V::[i][vInvSlotKol][0] = 1,V::[i][vInvSlotKol][1] = 1,V::[i][vInvSlotKol][2] = 2,V::[i][vInvSlotKol][3] = 2,V::[i][vInvSlotKol][4] = 100,V::[i][vInvSlotKol][5] = 100;
				}
				case 601: {
					V::[i][vInvSlot][0] = 433,V::[i][vInvSlot][1] = 433,V::[i][vInvSlot][2] = 433,
					V::[i][vInvSlot][3] = 433,V::[i][vInvSlot][4] = 434,V::[i][vInvSlot][5] = 434,
					V::[i][vInvSlot][6] = 434,V::[i][vInvSlot][7] = 434;
					
					V::[i][vInvSlotKol][0] = 1,V::[i][vInvSlotKol][1] = 1,V::[i][vInvSlotKol][2] = 1,
					V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 2,V::[i][vInvSlotKol][5] = 2,
					V::[i][vInvSlotKol][6] = 2,V::[i][vInvSlotKol][7] = 2;
				}
				case 427: {
					V::[i][vInvSlot][0] = 433,V::[i][vInvSlot][1] = 433,V::[i][vInvSlot][2] = 433,
					V::[i][vInvSlot][3] = 433,V::[i][vInvSlot][4] = 431,V::[i][vInvSlot][5] = 431,
					V::[i][vInvSlot][6] = 431,V::[i][vInvSlot][7] = 431,V::[i][vInvSlot][8] = 434,
					V::[i][vInvSlot][9] = 434,V::[i][vInvSlot][10] = 434,V::[i][vInvSlot][11] = 434,
					V::[i][vInvSlot][12] = 437;
					
					V::[i][vInvSlotKol][0] = 1,V::[i][vInvSlotKol][1] = 1,V::[i][vInvSlotKol][2] = 1,
					V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 100,V::[i][vInvSlotKol][5] = 100,
					V::[i][vInvSlotKol][6] = 100,V::[i][vInvSlotKol][7] = 100,V::[i][vInvSlotKol][8] = 2,
					V::[i][vInvSlotKol][9] = 2,V::[i][vInvSlotKol][10] = 2,V::[i][vInvSlotKol][11] = 2,
					V::[i][vInvSlotKol][12] = 1;
				}
				case 490: {
				    V::[i][vInvSlot][0] = 437,V::[i][vInvSlot][1] = 435,V::[i][vInvSlot][2] = 434,V::[i][vInvSlot][3] = 434,V::[i][vInvSlot][4] = 431,V::[i][vInvSlot][5] = 431;
				    V::[i][vInvSlotKol][0] = 1,V::[i][vInvSlotKol][1] = 1,V::[i][vInvSlotKol][2] = 2,V::[i][vInvSlotKol][3] = 2,V::[i][vInvSlotKol][4] = 100,V::[i][vInvSlotKol][5] = 100;
				}
				case 596,597: {
				    V::[i][vInvSlot][0] = 433,V::[i][vInvSlot][1] = 433,V::[i][vInvSlot][2] = 434,
					V::[i][vInvSlot][3] = 435,V::[i][vInvSlot][4] = 436,V::[i][vInvSlot][5] = 437;
					
					V::[i][vInvSlotKol][0] = 1,V::[i][vInvSlotKol][1] = 1,V::[i][vInvSlotKol][2] = 1,
					V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 1,V::[i][vInvSlotKol][5] = 1;
				}
				case 541:
				{

				}
				case 416:
				{
				    V::[i][vInvSlot][2] = 434; V::[i][vInvSlotKol][2] = 1;
				    V::[i][vInvSlot][3] = 434; V::[i][vInvSlotKol][3] = 1;
				    V::[i][vInvSlot][4] = 434; V::[i][vInvSlotKol][4] = 1;
				    V::[i][vInvSlot][5] = 434; V::[i][vInvSlotKol][5] = 1;
				    V::[i][vInvSlot][6] = 434; V::[i][vInvSlotKol][6] = 1;
				    V::[i][vInvSlot][7] = 434; V::[i][vInvSlotKol][7] = 1;
				    V::[i][vInvSlot][0] = 435; V::[i][vInvSlotKol][0] = 1;
				    V::[i][vInvSlot][1] = 437; V::[i][vInvSlotKol][1] = 1;
				}
				default: {
					V::[i][vInvSlot][0] = 433,V::[i][vInvSlot][1] = 433,V::[i][vInvSlot][2] = 434,V::[i][vInvSlot][3] = 435,V::[i][vInvSlot][4] = 436,V::[i][vInvSlot][5] = 437;
					V::[i][vInvSlotKol][0] = 1,V::[i][vInvSlotKol][1] = 1,V::[i][vInvSlotKol][2] = 1,V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 1,V::[i][vInvSlotKol][5] = 1;
				}
			}
		}
		if(i >= sherifcar[0] && i <= sherifcar[1] || i >= sasd_car[0] && i <= sasd_car[1] ) {
			V::[i][vHealth] = 1000.0;
			V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
			switch(GetVehicleModel(i)) {
				case 599: {
					V::[i][vInvSlot][0] = 434,V::[i][vInvSlot][1] = 435,V::[i][vInvSlot][2] = 436,V::[i][vInvSlot][3] = 437;
					V::[i][vInvSlotKol][0] = 1,V::[i][vInvSlotKol][1] = 1,V::[i][vInvSlotKol][2] = 1,V::[i][vInvSlotKol][3] = 1;
				}
				case 598:
				{
				    V::[i][vInvSlot][0] = 433,V::[i][vInvSlot][1] = 433,V::[i][vInvSlot][2] = 434,V::[i][vInvSlot][3] = 435,V::[i][vInvSlot][4] = 436,V::[i][vInvSlot][5] = 437;
					V::[i][vInvSlotKol][0] = 1,V::[i][vInvSlotKol][1] = 1,V::[i][vInvSlotKol][2] = 1,V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 1,V::[i][vInvSlotKol][5] = 1;
				    //439
				}
				default: {
					V::[i][vInvSlot][0] = 434,V::[i][vInvSlot][1] = 435,V::[i][vInvSlot][2] = 436,V::[i][vInvSlot][3] = 437;
					V::[i][vInvSlotKol][0] = 1,V::[i][vInvSlotKol][1] = 1,V::[i][vInvSlotKol][2] = 1,V::[i][vInvSlotKol][3] = 1;
				}
			}
		}
		if(i >= medicalcar[0] && i <= medicalcar[1])
		{
			V::[i][vHealth] = 1000.0;
			V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
			switch(GetVehicleModel(i))
			{
				case 416, 426, 482:
				{
					V::[i][vInvSlot][0] = 451,V::[i][vInvSlot][1] = 451,V::[i][vInvSlot][2] = 451,
					V::[i][vInvSlot][3] = 435,V::[i][vInvSlot][4] = 435,V::[i][vInvSlot][5] = 435,
					V::[i][vInvSlot][6] = 450,V::[i][vInvSlot][7] = 442;

					V::[i][vInvSlotKol][0] = 1,V::[i][vInvSlotKol][1] = 1,V::[i][vInvSlotKol][2] = 1,
					V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 1,V::[i][vInvSlotKol][5] = 1,
					V::[i][vInvSlotKol][6] = 1,V::[i][vInvSlotKol][7] = 1;
				}
			}
		}
		if(i >= smicars[0] && i <= smicars[1]) {
			V::[i][vHealth] = 1000.0;
			V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
			switch(GetVehicleModel(i)) {
				case 551: {
					V::[i][vInvSlot][0] = 341,V::[i][vInvSlot][1] = 341,V::[i][vInvSlot][2] = 341,V::[i][vInvSlot][3] = 341,V::[i][vInvSlot][4] = 434,V::[i][vInvSlot][5] = 435,V::[i][vInvSlot][6] = 437;
					V::[i][vInvSlotKol][0] = 100,V::[i][vInvSlotKol][1] = 100,V::[i][vInvSlotKol][2] = 100,V::[i][vInvSlotKol][3] = 100,V::[i][vInvSlotKol][4] = 2,V::[i][vInvSlotKol][5] = 1,V::[i][vInvSlotKol][6] = 1;
				}
				case 582: {
					V::[i][vInvSlot][0] = 341,V::[i][vInvSlot][1] = 341,V::[i][vInvSlot][2] = 434,V::[i][vInvSlot][3] = 435,V::[i][vInvSlot][4] = 437;
					V::[i][vInvSlotKol][0] = 100,V::[i][vInvSlotKol][1] = 100,V::[i][vInvSlotKol][2] = 2,V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 1;
				}
			}
		}
		if(i >= meria[0] && i <= meria[1]) {
		    V::[i][vHealth] = 1000.0;
			V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
		}
		if(i >= comm[0] && i <= comm[1]) {
		    V::[i][vHealth] = 1000.0;
			V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
		}
		V::[i][vRentCar][0] = -1;
		if(i >= carsalon[0][0] && i <= carsalon[1][0]) {
		    V::[i][vRentCar][0] = 0;
		    V::[i][vHealth] = 1000.0;
			V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
		}
        if(i >= carsalon[0][1] && i <= carsalon[1][1]) {
		    V::[i][vRentCar][0] = 0;
		    V::[i][vHealth] = 1000.0;
			V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
		}
		if(i >= carsalon[0][2] && i <= carsalon[1][2]) {
		    V::[i][vRentCar][0] = 0;
		    V::[i][vHealth] = 1000.0;
			V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
		}
		if(i >= carsalon[0][3] && i <= carsalon[1][3]) {
		    V::[i][vRentCar][0] = 0;
		    V::[i][vHealth] = 1000.0;
			V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
		}
		V::[i][vBuyingCar] = -1;
		GetVehicleParamsEx(i,eng,light,other1,other2,other3,other4,other5);
		SetVehicleParamsEx(i,false,light,other1,other2,other3,other4,other5);
	}
	
	//mysql_tquery(1, "SELECT * FROM `gb_cars` ORDER BY `cID`", "MySQLQuery", "dd", 0, 6);
	mysql_tquery(1, "SELECT * FROM `gb_frac` ORDER BY `fID`", "MySQLQuery", "dd", 0, 7);
	mysql_tquery(1, "SELECT * FROM `gb_others`", "MySQLQuery", "dd", 0, 8);

	format(gb_string,sizeof(gb_string),"Древесина\n{ffffff}%d кг.",S::[0][wsWoods]);
	S::[0][wsWoodsT] = CreateDynamic3DTextLabel(gb_string,C_BLUE,-1969.3164,-2397.6604,774.8055,10.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	format(gb_string,sizeof(gb_string),"Обработанная древесина\n{ffffff}%d кг.",S::[0][wsWoodsSklad]);
	S::[0][wsWoodsTS][0] = CreateDynamic3DTextLabel(gb_string,C_BLUE,-1964.4370,-2407.4546,773.8900,10.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	format(gb_string,sizeof(gb_string),"Обработанная древесина\n{ffffff}%d кг.",S::[0][wsWoodsSklad]);
	S::[0][wsWoodsTS][1] = CreateDynamic3DTextLabel(gb_string,C_BLUE,-496.0325,-82.4771,61.2981,10.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);

	format(gb_string,sizeof(gb_string),"Завод мебели\n\n{ffffff}Мебель: %d ед.\nДревесины: %d ед.",MebelZavod,WoodsZavod);
	InfoFermText[7] = CreateDynamic3DTextLabel(gb_string,C_BLUE,-18.9291,-273.3552,5.4297,20.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	format(gb_string,sizeof(gb_string),"Нефтеперерабатывающий завод\n\n{ffffff}Топливо: %d л.",ToplivoZavod);
	InfoFermText[8] = CreateDynamic3DTextLabel(gb_string,C_BLUE,248.2978,1420.6721,10.5727,20.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
	
    //#include "../include/object1s.inc"
    //LoadObjectList();
    #include "../include/textdraws.inc"
	return 1;
}

#include "gambit\script.inc"
#include "gambit\cmd"

stock random_values_array(array_input[], const array_size)
{
    for (new i = 0; i < array_size; i++)
	{
        array_input[i] = random(array_size);

        for (new j = 0; j < array_size; j++) {
            if (i != j && array_input[i] == array_input[j]) {
                j = -1;
                array_input[i] = random(array_size);
            }
        }
    }
}

public OnGameModeExit() {
	foreach (new i : Player) {
		if(GetPVarInt(i, "uLogin") == 1) {
   			showPlayerDialog(i,-1,DIALOG_STYLE_MSGBOX,"1","1","1","1");
		}
	}
	SaveAllProducts();
	mysql_close();
	return 1;
}

public OnPlayerConnect(playerid) 
{
	if( closeserver == true ) 
	{
	    SendClientMessage( playerid, C_ORANGE, "Вы не можете подключиться к серверу, выполняется технический рестарт." );
	    KickEx(playerid);
	    return 1;
	}
	
    if(IsPlayerNPC(playerid)) 
		return BanEx(playerid, "Fake NPC");
		
    PlayerKey[playerid] = "";
    D::[playerid][dRentVehicleID] = -1;
	ac_dialog[playerid] = 0;
    SetPVarInt(playerid, "NarkEffect", 0);
    SetPVarInt(playerid, "HouseFurniture", 0);
    for(new uInfo:i; i < uInfo; ++i) Player[playerid][i] = 0;
    for(new pData:i; i < pData; ++i) D::[playerid][i] = 0;
    for(new invInfo:i; i < invInfo; ++i) Inv[playerid][i] = 0;


    playerFlags[playerid] = Flags:0;

    D::[playerid][dTaxiKey] = -1;
    D::[playerid][dBusKey] = -1;
    D::[playerid][dDalnKey] = -1;
    PlayerTrailer[playerid] = -1;
    PlayerTrailerTime[playerid] = -1;

	PlayerUseDrink[playerid] = 0;
	PlayerCountMinute[playerid] = 0;

    SetPVarInt(playerid,"BusToGo",-1);
    SetPVarInt(playerid,"changeSlot",-1);
	SetPVarInt(playerid,"selectSlot",-1);
	SetPVarInt(playerid,"changeSlotUse",-1);
	SetPVarInt(playerid,"selectSlotUse",-1);
	SetPVarInt(playerid,"PlayerVehicleID",-1);
	SetPVarInt(playerid,"uLogin",0);
	SetPVarInt(playerid,"UseSlots",-1);

	SetPVarInt(playerid, "BlockID",INVALID_PLAYER_ID);
	SetPVarInt(playerid, "phoneCaller",INVALID_PLAYER_ID);
	SetPVarInt(playerid, "phoneCalled",INVALID_PLAYER_ID);
	SetPVarInt(playerid, "follow",INVALID_PLAYER_ID);
	SetPVarInt(playerid, "medicalCall",INVALID_PLAYER_ID);

	SetPVarInt(playerid, "TimerCountWoods",0);
	SetPVarInt(playerid, "CountBackTaxi",0);
	SetPVarInt(playerid, "CountBackDaln",0);
	SetPVarInt(playerid, "CountBackToBus",0);
	//SetPVarInt(playerid,"timerHospital",0);
	SetPVarInt(playerid, "dettachTrailer",0);
	SetPVarInt(playerid, "playerFreezing",1);
	SetPVarInt(playerid, "PlayerHandshake", -1);
	SetPVarInt(playerid, "PlayerFrisk", -1);
	SetPVarInt(playerid, "PlayerEvict", -1);
	SetPVarInt(playerid, "PlayerOCC", -1);
	SetPVarInt(playerid, "PlayerRO", -1);

	SetPVarInt(playerid, "PlayerHouse", -1);

	SetPVarInt(playerid,"AdvertID",-1);

    SetPlayerColor(playerid,FracColor[0]);

	Player[playerid][uHP] = 100.0;

	YNText[playerid][0] = CreatePlayerTextDraw(playerid,281.000000, 120.000000, "_");
	PlayerTextDrawBackgroundColor(playerid,YNText[playerid][0], 255);
	PlayerTextDrawFont(playerid,YNText[playerid][0], 1);
	PlayerTextDrawLetterSize(playerid,YNText[playerid][0], 0.500000, 0.799997);
	PlayerTextDrawColor(playerid,YNText[playerid][0], -1);
	PlayerTextDrawSetOutline(playerid,YNText[playerid][0], 0);
	PlayerTextDrawSetProportional(playerid,YNText[playerid][0], 1);
	PlayerTextDrawSetShadow(playerid,YNText[playerid][0], 1);
	PlayerTextDrawUseBox(playerid,YNText[playerid][0], 1);
	PlayerTextDrawBoxColor(playerid,YNText[playerid][0], 1182971135);
	PlayerTextDrawTextSize(playerid,YNText[playerid][0], 374.000000, -10.000000);
	PlayerTextDrawSetSelectable(playerid,YNText[playerid][0], 0);

	YNText[playerid][1] = CreatePlayerTextDraw(playerid,288.000000, 119.000000, "PRESS Y");
	PlayerTextDrawBackgroundColor(playerid,YNText[playerid][1], 255);
	PlayerTextDrawFont(playerid,YNText[playerid][1], 2);
	PlayerTextDrawLetterSize(playerid,YNText[playerid][1], 0.500000, 0.799998);
	PlayerTextDrawColor(playerid,YNText[playerid][1], -1);
	PlayerTextDrawSetOutline(playerid,YNText[playerid][1], 0);
	PlayerTextDrawSetProportional(playerid,YNText[playerid][1], 1);
	PlayerTextDrawSetShadow(playerid,YNText[playerid][1], 1);
	PlayerTextDrawSetSelectable(playerid,YNText[playerid][1], 0);
	
	
	
	RemoveServerObject( playerid );
    #include "../include/textdrawsplayer.inc"
    GetPlayerIp( playerid, Player[playerid][uIP], 32 );
	format( query, sizeof query, "SELECT * FROM gb_ipbans WHERE uIP = '%s'", Player[playerid][uIP] );
	mysql_tquery( mysql, query, "OnPlayerCheckBan", "d", playerid );
	return 1;
}

public OnPlayerSpawn( playerid ) 
{

// Job	
	if(GetPVarInt(playerid,"TimerStanok")) {
		KillTimer(GetPVarInt(playerid,"TimerStanok"));
		DeletePVar(playerid,"TimerStanok");
	}
    if(GetPVarInt(playerid,"WoodsPlayer")) {
		KillTimer(GetPVarInt(playerid,"WoodsPlayer"));
		DeletePVar(playerid,"WoodsPlayer");
	}

	if(GetPVarInt(playerid,"CountBackTaxi") != 0) SetPVarInt(playerid,"CountBackTaxi",0);
	if(GetPVarInt(playerid,"CountBackToBus") != 0) SetPVarInt(playerid,"CountBackToBus",0);
	if(GetPVarInt(playerid,"TimerCountWoods") != 0) SetPVarInt(playerid,"TimerCountWoods",0);
	if(GetPVarInt(playerid,"CountBackDaln") != 0) SetPVarInt(playerid,"CountBackDaln",0);
	if(GetPVarInt(playerid,"follow") != INVALID_PLAYER_ID) SetPVarInt(GetPVarInt(playerid,"follow"),"follow",INVALID_PLAYER_ID);
//
	//TogglePlayerControllable( playerid, true );
	//setPlayerHealth( playerid, 100 );
	return true;
}	

function OnPlayerCheckLicense( playerid )
{
    if( !cache_get_row_count() ) 
		return SendClientMessage(playerid, C_GRAY, ""gbInfo"Лицензия не найдена.");
		
    new 
		licenses	[ 4 ],
		name		[ MAX_PLAYER_NAME ];

	gb_string[0] = EOS;
    cache_get_field_content( 0, "uLicenses", gb_string, mysql ); 
	sscanf( gb_string, "p<|>a<d>[4]", licenses );
    
	if( licenses[3] != 1 ) 
		return SendClientMessage(playerid, C_GRAY, ""gbInfo"Лицензия не найдена.");
	
    cache_get_field_content(0, "uName", name, mysql);
	format:vb_string( ""gbInfo"Информация.\n\n\
		Имя: "cBLUE"%s"cWHITE"\n\
		Пол: "cBLUE"%s"cWHITE"\n\
		Цвет: "cBLUE"%s"cWHITE"\n\
		Нация: "cBLUE"%s"cWHITE"\n\
		Возраст: "cBLUE"%d"cWHITE"\
	", 
		name,
		users_sex[ cache_get_field_content_int( 0, "uSex", mysql ) ], 
		users_color[ cache_get_field_content_int(0, "uColor", mysql) ], 
		users_nation[ cache_get_field_content_int(0, "uNation", mysql) ], 
		cache_get_field_content_int( 0, "uAge", mysql )
	);
	
	showPlayerDialog( playerid,9999, 0," ",vb_string, "Закрыть","" );
	
	return 1;
}

forward OnPlayerGetStat(playerid);
public OnPlayerGetStat(playerid)
{
    new Rows, Fields;
    cache_get_data(Rows, Fields);
    
    new regdate, ids;
    if(Rows)
	{
	    cache_get_field_content_int(0, "uID", ids);
	    cache_get_field_content_int(0, "uRegDate", regdate);
	    
	}
	return true;
}

public OnPlayerEnterDynamicArea(playerid, areaid) {
	clear_massive();
	if(PaynSpray[0] <= areaid <= PaynSpray[MAX_PAYNSPRAY-1]) {
		SetPVarInt(playerid,"playerUsePaynSpray",1);
	}
	if(WD::[0][woodZone] <= areaid <= WD::[MAX_WOODS - 1][woodZone]) {
	    new j = areaid - WD::[0][woodZone];
	    if(D::[playerid][dWoodsDuty] == 1) {
	    	new s = GetPlayerSkin(playerid);
			if(s == 16 || s == 27 || s == 260 || s == 13 || s == 56 || s == 131) {
			    if(GetPVarInt(playerid,"PlayerUseBox") == 4) {
			        if(WD::[j][woodUse] == false) {
			            if(WD::[j][woodIsDrop] == false) {
			                if(WD::[j][woodCount] != 0) {
			                	WD::[j][woodUse] = true;
			                	SetPVarInt(playerid,"WoodDrop",j);
								SetTimerEx("WoodsPlayer",10000,false,"ddd",playerid,j,0);
								ClearAnimations(playerid);
								togglePlayerControllable(playerid,false);
								ApplyAnimation(playerid,"CHAINSAW","WEAPON_csaw",1.0,1,0,0,0,10000,0);
								MeAction(playerid,"пилит дерево",1);
							}
						}
		            	else {
		            	    if(WD::[j][woodCount] > 0) {
		            	        WD::[j][woodCount] -= 25;
								SetPVarInt(playerid,"WoodDrop",j);
								SetTimerEx("WoodsPlayer",10000,false,"ddd",playerid,j,1);
								togglePlayerControllable(playerid,false);
								ApplyAnimation(playerid,"CHAINSAW","CSAW_G",1.0,1,0,0,0,10000,0);
								MeAction(playerid,"пилит дерево",1);
		            	    }
		            	}
   					}
   					else SendClientMessage(playerid,C_GRAY,""gbError"Простите, но это дерево уже кто-то пилит.");
				}
			}
			else SendClientMessage(playerid,C_GRAY,""gbError"Вы должны быть в рабочей одежде, для того чтобы пилить дерево.");
	    }
	}
	if(areaid == strZones[10]) {
		if(D::[playerid][dWoodsDuty] != 0) SetPVarInt(playerid,"TimerCountWoods",0);
	}
	if(areaid == strZones[6]) {
	    if(D::[playerid][dWoodsDuty] == 2) {
	        new s = GetPlayerSkin(playerid);
			if(s == 16 || s == 27 || s == 260 || s == 13 || s == 56 || s == 131) {
	        	if(GetPVarInt(playerid,"PlayerUseBox") == 0 && !GetPVarInt(playerid,"TimerStanok") && GetPVarInt(playerid,"PlayerStanok") != 1) {
	            	if(S::[0][wsWoods] <= 0) return SendClientMessage(playerid,C_GRAY,""gbError"На конвеере недостаточно древесины для переработки.");
	            	RemovePlayerAttachedObject(playerid,9);
					SetPlayerAttachedObject(playerid,9,1463,5,0.073999,0.186000,0.105998,95.299972,-175.499984,-72.199935,0.540999,0.350999,0.610999);
	        		SetPlayerSpecialAction(playerid, SPECIAL_ACTION_CARRY);
					SetPVarInt(playerid,"PlayerUseBox",5);
					S::[0][wsWoods] -= 25;
					format( gb_string,sizeof( gb_string ),"Древесина\n{ffffff}%d кг.",S::[0][wsWoods]);
    				UpdateDynamic3DTextLabelText(S::[0][wsWoodsT],C_BLUE, gb_string);
					SendClientMessage(playerid,C_GRAY,""gbError"Теперь отнесите древесину на станок для переработки.");
					MeAction(playerid,"взял(-а) древесину",1);
	        	}
			}
	    }
	    else SendClientMessage(playerid,C_GRAY,""gbError"На вас должна быть рабочая одежда для работы в цеху.");
	}
	if(areaid == strZones[7]) {
	    if(GetPVarInt(playerid,"PlayerUseBox") == 5 && D::[playerid][dWoodsDuty] == 2) {
			SetPVarInt(playerid,"PlayerUseBox",0);
			RemovePlayerAttachedObject(playerid,9);
			new obj = CreateDynamicObject(1463,-468.38101, -73.43010, 774.27722,0.00,0.00,-90.00);
			MoveDynamicObject(obj,-468.38101, -86.69010, 774.27722,1,0.00,0.00,-90.00);
	        SetGVarInt("WoodStanok",1,obj);
	        SetPlayerSpecialAction(playerid, SPECIAL_ACTION_NONE);
	        SetPVarInt(playerid,"TimerStanok",_:SetTimerEx("WoodStanok",15000,false,"d",playerid));
	        SendClientMessage(playerid,C_GRAY,""gbInfo"Дождитесь пока ваша древесина пройдёт обработку.");
	    }
	}
	if(areaid == strZones[8]) {
	    if(GetPVarInt(playerid,"PlayerStanok") == 1) {
	        SetPVarInt(playerid,"PlayerUseBox",7);
	        SetPlayerAttachedObject(playerid,8,2468,5,0.102999,-0.018998,0.105998,95.299972,-175.499984,-164.200012,0.540997,0.761999,0.610997);
			SetPlayerAttachedObject(playerid,9,2468,5,-0.104000,-0.031999,0.105998,95.299972,-175.499984,15.699944,0.540998,0.761999,0.610998);
	        DeletePVar(playerid,"PlayerStanok");
	        SetPlayerSpecialAction(playerid, SPECIAL_ACTION_CARRY);
	        SendClientMessage(playerid,C_GRAY,""gbInfo"Отнесите готовую заготовку на конвеер склада.");
	        MeAction(playerid,"взял(-а) заготовку",1);
	    }
	}
	if(areaid == strZones[9]) {
	    if(GetPVarInt(playerid,"PlayerUseBox") == 7) {
	        RemovePlayerAttachedObject(playerid,9);
	        RemovePlayerAttachedObject(playerid,8);
	        SetPVarInt(playerid,"PlayerUseBox",0);
	        
	        new obj = CreateDynamicObject(2468,-470.67337, -97.64543, 773.79999, 0.00, 0.00, 90.00);
	        new obj2 = CreateDynamicObject(2468,-470.74451, -98.02264, 773.79999,0.00,0.00,-90.00);
			MoveDynamicObject(obj,-470.67340, -104.42540, 773.79999,1,0.00,0.00,90.00);
			MoveDynamicObject(obj2,-470.74451, -104.80260, 773.79999,1,0.00,0.00,-90.00);
			
	        SetGVarInt("WoodGoSklad",1,obj);
	        SetGVarInt("WoodGoSklad2",1,obj2);
	        SetPlayerSpecialAction(playerid, SPECIAL_ACTION_NONE);
	        if(JobValueNow(playerid, 2, 34, -1) != 0) { }
			else
			{
			    SendClientMessage(playerid, -1, ""gbAccess"Ваша зарплата перечислена на чековую книжку, обналичить ее можно в банке");
		     	showPlayerDialog(playerid, 9999, 0, " ", "{ffffff}Ваш рабочий день закончен.\n\n"cGREEN"| Ваша зарплата перечислена на чековую книжку.\n"gbError"Снять деньги с чековой книжки можно в банке", "Закрыть", "");
				D::[playerid][dWoodsDuty] = 0;
				DeletePVar(playerid,"PlayerUseBox");
				DeletePVar(playerid,"PlayerStanok");
    			GetBackSkin(playerid);
				RemovePlayerAttachedObject(playerid,9);
			}
	    }
	}
	foreach(new i: Player)
	{
	    if(!GetPVarInt(playerid,"uLogin")) continue;
		if(areaid == GetPVarInt(i, "BBArea"))
  		{
    		GetPVarString(i, "BBStation", gb_string, sizeof( gb_string ));
   			PlayAudioStreamForPlayer(playerid, gb_string, GetPVarFloat(i, "BBX"), GetPVarFloat(i, "BBY"), GetPVarFloat(i, "BBZ"), 10.0, 1);
    		break;
    	}
	}
	return 1;
}

public OnPlayerLeaveDynamicArea(playerid, areaid) {
    foreach(new i: Player) {
        if(!GetPVarInt(playerid,"uLogin")) continue;
		if(areaid == GetPVarInt(i, "BBArea"))
		{
			StopAudioStreamForPlayer(playerid);
			break;
		}
	}
    
    if(PaynSpray[0] <= areaid <= PaynSpray[MAX_PAYNSPRAY-1]) SetPVarInt(playerid,"playerUsePaynSpray",0);
    if(areaid == strZones[10]) {
		if(D::[playerid][dWoodsDuty] != 0) {
			SendClientMessage(playerid,C_GRAY,""gbInfo"Вернитесь на территорию лесопилки, иначе Ваш рабочий день будет закончен.");
			SetPVarInt(playerid,"TimerCountWoods",MAX_COUNT_WOOD_ZONE);
		}
    }
    if(areaid == strZones[4]) {
        if(PlayerTrailer[playerid] != -1) {
            if(GetVehicleTrailer(GetPlayerVehicleID(playerid)) != PlayerTrailer[playerid]) {
            	V::[PlayerTrailer[playerid]][vWoods] = 0;
				V::[PlayerTrailer[playerid]][vMebel] = 0;
				V::[PlayerTrailer[playerid]][vToplivo] = 0;
				
				if (IsValidDynamic3DTextLabel(V::[PlayerTrailer[playerid]][vTextTrailer]))
	    			DestroyDynamic3DTextLabel(V::[PlayerTrailer[playerid]][vTextTrailer]);
				
            	DestroyVehicle(PlayerTrailer[playerid]);
            
	    			
	    		SetPVarInt(playerid,"dettachTrailer",0);
        		PlayerTrailer[playerid] = -1;
				DisablePlayerCheckpoint(playerid);
        		return SendClientMessage(playerid,C_GRAY,""gbError"Вы оставили свой прицеп на месте аренды.");
        	}
        }
    }
    if(areaid == strZones[5]) {
        if(PlayerTrailer[playerid] != -1 && V::[GetPlayerVehicleID(playerid)][vDalnDriver] == playerid) {
            if(GetPVarInt(playerid,"PlayerSelectTrailerTwo") == 2) {
                if(GetPVarInt(playerid,"SelectedToplivoMarsh") == 0) {
              		V::[PlayerTrailer[playerid]][vWoods] = 0;
					V::[PlayerTrailer[playerid]][vMebel] = 0;
					V::[PlayerTrailer[playerid]][vToplivo] = 0;
					
					if (IsValidDynamic3DTextLabel(V::[PlayerTrailer[playerid]][vTextTrailer]))
	    				DestroyDynamic3DTextLabel(V::[PlayerTrailer[playerid]][vTextTrailer]);
						
                    DestroyVehicle(PlayerTrailer[playerid]);
        
	    			
	    			SetPVarInt(playerid,"dettachTrailer",0);
        			PlayerTrailer[playerid] = -1;
					DisablePlayerCheckpoint(playerid);
        			return SendClientMessage(playerid,C_GRAY,""gbError"Вы не выбрали ни одного маршрута для доставки топлива.");
                }
            }
        }
    }
	return 1;
}

public OnDialogResponse(playerid, dialogid, response, listitem, inputtext[]) {
	strreplace(inputtext, '%', '#');
	strreplace(inputtext, '\n', '#');
	clear_massive();
    new string[1024], str[512];
  
	antiDialogHider( playerid, dialogid );
	if( dialog_cheat_use[playerid] == true ) return true;
	switch(dialogid) {
		case d_create: {
			if( !response ) return true;
			switch( listitem ) {
				case 0: {// Падик
					showPlayerDialog( playerid, d_create + 1, DIALOG_STYLE_INPUT, "Создание подъезда",
						"{ffffff}Укажите тип подъезда цифрой от 1 до 2", "Ввод", "Назад" );
					setData( playerid, "Player:ADMCreate", 1 );	
				}
				case 1: {
					showPlayerDialog( playerid, d_create + 1, DIALOG_STYLE_INPUT, "Создание дома",
						"{ffffff}Укажите интерьер дома и цену на дом\nПример: 1 10000", "Ввод", "Назад" );
					setData( playerid, "Player:ADMCreate", 2 );	
				}
			}
		}
		case d_create + 1: {
			if( !response ) return CallLocalFunction( "cmd_create", "d", playerid );
			switch( getData( playerid, "Player:ADMCrate" ) ) {
				case 1: CallLocalFunction( "cmd_addhostel", "ds", playerid, inputtext );
				case 2: CallLocalFunction( "cmd_addhouse", "ds", playerid, inputtext );
			}
			delData( playerid, "Player:ADMCrate" );
		}
	    case d_cigg: {
	        if(!response) {
	            showPlayerDialog( playerid, d_cigg, DIALOG_STYLE_LIST, "Использование сигареты", "1. "cGRAY"Взять сигарету в правую руку{ffffff}\n2. "cGRAY"Взять сигарету в левую руку{ffffff}\n3. "cGRAY"Прикрепить сигарету ко рту", "Выбор", "" );
				return true;
			}
	        switch(listitem) {
	            case 0: SetPlayerAttachedObject( playerid, 7,  19625, 6, 0.098999, -0.003000, 0.020000,  -2.999998, -24.799991, 45.300014, 1.000000, 1.000000, 1.000000 );
	            case 1: SetPlayerAttachedObject( playerid, 7, 19625, 5, 0.116999, -0.019000, 0.000000,  0.000000, 0.000000, 34.400043, 1.000000, 1.000000, 1.000000 );
	            case 2: SetPlayerAttachedObject( playerid, 7, 19625, 2, -0.013000, 0.110999, -0.008000,  -5.000001, 0.000000, -178.599838, 1.000000, 1.000000, 1.000000 );
	        }
	        format( string, sizeof string, "закуривает сигарету %s", Inv[playerid][invSlotKol][GetPVarInt( playerid, "use_cigg" )] == 154 ? ("Wind"):("C&K") );
			printf("%s", string );
			MeAction(playerid, string, 1);
			SetPVarInt( playerid, "smoke", 1 );
			Inv[playerid][invSlotKol][GetPVarInt( playerid, "use_cigg" )]--;
			if(Inv[playerid][invSlotKol][GetPVarInt( playerid, "use_cigg" )] < 1 ) {
	        	Inv[playerid][invSlot][GetPVarInt( playerid, "use_cigg" )] = 0;
	        	Inv[playerid][invSlotKol][GetPVarInt( playerid, "use_cigg" )] = 0;
			}
	    }
	    case 3016:
	    {
	        if(!response) return true;
	        if(Player[playerid][uMoney] < 15) return SendClientMessage(playerid, C_GRAY, "У Вас недостаточно средств!");
	        Player[playerid][uMoney] -= 15;
            mysql_format(1, query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
			GivePlayerItem(playerid, 404, 1);
			SendClientMessage(playerid, C_GRAY, "Вы купили Хот Дог.");
	    }
	    case 3017:
	    {
	        if(!response) return true;
	        if(Player[playerid][uMoney] < 8) return SendClientMessage(playerid, C_GRAY, "У Вас недостаточно средств!");
	        Player[playerid][uMoney] -= 8;
            mysql_format(1, query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
			GivePlayerItem(playerid, 508, 1);
			SendClientMessage(playerid, C_GRAY, "Вы купили мороженое! Используйте его в инвентаре!");
	    }
	    case 3018:
	    {
	        if(!response) return true;
	        if(Player[playerid][uMoney] < 30) return SendClientMessage(playerid, C_GRAY, "У Вас недостаточно средств!");
	        Player[playerid][uMoney] -= 30;
            mysql_format(1, query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
			GivePlayerItem(playerid, 480, 1);
			SendClientMessage(playerid, C_GRAY, "Вы купили цветы! Поместите их в нужный слот в инвентаре!");
	    }
	    case 3003:
	    {
	        switch(listitem)
	        {
	            case 0:
	            {
	                if(IsPlayerAttachedObjectSlotUsed(playerid, 6) &&  IsPlayerAttachedObjectSlotUsed(playerid, 7)) return SendClientMessage(playerid, -1, "Все слоты заняты, очистите их в меню!");
	                if(!IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 6, 19142, 1);
    					EditAttachedObject(playerid, 6);
    					return true;
	                }
	                else if(IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 7, 19142, 1);
    					EditAttachedObject(playerid, 7);
						return true;
	                }
				}
	            case 1:
	            {
	                if(IsPlayerAttachedObjectSlotUsed(playerid, 6) &&  IsPlayerAttachedObjectSlotUsed(playerid, 7)) return SendClientMessage(playerid, -1, "Все слоты заняты, очистите их в меню!");
	                if(!IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 6, 19775, 15 );
    					EditAttachedObject(playerid, 6);
    					return true;
	                }
	                else if(IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 7, 19775, 15 );
    					EditAttachedObject(playerid, 7);
						return true;
	                }
	            }
	            case 2: //пояс
	            {
	                if(IsPlayerAttachedObjectSlotUsed(playerid, 6) &&  IsPlayerAttachedObjectSlotUsed(playerid, 7)) return SendClientMessage(playerid, -1, "Все слоты заняты, очистите их в меню!");
	                if(!IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 6, 19942, 7 );
    					EditAttachedObject(playerid, 6);
    					return true;
	                }
	                else if(IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 7, 19942, 7 );
    					EditAttachedObject(playerid, 7);
						return true;
	                }
	            }
	            case 3: //левое плечо
	            {
	                if(IsPlayerAttachedObjectSlotUsed(playerid, 6) &&  IsPlayerAttachedObjectSlotUsed(playerid, 7)) return SendClientMessage(playerid, -1, "Все слоты заняты, очистите их в меню!");
	                if(!IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 6, 19942, 3 );
    					EditAttachedObject(playerid, 6);
    					return true;
	                }
	                else if(IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 7, 19942, 3 );
    					EditAttachedObject(playerid, 7);
						return true;
	                }
	            }
	            case 4: // право плечо
	            {
	                if(IsPlayerAttachedObjectSlotUsed(playerid, 6) &&  IsPlayerAttachedObjectSlotUsed(playerid, 7)) return SendClientMessage(playerid, -1, "Все слоты заняты, очистите их в меню!");
	                if(!IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 6, 19942, 4 );
    					EditAttachedObject(playerid, 6);
    					return true;
	                }
	                else if(IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 7, 19942, 4 );
    					EditAttachedObject(playerid, 7);
						return true;
	                }
	            }
	            case 5: //спина
	            {
	                if(IsPlayerAttachedObjectSlotUsed(playerid, 6) &&  IsPlayerAttachedObjectSlotUsed(playerid, 7)) return SendClientMessage(playerid, -1, "Все слоты заняты, очистите их в меню!");
	                if(!IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 6, 19942, 1 );
    					EditAttachedObject(playerid, 6);
    					return true;
	                }
	                else if(IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 7, 19942, 1 );
    					EditAttachedObject(playerid, 7);
						return true;
	                }
	            }
	            case 6: //жилет повышенной видимости
	            {
	                if(IsPlayerAttachedObjectSlotUsed(playerid, 6) &&  IsPlayerAttachedObjectSlotUsed(playerid, 7)) return SendClientMessage(playerid, -1, "Все слоты заняты, очистите их в меню!");
	                if(!IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 6, 19904, 1 );
    					EditAttachedObject(playerid, 6);
    					return true;
	                }
	                else if(IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 7, 19904, 1 );
    					EditAttachedObject(playerid, 7);
						return true;
	                }
	            }
	            case 7: //шлем
	            {
	                if(IsPlayerAttachedObjectSlotUsed(playerid, 6) &&  IsPlayerAttachedObjectSlotUsed(playerid, 7)) return SendClientMessage(playerid, -1, "Все слоты заняты, очистите их в меню!");
	                if(!IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 6, 19141, 2);
    					EditAttachedObject(playerid, 6);
    					return true;
	                }
	                else if(IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 7, 19141, 2);
    					EditAttachedObject(playerid, 7);
						return true;
	                }
	            }
	            case 8: //шлем
	            {
	                if(IsPlayerAttachedObjectSlotUsed(playerid, 6) &&  IsPlayerAttachedObjectSlotUsed(playerid, 7)) return SendClientMessage(playerid, -1, "Все слоты заняты, очистите их в меню!");
	                if(!IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 6, 19200, 2);
    					EditAttachedObject(playerid, 6);
    					return true;
	                }
	                else if(IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 7, 19200, 2);
    					EditAttachedObject(playerid, 7);
						return true;
	                }
	            }
	            case 9: //шлем
	            {
	                if(IsPlayerAttachedObjectSlotUsed(playerid, 6) &&  IsPlayerAttachedObjectSlotUsed(playerid, 7)) return SendClientMessage(playerid, -1, "Все слоты заняты, очистите их в меню!");
	                if(!IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 6, 19162, 2);
    					EditAttachedObject(playerid, 6);
    					return true;
	                }
	                else if(IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 7, 19162, 2);
    					EditAttachedObject(playerid, 7);
						return true;
	                }
	            }
	            case 10: //шлем
	            {
	                if(IsPlayerAttachedObjectSlotUsed(playerid, 6) &&  IsPlayerAttachedObjectSlotUsed(playerid, 7)) return SendClientMessage(playerid, -1, "Все слоты заняты, очистите их в меню!");
	                if(!IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 6, 19161, 2);
    					EditAttachedObject(playerid, 6);
    					return true;
	                }
	                else if(IsPlayerAttachedObjectSlotUsed(playerid, 6))
	                {
	                    SetPlayerAttachedObject(playerid, 7, 19161, 2);
    					EditAttachedObject(playerid, 7);
						return true;
	                }
	            }
	            case 11:
	            {
	                RemovePlayerAttachedObject(playerid,6);
	                RemovePlayerAttachedObject(playerid,7);
	                SendClientMessage(playerid, -1, "Вы очистили список объектов!");
	                return true;
	            }
	        }
	    }
	  
     	case d_objectlist: {
	        if(!response) return true;
		    new Float: PlayerPos[3];
		    switch(listitem) {
		        case 9: {
					string = "";
					strcat(string, "Название\tID ограждения\n");
					strcat(string, "10. Красная мед. сумка\t11738\n");
					strcat(string, "11. Борт для перекрытия дорожной полосы\t973\n");
					strcat(string, "12. Конус-фишка.\t1238\n");
					strcat(string, "13. Борт-ограждение\t1424\n");
					strcat(string, "14. Наземная табличка 'DETOUR'\t1425\n");
					strcat(string, "15. Борд-ограждение (маленький)\t1459\n");
					strcat(string, "16. Лестница 1\t13011\n");
					strcat(string, "17. Лестница 2\t12839\n");
					strcat(string, "18. Лестница 3\t12950\n");
					strcat(string, "19. Лестница [Маленькая]\t437\n");
					strcat(string, "<< Предыдущая страница\n" );
					strcat(string, "Следующая страница >>");
					return showPlayerDialog(playerid, d_objectlist+1, DIALOG_STYLE_TABLIST_HEADERS, " ", string, "Выбрать", "Отмена");
		        }
		        default: {
		            for(new i; i != MAX_OBJECT; i++) {
				        if(!ObjList[i][oID]) {
				            SetPVarInt(playerid, "IDMassive_Object", i);
				            SetPVarInt(playerid, "IsPlayerCreateObject", 1);
				            SetPVarInt(playerid, "ObJectCreateID", ObjectListLen[listitem]);
				            GetPlayerPos(playerid, PlayerPos[0], PlayerPos[1], PlayerPos[2]);
				            ObjList[i][oID] = i + 1; //делаем временно занятым слот I

						    ObjList[i][oObject] = CreateDynamicObject(ObjectListLen[listitem], PlayerPos[0] + 1.0,PlayerPos[1],PlayerPos[2],0.0,0.0,0.0,-1,-1,-1,300);
          					EditDynamicObject(playerid, ObjList[i][oObject]);
						    break;
				        }
				    }
		        }
		    }
	    }
	    case d_objectlist + 1: {
	        if(!response) return true;
	        new Float: PlayerPos[3];
	        if( listitem == 10 ) {
	            strcat(string, "Название\tID ограждения\n");
				strcat(string, "1. Борды красно-белая полоса\t978\n");
				strcat(string, "2. Борды красно-белая полоса\t979\n");
				strcat(string, "3. Перекрытие всей дороги\t981\n");
				strcat(string, "4. Каталки для парамедиков.\t1997\n");
				strcat(string, "5. Бочка перекрытия дороги\t1237\n");
				strcat(string, "6. Каменные плиты для перекрытия дороги\t1422\n");
				strcat(string, "7. Борт со светящимися лампами на концах\t1423\n");
				strcat(string, "8. Маленькое дорожное перекрытие\t1427\n");
				strcat(string, "9. Каменная плита для перекрытия дороги\t1434\n");
				strcat(string, "Следующая страница >>");
				return showPlayerDialog(playerid, d_objectlist, DIALOG_STYLE_TABLIST_HEADERS, " ", string, "Выбрать", "Отмена");
	        }
			if( listitem == 11 ) {
			    string = "";
				strcat(string, "Название\tID ограждения\n");
				strcat(string, "20. Лестница [Маленькая]\t1428\n");
				strcat(string, "21. Дымовой фаер\t18728\n");
				strcat(string, "22. Жёлтая лента для оцепления\t19834\n");
				strcat(string, "<< Предыдущая страница" );
				return showPlayerDialog(playerid, d_objectlist+2, DIALOG_STYLE_TABLIST_HEADERS, " ", string, "Выбрать", "Отмена");
			}
	        for(new i; i != MAX_OBJECT; i++){
		        if(!ObjList[i][oID]){
		            SetPVarInt(playerid, "IDMassive_Object", i);
		            SetPVarInt(playerid, "IsPlayerCreateObject", 1);
		            SetPVarInt(playerid, "ObJectCreateID", ObjectListLen[listitem+9]);
		            GetPlayerPos(playerid, PlayerPos[0], PlayerPos[1], PlayerPos[2]);
                    ObjList[i][oID] = i + 1;
				    ObjList[i][oObject] = CreateDynamicObject(ObjectListLen[listitem+9], PlayerPos[0] + 1.0,PlayerPos[1],PlayerPos[2],0.0,0.0,0.0,-1,-1,-1,300);
				    EditDynamicObject(playerid, ObjList[i][oObject]);
				    break;
		        }
		    }
	    }
	    case d_objectlist + 2: {
	        if(!response) return true;
	        new Float: PlayerPos[3];
	        if( listitem == 3 ) {
                string = "";
				strcat(string, "Название\tID ограждения\n");
				strcat(string, "10. Красная мед. сумка\t11738\n");
				strcat(string, "11. Борт для перекрытия дорожной полосы\t973\n");
				strcat(string, "12. Конус-фишка.\t1238\n");
				strcat(string, "13. Борт-ограждение\t1424\n");
				strcat(string, "14. Наземная табличка 'DETOUR'\t1425\n");
				strcat(string, "15. Борд-ограждение (маленький)\t1459\n");
				strcat(string, "16. Лестница 1\t13011\n");
				strcat(string, "17. Лестница 2\t12839\n");
				strcat(string, "18. Лестница 3\t12950\n");
				strcat(string, "19. Лестница [Маленькая]\t437\n");
				strcat(string, "<< Предыдущая страница\n" );
				strcat(string, "Следующая страница >>");
				showPlayerDialog(playerid, d_objectlist+1, DIALOG_STYLE_TABLIST_HEADERS, " ", string, "Выбрать", "Отмена");
	        }
	        for(new i; i != MAX_OBJECT; i++){
		        if(!ObjList[i][oID]){
		            SetPVarInt(playerid, "IDMassive_Object", i);
		            SetPVarInt(playerid, "IsPlayerCreateObject", 1);
		            SetPVarInt(playerid, "ObJectCreateID", ObjectListLen[listitem+9]);
		            GetPlayerPos(playerid, PlayerPos[0], PlayerPos[1], PlayerPos[2]);
                    ObjList[i][oID] = i + 1;
				    ObjList[i][oObject] = CreateDynamicObject(ObjectListLen[listitem+19], PlayerPos[0] + 1.0,PlayerPos[1],PlayerPos[2],0.0,0.0,0.0,-1,-1,-1,150);
				    EditDynamicObject(playerid, ObjList[i][oObject]);
				    break;
		        }
		    }
	    }
		case d_objectlist + 3: {
		    if(!response) return true;
			switch(listitem) {
			    case 0: SendClientMessage( playerid, C_GRAY,""gbInfo"Введите: /delobject [ID]");
			    case 1: {
			        SetPVarInt( playerid, "d_select", 1 );
					SetPVarInt( playerid, "FDObject:Select", 1 );
			        SelectObject( playerid );
			    }
			}
		}
	    case d_accept + 1:
	    {
	        new totalcirc = 0;
	        if(!response) return true;
	        for(new i = 0; i != MAX_CALLS; i++)
	        {
	            if(CallInfo[i][cStatus] == true)
	            {
		            totalcirc++; // количество кругов в цикле.
	                if(totalcirc != listitem+1) continue; // если количество кругов не равно пункту в меню, то продолжаем Далее.
                    showPlayerDialog(playerid, d_accept + 2, DIALOG_STYLE_LIST, " ", "{FFFFFF}1. "cGRAY"Принять{ffffff}\n{FFFFFF}2. "cGRAY"Удалить", "Далее", "Отмена");
					SetPVarInt(playerid, "CallInfoIndex", i);
	                break;
				}
	        }
	    }
	    case d_accept + 2:
	    {
	        if(!response) return true;
	        new id = GetPVarInt(playerid, "CallInfoIndex");
	        switch(listitem)
	        {
	            case 0:
	            {
	                SetPlayerCheckpoint(playerid,CallInfo[id][cX],CallInfo[id][cY],CallInfo[id][cZ],5.0);
      				SetPVarInt(playerid, "CallInfoGPS", 1);
	            }
	            case 1:
	            {
	                for(new calInfo:i; i < calInfo; ++i) CallInfo[id][i] = 0;
	            }
	        }
	        
	    }
	    
	    case d_spec:
		{
            if(!response) return 1;

		}
		case d_spec+1:
		{
		   	if(!response) return 1;
		}
		case d_spec+2:
		{
		    if(!response) return 1;
		    if(isNumeric(inputtext)) return showPlayerDialog(playerid, d_spec+2, DIALOG_STYLE_INPUT, "Причина кика", "   Введите причину кика:", "Ввод", "Закрыть");
			if(!strlen(inputtext)) return showPlayerDialog(playerid, d_spec+2, DIALOG_STYLE_INPUT, "Причина кика", "   Введите причину кика:", "Ввод", "Закрыть");
			CallLocalFunction( "cmd_kick", "iis", playerid, GetPVarInt(playerid, "SpecID"), inputtext );
		}
		case d_spec+3:
		{
		    if(!response) return 1;
		    if(isNumeric(inputtext)) return showPlayerDialog(playerid, d_spec+3, DIALOG_STYLE_INPUT, "Причина варна", "   Введите причину варна:", "Ввод", "Закрыть");
			if(!strlen(inputtext)) return showPlayerDialog(playerid, d_spec+3, DIALOG_STYLE_INPUT, "Причина варна", "   Введите причину варна:", "Ввод", "Закрыть");
			CallLocalFunction( "cmd_warn", "iis", playerid, GetPVarInt(playerid, "SpecID"), inputtext);
		}
	    case d_returnmoney: {
	        if(!response) return 1;
	        switch(listitem)
			{
			    case 0:
			    {
       				if(Player[playerid][uRenturn1][1] >= 1)
					{
					    format(string, sizeof(string), "{ffffff}Вы хотите вернуть свои деньги за дом "cGREEN"$%d", Player[playerid][uRenturn1][0]);
						showPlayerDialog(playerid,d_returnmoney+1,0," ",string,"Далее","Закрыть");
					}
				}
			    case 1:
			    {
			        if(Player[playerid][uRenturn][1] >= 1)
					{
					    format(string, sizeof(string), "{ffffff}Вы хотите вернуть свои деньги за дом "cGREEN"$%d", Player[playerid][uRenturn][0]);
					 	showPlayerDialog(playerid,d_returnmoney+2,0," ",string,"Далее","Закрыть");
					}
				}
			}
	    }
	    case d_returnmoney+1: {
	    	if(!response) return 1;
			Player[playerid][uMoney] += Player[playerid][uRenturn1][0];
			mysql_format(1, string, sizeof(string),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, string, "", "");
			Player[playerid][uRenturn1][0] = 0;
			Player[playerid][uRenturn1][1] = 0;
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы вернули свои деньги за бизнес!");
			format(query,sizeof(query),"UPDATE gb_users SET uRenturn1 = '0|0' WHERE BINARY uName = '%s'", Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
	        return 1;
	    }
	    case d_returnmoney+2: {
	    	if(!response) return 1;
			Player[playerid][uMoney] += Player[playerid][uRenturn][0];
			mysql_format(1, string, sizeof(string),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, string, "", "");
			Player[playerid][uRenturn][0] = 0;
			Player[playerid][uRenturn][1] = 0;
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы вернули свои деньги за дом!");
			format(query,sizeof(query),"UPDATE gb_users SET uRenturn = '0|0' WHERE BINARY uName = '%s'", Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
	        return 1;
	    }
        case d_radio + 3: {
            if(!response) return CallLocalFunction( "cmd_radio", "i", playerid );
            if(IsPlayerInAnyVehicle(playerid)) {
				RadioVeh[GetPlayerVehicleID(playerid)] = sizeof Radio;
				format( RadioVehStation[ GetPlayerVehicleID(playerid) ], 72, "%s", inputtext );
    			foreach(new i: Player) {
       				if(!IsPlayerConnected(i) || GetPlayerVehicleID(i) != GetPlayerVehicleID(playerid)) continue;
  					PlayAudioStreamForPlayer(i, inputtext );
				}
			}
			else PlayAudioStreamForPlayer(playerid, inputtext );
        }
		case d_radio + 2: {
		    if(!response) return CallLocalFunction( "cmd_music", "i", playerid );
		    foreach(new i: Player) {
				if(IsPlayerInDynamicArea(i, GetPVarInt(playerid, "BBArea"))) {
					PlayAudioStreamForPlayer(i, inputtext, GetPVarFloat(playerid, "BBX"), GetPVarFloat(playerid, "BBY"), GetPVarFloat(playerid, "BBZ"), 10.0, 1);
		  		}
		  	}
		  	SetPVarString(playerid, "BBStation", inputtext );
		}
	    case d_radio + 1:
	    {
	        if(!response) return 1;
	        if( listitem == sizeof Radio - 1 ) {
	            showPlayerDialog( playerid, d_radio + 2, DIALOG_STYLE_INPUT, "Собственная радиостанция", "{ffffff}В данную графу вы должны ввести ссылку \nна онлайн поток радиостанции или любого трека.\n\
				"cBLUE"Пример: http://www.g-rp.su/station_709.m3u", "Ввод", "Назад" );
	            return true;
	        }
			foreach(new i: Player) {
				if(IsPlayerInDynamicArea(i, GetPVarInt(playerid, "BBArea"))) {
					PlayAudioStreamForPlayer(i, Radio[listitem][1], GetPVarFloat(playerid, "BBX"), GetPVarFloat(playerid, "BBY"), GetPVarFloat(playerid, "BBZ"), 10.0, 1);
		  		}
		  	}
		  	SetPVarString(playerid, "BBStation", Radio[listitem][1] );
		}

	    case d_radio:
		{
		    if(!response) return 1;
		    if ( listitem < sizeof Radio - 1 )
		    {
		        SendClientMessage(playerid,C_GRAY,""gbInfo"Чтобы отключить сообщение типа: Audio Stream: (URL). Введите команду: "cBLUE"/audiomsg");
				if(IsPlayerInAnyVehicle(playerid))
				{
					RadioVeh[GetPlayerVehicleID(playerid)] = listitem;
			        foreach(new i: Player) {
			            if(!IsPlayerConnected(i) || GetPlayerVehicleID(i) != GetPlayerVehicleID(playerid)) continue;
		     			PlayAudioStreamForPlayer(i, Radio [ listitem ] [ 1 ]);
					}
				}
				else PlayAudioStreamForPlayer(playerid, Radio [ listitem ] [ 1 ]);
			}
			else if ( listitem == sizeof Radio - 1 ) {
			    showPlayerDialog( playerid, d_radio + 3, DIALOG_STYLE_INPUT, "Собственная радиостанция", "{ffffff}В данную графу вы должны ввести ссылку \nна онлайн поток радиостанции или любого трека.\n\
				"cBLUE"Пример: http://www.g-rp.su/station_709.m3u", "Ввод", "Назад" );
			}
			else if ( listitem >= sizeof Radio )
			{
			    if(IsPlayerInAnyVehicle(playerid))
				{
				    RadioVeh[GetPlayerVehicleID(playerid)] = -1 ;
				    RadioVehStation[GetPlayerVehicleID(playerid)] = "";
				    foreach(new i: Player) {
		 				if(!IsPlayerConnected(i) || GetPlayerVehicleID(i) != GetPlayerVehicleID(playerid)) continue;
		     			StopAudioStreamForPlayer(i) ;
					}
				}
				else StopAudioStreamForPlayer(playerid) ;
		    }
		    return true ;
		}
	    case d_repair+2: {
	    	if(!response) return 1;
			new id = strval(inputtext);
  			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_repair+2,1," ","{ffffff}Введите в окошко номер своего транспорта:\n\n"cRED"| Номер транспорта может состоять только из цифр.\n| Если транспорт принадлежит не вам, покупка дубликата будет невозможна.","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_repair+2,1," ","{ffffff}Введите в окошко номер своего транспорта:\n\n"cRED"| Номер транспорта может состоять только из цифр.\n| Если транспорт принадлежит не вам, покупка дубликата будет невозможна.","Далее","Закрыть");
            new bool: cIDNone[2] = {false,...};
			
   			for(new i; i != MAX_CARS_BUY; i ++) 
   			{
			    if( !IsBuyingCar( i ) ) 
					continue;
					
		        if(Car::[i][cID] == id ) 
				{
		            if( IsOwnerCar( i, playerid ) )
		            {
		                for(new g; g != 48; g++)
						{
							if(Inv[playerid][invSlot][g] == 452 && Inv[playerid][invSlotKol] == id)
							{
								cIDNone[1] = true;
								break;
							}
						}
						
        				if(Player[playerid][uMoney] < 500) return SendClientMessage(playerid,C_GRAY,""gbError"Недостаточно денег для покупки ключей!");
						Player[playerid][uMoney] -= 500;
						mysql_format(1, string, sizeof(string),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
						mysql_tquery(1, string, "", "");
						GivePlayerItem(playerid,375,id);
						SendClientMessage(playerid,C_GRAY,""gbAccess"Вы успешно сделали дубликат ключей.");
						cIDNone[0] = true;
      					break;
					}
		        }
			}
			if(cIDNone[0] == false) return SendClientMessage(playerid,C_GRAY,""gbError"Вы указали номер не своей машины!");
	    }

		case d_daln: {
		    if(!response) return 1;
		    switch(listitem) {
		        case 0: {
					if(Player[playerid][uJob] != 3) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, вы не работаете в транспортной компании!");
		            if(D::[playerid][dDalnDuty] == false) showPlayerDialog(playerid,d_daln + 1,2,"Чем вы хотите заняться?","1. "cGRAY"Развозка ресурсов{ffffff}\n2. "cGRAY"Развозка продукции","Далее","Закрыть");
		            else {
		                D::[playerid][dDalnDuty] = false;
		                if(D::[playerid][dDalnKey] != -1) SetVehicleToRespawn(D::[playerid][dDalnKey]);
						DisablePlayerCheckpoint(playerid);
						SendClientMessage(playerid,C_GRAY,""gbAccess"Вы закончили свой рабочий день в транспортной компании!");
		            }
				}
		        case 1: {
					string = "";
					strcat(string,"{ffffff}| Работа \"Водитель в транспортной компании\"."cGRAY"\n\n");
                    strcat(string,"На данной работе Вы будете перевозить различные грузы или товары\n");
					strcat(string,"на специальной для этого технике. Вы можете развозить ресурсы по заводам,\n");
					strcat(string,"складам и бизнесам. При устройстве на данную работу, Вы подписываете контракт на 2 часа.\n");
					strcat(string,"По истичению данного контракта, Вас попросят вернуть автомобиль в транспортную компанию.\n");
					strcat(string,"В случае, если Вы откажетесь исполнять это, на Вас подадут в розыск.\n");
					strcat(string,"Так же, на данной работе присутствует стаж, в зависимости от которого, Вы получите автомобиль.\n\n");
		        	strcat(string,"{ffffff}| Для данной работы требуется:\n\n"cGRAY"");
					strcat(string,"- Водительское удостоверение.\n- Документ подтверждающий личность.\n\n");
					strcat(string,"{ffffff}| Дополнительная помощь:\n\n"cGRAY"");
					strcat(string,"Все необходимые команды, Вы можете посмотерть в основном меню, в пункте \"Работа\".");
					showPlayerDialog(playerid,9999,0,"Ознакомление с работой",string,"Закрыть","");
		        }
		        case 2: {
		            if(Player[playerid][uMember] != 0) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но вам запрещено работать на работе!");
		            if(Player[playerid][uJob] != 0) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но вы уже работаете где-то!");
                    if(Player[playerid][uLicenses][0] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"Для устройства на данную работу, вам необходимо водительское удостоверение!");
                    new bool:cuff = false;
			    	for(new i; i != 48; i++) {
						if(Inv[playerid][invSlot][i] == 452) cuff = true;
					}
					if(cuff == false) return SendClientMessage(playerid,C_GRAY,""gbError"Для устройства на данную работу, вам необходим документ подтверждающий личность!");
					Player[playerid][uJob] = 3;
		            mysql_format(1, query,sizeof(query),"UPDATE gb_users SET uJob = '%d' WHERE BINARY uName = '%s'",Player[playerid][uJob],Player[playerid][uName]);
					mysql_tquery(1, query, "", "");
		            SendClientMessage(playerid,C_GRAY,""gbAccess"Вы успешно устроились работать в транспортную компанию.");
		            MeAction(playerid,"устраивается на работу",1);
		        }
		        case 3: {
		            if(Player[playerid][uJob] != 3) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но вы не работаете в транспортной компании!");
		            if(D::[playerid][dDalnDuty] == true) return SendClientMessage(playerid,C_GRAY,""gbError"Сначала закончите рабочий день, а потом увольняйтесь.");
		            Player[playerid][uJob] = 0;
		            MeAction(playerid,"увольняется с работы",1);
		            DisablePlayerCheckpoint(playerid);
		            mysql_format(1, query,sizeof(query),"UPDATE gb_users SET uDalnNoZp = '%d',uJob = '%d' WHERE BINARY uName = '%s'",Player[playerid][uDalnNoZp],Player[playerid][uJob],Player[playerid][uName]);
					mysql_tquery(1, query, "", "");
		            SendClientMessage(playerid,C_GRAY,""gbAccess"Вы уволились с работы в транспортной компании!");
		        }
		    }
		}
		case d_daln + 1: {
		    if(!response) return 1;
			if(Player[playerid][uJobValue] <= 1) return SendClientMessage(playerid,C_GRAY,""gbError"У вас не достаточно очков работы");
			switch(listitem) {
			    case 0: {
			        new bool:flag = false;
					for(new i = dalncars[0]; i != dalncars[1]; i++) {
					    if(GetVehicleModel(i) == 403 || GetVehicleModel(i) == 514 || GetVehicleModel(i) == 515) {
							if(V::[i][vDalnDriver] == -1) {
								switch(Player[playerid][uDalnSkill]) {
								    case 0 .. 49: {
								        if(GetVehicleModel(i) == 403) {
								            D::[playerid][dDalnKey] = i;
											V::[i][vDalnDriver] = playerid;
											flag = true;
											break;
								        }
								    }
								    case 50 .. 99: {
								        if(GetVehicleModel(i) == 514) {
								            D::[playerid][dDalnKey] = i;
											V::[i][vDalnDriver] = playerid;
											flag = true;
											break;
								        }
								    }
								    case 100 .. 9999: {
								        if(GetVehicleModel(i) == 515) {
								            D::[playerid][dDalnKey] = i;
											V::[i][vDalnDriver] = playerid;
											flag = true;
											break;
								        }
								    }
								}
							}
						}
					}
					if(flag == false) return SendClientMessage(playerid,C_GRAY,""gbError"Грузовики которые подходят под Ваш стаж отсутствуют.");
					if(flag == true) {
						new Float:p[3];
						MeAction(playerid,"получил(-а) ключи от рабочего авто",1);
						GetVehiclePos(D::[playerid][dDalnKey],p[0],p[1],p[2]);
						SetPlayerCheckpoint(playerid,p[0],p[1],p[2],5.0);
						D::[playerid][dArendDaln] = 10800;
						D::[playerid][dDalnDuty] = true;
						SendClientMessage(playerid, -1, ""gbInfo"Вы получили ключи и документы от одного из рабочего транспорта, он стоит на парковке.");

					}
					
			    }
			    case 1: {
			    	new bool:flag = false,bool:count = false;
			    	for(new i; i != 20; i ++) {
					    if(Product::[i][bCount] != 0) count = true;
					}
					if(count == false) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но в данный момент заказов на продукты нет!");
					for(new i = dalncars[0]; i != dalncars[1]; i++) {
					    if(GetVehicleModel(i) == 498 || GetVehicleModel(i) == 456 || GetVehicleModel(i) == 499 || GetVehicleModel(i) == 414) {
							if(V::[i][vDalnDriver] == -1) {
								D::[playerid][dDalnKey] = i;
								V::[i][vDalnDriver] = playerid;
								flag = true;
								break;
							}
						}
					}
					if(flag == false) return SendClientMessage(playerid,C_GRAY,""gbError"У компании закончились фургоны, приходите позже.");
					if(flag == true) {
						new Float:p[3];
						MeAction(playerid,"получил(-а) ключи от рабочего авто",1);
						GetVehiclePos(D::[playerid][dDalnKey],p[0],p[1],p[2]);
						SetPlayerCheckpoint(playerid,p[0],p[1],p[2],5.0);
						D::[playerid][dArendDaln] = 10800;
						D::[playerid][dDalnDuty] = true;
						SendClientMessage(playerid, -1, ""gbInfo"Вы получили ключи и документы от одного из рабочего транспорта, он стоит на парковке.");
					}
			    }
			}
		}
		case d_daln + 2: 
		{
		    if( !response ) 
				return 1;
				
		    switch(listitem) 
			{
				case 0: 
				{
				    SetPVarInt(playerid,"SelectedToplivoMarsh",2);
				    if(GetPVarInt(playerid,"PlayerSelectedFuels") != 0) Fuel::[GetPVarInt(playerid,"PlayerSelectedFuels") - 1][bStatus] = false;
				    string = "";
					new bool:count = false;
					for(new i; i != 15; i ++) {
					    if(Fuel::[i][bCount] != 0) {
					        format(str,sizeof(str),"{ffffff}%i. "cGRAY"Кол-во - %dл. : Оплата - "cGREEN"$%d\n",i + 1,Fuel::[i][bCount],Fuel::[i][bCount]);
					        strcat(string,str);
							count = true;
					    }
					    else {
					        format(str,sizeof(str),"{ffffff}%i. "cGRAY"-\n",i + 1);
					        strcat(string,str);
					    }
					}
					if(count == false) {
					    showPlayerDialog(playerid,d_daln + 2,2,"Выбор маршрута","1. "cGRAY"Отвозить топливо по бизнесам","Далее","Закрыть");
						return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но нет заказов на развозку топлива!");
					}
					else showPlayerDialog(playerid,d_daln + 8,2,"Развозка топлива",string,"Далее","Закрыть");
				}
		    }
		}
		case d_daln + 3: {
		    if(!response) return 1;
		    switch(listitem) {
		        case 0: {
		            new name[20],marsh;
					switch(Player[playerid][uDalnSkill]) {
					    case 0 .. 50: name = "Начинающий водитель",marsh = 50;
					    case 51 .. 100: name = "Стабильный водитель",marsh = 100;
					    case 101 .. 150: name = "Опытный водитель",marsh = 150;
					}
					format(string,sizeof(string),"{ffffff}| Личная информация о стаже работы:\n\n"cGRAY"Ваши рейсы - %d/%d\nВаш стаж - %s",Player[playerid][uDalnSkill],marsh,name);
					showPlayerDialog(playerid,9999,0,"Информация о стаже работы",string,"Закрыть","");
		        }
		        case 1: {
		        	string = "";
					format(str,sizeof(str),"{ffffff}| Заводы"cGRAY"\n\n"),strcat(string,str);
					format(str,sizeof(str),"Мебельный завод: \nЗаготовок: %d ед.\nМебели: %d ед.\n\n",WoodsZavod,MebelZavod),strcat(string,str);
					format(str,sizeof(str),"Нефтеперерабатывающий завод:\nТоплива: %d л.\n\n",ToplivoZavod),strcat(string,str);
					format(str,sizeof(str),"{ffffff}| Лесопилка"cGRAY"\n\n"),strcat(string,str);
					format(str,sizeof(str),"Обработанная древесина: %d кг.\n\n",S::[0][wsWoodsSklad]),strcat(string,str);
					format(str,sizeof(str),"{ffffff}| Общий склад"cGRAY"\n\n"),strcat(string,str);
					format(str,sizeof(str),"Продуктов: %d ед.\nМебели: %d ед.",S::[0][sProducts],S::[0][sProducts] / 100 * 10),strcat(string,str);
					showPlayerDialog(playerid,9999,0,"Общая информация о материалах",string,"Закрыть","");
		        }
		    }
		}
		case d_daln + 4: {
			if(!response) return 1;
			switch(listitem) {
				case 0: {

					if(GetPVarInt(playerid,"PlayerSelectedProducts") != 0) Product::[GetPVarInt(playerid,"PlayerSelectedProducts") - 1][bStatus] = false;
					string = "";
					for(new i; i != 20; i ++) {
					    if(Product::[i][bCount] != 0) {
					        format(str,sizeof(str),"{ffffff}Заказ №%i - "cGREEN"%d$ - {ffffff}[ %s ]\n",i + 1,Product::[i][bCount],Product::[i][pStatus] ? (""cGREEN"+{ffffff}") : (""cRED"-{ffffff}"));
					        strcat(string,str);
					    }
					    else {
					        format(str,sizeof(str),"{ffffff}%i. "cGRAY"-\n",i + 1);
					        strcat(string,str);
					    }
					}
					showPlayerDialog(playerid,d_daln + 5,2,"Развозка товаров",string,"Далее","Закрыть");
				}
			}
		}
		case d_daln + 5: {
			if(!response) return 1;
			if(V::[GetPlayerVehicleID(playerid)][vProducts] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"У вас нет товаров в автомобиле!");
			if(listitem != 0)
			{
				if(Product::[listitem-1][pStatus] == true) return SendClientMessage(playerid,-1,""gbInfo"Этот заказ уже взят, возьмите другой!");
			}
			SetPVarInt(playerid,"PlayerSelectedProducts",listitem + 1);
			if(Product::[GetPVarInt(playerid,"PlayerSelectedProducts") - 1][bCount] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"В данной вкладке нет заказа!");
			format(string,sizeof(string),"{ffffff}| Информация о заказе:\n\n"cGRAY"Номер заказа - №%i\nБизнес - %s(%s)\nКол-во товаров - %d\nОплата - $%d",
			listitem + 1,Bizz::[Product::[listitem][bID]][bName],Bizz::[Product::[listitem][bID]][bOwner],Product::[listitem][bCount],Product::[listitem][bCount] * Bizz::[Product::[listitem][bID]][bSettings][5]);
			showPlayerDialog(playerid,d_daln + 6,0,"Заказ",string,"Далее","Закрыть");
		}
		case d_daln + 6: {
			if(!response) return 1;
			new id = GetPVarInt(playerid,"PlayerSelectedProducts") - 1;
			Product::[id][bStatus] = true;
			if(V::[GetPlayerVehicleID(playerid)][vProducts] != 0) {
				SendClientMessage(playerid,C_GRAY,""gbInfo"Отвезите товары к указанному бизнесу!");
				SetPVarInt(playerid,"ProductsCheckpoint",_:SetPlayerCheckpoint(playerid,Bizz::[Product::[id][bID]][bEnter][0],Bizz::[Product::[id][bID]][bEnter][1],Bizz::[Product::[id][bID]][bEnter][2],5.0));
                MeAction(playerid,"взял(-а) заказ на доставку товаров",1);
                V::[GetPlayerVehicleID(playerid)][vProductsID] = id;
                Product::[id][pStatus] = true;
			}
		}
		case d_daln + 7: {
			if(!response) return 1;
			if(!strlen(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Неверное кол-во товаров для загрузки!");
			if(strval(inputtext) > MAX_PRODUCTS_INCAR) return SendClientMessage(playerid,C_GRAY,""gbError"Неверное кол-во товаров для загрузки!");
			if(strval(inputtext) + V::[GetPlayerVehicleID(playerid)][vProducts] > MAX_PRODUCTS_INCAR) return SendClientMessage(playerid,C_GRAY,""gbError"Неверное кол-во товаров для загрузки!");
			if(strval(inputtext) < 1 || strval(inputtext) > MAX_PRODUCTS_INCAR) return SendClientMessage(playerid,C_GRAY,""gbError"Неверное кол-во товаров для загрузки!");
			if(V::[GetPlayerVehicleID(playerid)][vProducts] == 0) V::[GetPlayerVehicleID(playerid)][vProductsText] = CreateDynamic3DTextLabel(string,C_BLUE,0.0,0.0,0.0,20.0,INVALID_PLAYER_ID,GetPlayerVehicleID(playerid),1);
			V::[GetPlayerVehicleID(playerid)][vProducts] += strval(inputtext);

			format(string,sizeof(string),"Товары:\n{ffffff}%d/%d ед.",V::[GetPlayerVehicleID(playerid)][vProducts],MAX_PRODUCTS_INCAR);
			UpdateDynamic3DTextLabelText(V::[GetPlayerVehicleID(playerid)][vProductsText],C_BLUE,string);
			SendClientMessage(playerid,C_GRAY,""gbInfo"Используйте "cBLUE"/job {ffffff}чтобы посмотреть список бизнесов!");
			MeAction(playerid,"загрузил(-а) товары в прицеп",1);

			SetPVarInt(playerid, "LoadNow", 1);
		}
		case d_daln + 8: {
			if(!response) return showPlayerDialog(playerid,d_daln + 2,2,"Выбор маршрута","1. "cGRAY"Отвозить топливо по бизнесам","Далее","Закрыть");
			SetPVarInt(playerid,"PlayerSelectedFuels",listitem + 1);
			if(Fuel::[GetPVarInt(playerid,"PlayerSelectedFuels") - 1][bCount] == 0) {
			    SendClientMessage(playerid,C_GRAY,""gbError"В данной вкладке нет заказа!");
			    return showPlayerDialog(playerid,d_daln + 2,2,"Выбор маршрута","1. "cGRAY"Отвозить топливо по бизнесам","Далее","Закрыть");
			}
			format(string,sizeof(string),"{ffffff}| Информация о заказе:\n\n"cGRAY"Номер заказа - №%i\nБизнес - %s(%s)\nКол-во топлива - %d л.\nОплата - $%d",
			listitem + 1,Bizz::[Fuel::[listitem][bID]][bName],Bizz::[Fuel::[listitem][bID]][bOwner],Fuel::[listitem][bCount],Fuel::[listitem][bCount] * Bizz::[Fuel::[listitem][bID]][bSettings][5]);
			showPlayerDialog(playerid,d_daln + 9,0,"Заказ",string,"Далее","Закрыть");
		}
		case d_daln + 9: {
			if(!response) return showPlayerDialog(playerid,d_daln + 2,2,"Выбор маршрута","1. "cGRAY"Отвозить топливо по бизнесам","Далее","Закрыть");
			new id = GetPVarInt(playerid,"PlayerSelectedFuels") - 1;
			Fuel::[id][bStatus] = true;
			if(V::[PlayerTrailer[playerid]][vToplivo] != 0) {
				SendClientMessage(playerid,C_GRAY,""gbInfo"Отвезите топливо к указанной АЗС!");
				DisablePlayerCheckpoint(playerid);
				SetPVarInt(playerid,"FuelsCheckpoint",_:SetPlayerCheckpoint(playerid,Bizz::[Fuel::[id][bID]][bEnter][0],Bizz::[Fuel::[id][bID]][bEnter][1],Bizz::[Fuel::[id][bID]][bEnter][2],10.0));
                MeAction(playerid,"взял(-а) заказ на доставку топлива",1);
			}
		}
		case d_taxi: {
            if(!response) return 1;
			switch(listitem) {
				case 0: {
				    if(Player[playerid][uJobValue] <= 1) return SendClientMessage(playerid,C_GRAY,""gbError"У вас не достаточно очков работы");
					if(Player[playerid][uJob] != 1) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но вы не работаете в таксопарке!");
					if(D::[playerid][dTaxiDuty] == false) {
                        new bool:flag = false;
						for(new i = ataxils[0]; i != ataxils[1] + 1; i++) {
							if(V::[i][vTaxiDriver] == -1) {
								D::[playerid][dTaxiKey] = i;
								V::[i][vTaxiDriver] = playerid;
								flag = true;
								break;
							}
						}
						if(flag == false) return SendClientMessage(playerid,C_GRAY,""gbError"У таксопарка закончились свободные автомобили.");
						if(flag == true) {
							new Float:p[3];
							showPlayerDialog(playerid,9999,0," ","{ffffff}Вы начали свой рабочий день и подписали контракт на 2 часа.\n\nВаша машина стоит на парковке, открыть её командой:\n\n"cBLUE"/LOCK {ffffff}- Открыть авто\n"cBLUE"/JOB {ffffff}- Управление тарифом.","Закрыть","");
							GetVehiclePos(D::[playerid][dTaxiKey],p[0],p[1],p[2]);
							SetPlayerCheckpoint(playerid,p[0],p[1],p[2],5.0);
							D::[playerid][dArendTaxi] = 7200;
							D::[playerid][dTaxiDuty] = true;
							MeAction(playerid,"получил(-а) ключи от рабочего авто",1);
							SendClientMessage(playerid, -1, ""gbInfo"Вы получили ключи и документы от одного из рабочего транспорта, он стоит на парковке.");
						}
					}
					else if(D::[playerid][dTaxiDuty] == true) {
                        D::[playerid][dTaxiDuty] = false;
						SetPVarInt(playerid,"CountBackTaxi",0);
						DeletePVar(playerid,"CheckpointBack");
						if(D::[playerid][dTaxiKey] != -1) SetVehicleToRespawn(D::[playerid][dTaxiKey]);
						SendClientMessage(playerid, -1, ""gbAccess"Ваша зарплата перечислена на чековую книжку, обналичить ее можно в банке");
						showPlayerDialog(playerid,9999,0," ","{ffffff}Ваш рабочий день закончен!\n\n"cGREEN"| Ваша зарплата перечислена на чековую книжку.\n"gbError"Снять деньги с чековой книжки можно в банке","Закрыть","");
						MeAction(playerid,"закончил(-а) рабочий день и получает зарплату",1);
						DisablePlayerCheckpoint(playerid);
					}
				}
				case 1: {
					string = "";
				    strcat(string,"{ffffff}| Работа \"Водитель такси в таксопарке\".\n\n"cGRAY"");
					strcat(string,"На данной работе Вы будете отвозить пассажиров туда, куда Вас попросили.\n");
					strcat(string,"После того, как Вы начнёте рабочий день, Вы подпишите контракт на 2 часа.\n");
					strcat(string,"По истичению данного контракта, Вас попросят вернуть автомобиль в таксопарк.\n");
					strcat(string,"В случае, если Вы откажетесь исполнять это, на Вас подадут в розыск.\n\n");
					strcat(string,"{ffffff}| Для данной работы требуется:\n\n"cGRAY"");
					strcat(string,"- Водительское удостоверение.\n- Документ подтверждающий личность.\n\n");
					strcat(string,"{ffffff}| Дополнительная помощь:\n\n"cGRAY"");
					strcat(string,"Все необходимые команды, Вы можете посмотерть в основном меню, в пункте \"Работа\".");
				    showPlayerDialog(playerid,9999,0,"Ознакомление с работой",string,"Закрыть","");
				}
				case 2: {
				    if(Player[playerid][uMember] != 0) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но вам запрещено работать на работе!");
					if(Player[playerid][uJob] != 0) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но вы уже работаете где-то!");
                    if(Player[playerid][uLicenses][0] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"Для устройства на данную работу, вам необходимо водительское удостоверение!");
                    new bool:cuff = false;
			    	for(new i; i != 48; i++) {
						if(Inv[playerid][invSlot][i] == 452) cuff = true;
					}
					if(cuff == false) return SendClientMessage(playerid,C_GRAY,""gbError"Для устройства на данную работу, вам необходим документ подтверждающий личность!");
					Player[playerid][uJob] = 1;
					mysql_format(1, query,sizeof(query),"UPDATE gb_users SET uJob = '%d' WHERE BINARY uName = '%s'",Player[playerid][uJob],Player[playerid][uName]);
					mysql_tquery(1, query, "", "");
					MeAction(playerid,"устраивается на работу",1);
					SendClientMessage(playerid,C_GRAY,""gbAccess"Вы устроились на работу водителя такси в таксопарке!");
	
				}
				case 3: {
					if(Player[playerid][uJob] != 1) return SendClientMessage(playerid,C_GRAY,""gbError"Вы не работаете в таксопарке!");
					if(D::[playerid][dTaxiDuty] == true) return SendClientMessage(playerid,C_GRAY,""gbError"Сначала закончите свой рабочий день, а потом увольняйтесь.");
					Player[playerid][uJob] = 0;
    				mysql_format(1, query,sizeof(query),"UPDATE gb_users SET uJob = '%d' WHERE BINARY uName = '%s'",Player[playerid][uJob],Player[playerid][uName]);
					mysql_tquery(1, query, "", "");
					MeAction(playerid,"увольняется с работы",1);
					DisablePlayerCheckpoint(playerid);
					SendClientMessage(playerid,C_GRAY,""gbAccess"Вы уволились с работы в таксопарке!");
				}
			}
		}
		case d_taxi + 1: {
			new i = GetPlayerVehicleID(playerid);
			if(!response) return 1;
			switch(listitem) {
				case 0: {
					if(V::[i][vTaxiText] == -1) showPlayerDialog(playerid,d_taxi + 2,1,"Установка тарифа","{ffffff}Введите цену за проезд:\n\n"cGREEN"| Стоимость проезда от $3 до $10","Далее","Закрыть");
					else if(V::[i][vTaxiText] != -1) return SendClientMessage(playerid,C_GRAY,""gbError"У вас уже установлен тариф. Используйте "cBLUE"/job"cGRAY" для смены тарифа!");
				}
				case 1: if(V::[i][vTaxiText] != -1) showPlayerDialog(playerid,d_taxi + 3,1,"Смена тарифа","{ffffff}Введите цену за проезд:\n\n"cGREEN"| Стоимость проезда от $3 до $10","Далее","Закрыть");
				case 2: {
					DestroyDynamicObject(V::[i][vTaxiText]);
					V::[i][vTaxiText] = -1;
					D::[playerid][dTaxiFare] = 0;
					MeAction(playerid,"отключил(-а) тариф на своём авто",1);
					SendClientMessage(playerid,C_GRAY,""gbAccess"Вы отключили тариф на своё автомобиле.");
				}
				case 3: {
					SendClientMessage(playerid,C_GRAY,""gbAccess"Вы закончили свой рабочий день, верните автомобиль таксопарку!");
					SetPVarInt(playerid,"CountBackTaxi",MAX_COUNT_BACK_TAXI);
					SetPVarInt(playerid,"CheckpointBack",_:SetPlayerCheckpoint(playerid,1099.9902,-1242.7791,15.3823,5.0));
					MeAction(playerid,"закончил(-а) рабочий день",1);
				}
			}
		}
		case d_taxi + 2: {
            if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_taxi + 2,1,"Установка тарифа","{ffffff}Введите цену за проезд:\n\n"cGREEN"| Стоимость проезда от $3 до $10","Далее","Закрыть");
			if(strval(inputtext) < 3 || strval(inputtext) > 10) return showPlayerDialog(playerid,d_taxi + 2,1,"Установка тарифа","{ffffff}Введите цену за проезд:\n\n"cGREEN"| Стоимость проезда от $3 до $10","Далее","Закрыть");
            new i = GetPlayerVehicleID(playerid);
			D::[playerid][dTaxiFare] = strval(inputtext);
			format(string,sizeof(string),"Тариф: $%d",D::[playerid][dTaxiFare]);
			switch(GetVehicleModel(GetPlayerVehicleID(playerid))) {
				case 420: {
				    V::[i][vTaxiText] = CreateDynamicObject(19477,0.0, 0.0, -10.0, -50.0, 0, 0, 0);
					AttachDynamicObjectToVehicle(V::[i][vTaxiText], GetPlayerVehicleID(playerid), -0.7, 0.94, 0.33, -0.5, -54, 91);
					SetDynamicObjectMaterialText(V::[i][vTaxiText],0,string,OBJECT_MATERIAL_SIZE_256x128,"Arial",14, 1, 0xFFFFFFFF, 0, 0);
				}
				case 438: {
				    V::[i][vTaxiText] = CreateDynamicObject(19477,0.0, 0.0, -10.0, -50.0, 0, 0, 0);
				    AttachDynamicObjectToVehicle(V::[i][vTaxiText], GetPlayerVehicleID(playerid), -1.1, 1.35, -0.02, 0, -24, 90);
				    SetDynamicObjectMaterialText(V::[i][vTaxiText],0,string,OBJECT_MATERIAL_SIZE_256x128,"Arial",14, 1, 0xFFFFFFFF, 0, 0);
				}
			}
			MeAction(playerid,"установил(-а) тариф на проезд",1);
			return 1;
		}
		case d_taxi + 3: {
			if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_taxi + 3,1,"Установка тарифа","{ffffff}Введите цену за проезд:\n\n"cGREEN"| Стоимость проезда от $3 до $10","Далее","Закрыть");
			if(strval(inputtext) < 3 || strval(inputtext) > 10) return showPlayerDialog(playerid,d_taxi + 3,1,"Установка тарифа","{ffffff}Введите цену за проезд:\n\n"cGREEN"| Стоимость проезда от $3 до $10","Далее","Закрыть");
			new i = GetPlayerVehicleID(playerid);
			D::[playerid][dTaxiFare] = strval(inputtext);
			format(string,sizeof(string),"Тариф: $%d",D::[playerid][dTaxiFare]);
			SetDynamicObjectMaterialText(V::[i][vTaxiText],0,string,OBJECT_MATERIAL_SIZE_256x128,"Arial",14, 1, 0xFFFFFFFF, 0, 0);
			MeAction(playerid,"изменил(-а) тариф на проезд",1);
			return 1;
		}		
		case d_woods: {
		    if(!response) return 1;
		    switch(listitem) {
		        case 0: {
		            if(Player[playerid][uJob] >= 1) return SendClientMessage(playerid,C_GRAY,""gbError"Вы уже работаете кем-то!");
		            if(Player[playerid][uJobValue] <= 1) return SendClientMessage(playerid,C_GRAY,""gbError"У вас не достаточно очков работы");
		            if(D::[playerid][dWoodsDuty] != 0) return SendClientMessage(playerid,C_GRAY,""gbError"Вы уже работаете на лесопилке либо в цеху.");
		            D::[playerid][dWoodsDuty] = 1;
		          
		            SendClientMessage(playerid,C_GRAY,""gbInfo"Возьмите необходимую для работы одежду в раздевалке!");
		            MeAction(playerid,"устраивается на работу",1);
				}
				case 1: {
        			if(Player[playerid][uJobValue] <= 1) return SendClientMessage(playerid,C_GRAY,""gbError"У вас не достаточно очков работы");
				    if(D::[playerid][dWoodsDuty] != 0) return SendClientMessage(playerid,C_GRAY,""gbError"Вы уже работаете на лесоповале либо в цеху.");
				    D::[playerid][dWoodsDuty] = 2;
				    
				    SendClientMessage(playerid,C_GRAY,""gbInfo"Возьмите необходимую для работы одежду в раздевалке!");
				    MeAction(playerid,"устраивается на работу",1);
				}
				case 2: {
				    if(D::[playerid][dWoodsDuty] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"Вы не работаете на лесповале либо в цеху.");
                    SendClientMessage(playerid, -1, ""gbAccess"Ваша зарплата перечислена на чековую книжку, обналичить ее можно в банке");
				    showPlayerDialog(playerid, 9999, 0, " ", "{ffffff}Вы уволились с работы!\n\n"cGREEN"| Ваша зарплата перечислена на чековую книжку.\n"gbError"Снять деньги с чековой книжки можно в банке", "Закрыть", "");
					D::[playerid][dWoodsDuty] = 0;
					DeletePVar(playerid,"PlayerUseBox");
					DeletePVar(playerid,"PlayerStanok");
				    GetBackSkin(playerid);
				    RemovePlayerAttachedObject(playerid,9);
				    SetPlayerSpecialAction(playerid, SPECIAL_ACTION_NONE);
				    MeAction(playerid,"увольняется с работы",1);
				}
				case 3: {
					string = "";
					strcat(string,"{ffffff}| Работа \"Лесопилка\"."cGRAY"\n\n");
					strcat(string,"Работать на лесопилке Вы можете в двух вариантах, это: Работать в Цеху или на Лесоповале.\n");
					strcat(string,"Ваша работа зависит от того, какой раздел вы выбрали, но зарплата ни чем не отличается.\n");
					strcat(string,"Работая на Лесоповале, Вы будете пилить деревья. В то время, как работая в цеху, Вы будете\n");
					strcat(string,"делать заготовки для завода мебели.\n\n");
				    strcat(string,"{ffffff}| Для данной работы требуется:\n\n"cGRAY"");
					strcat(string,"- Водительское удостоверение.\n- Документ подтверждающий личность.\n\n");
					strcat(string,"{ffffff}| Дополнительная помощь:\n\n"cGRAY"");
					strcat(string,"Все необходимые команды, Вы можете посмотерть в основном меню, в пункте \"Работа\".");
				    showPlayerDialog(playerid, 9999, 0, " ", string, "Закрыть", "");
				}
		    }
		}
		case d_woods + 1: {
		    if(!response) return 1;
		    switch(listitem) {
		        case 0: {
		        	string = "";
		            format(str,sizeof(str),"{ffffff}| Информация о лесопилке:"cGRAY"\n\n"),strcat(string,str);
		            format(str,sizeof(str),"Древесины - %d кг.\n",S::[0][wsWoods]),strcat(string,str);
		            format(str,sizeof(str),"Обработанной древесины - %d кг.\n",S::[0][wsWoodsSklad]),strcat(string,str);
		            showPlayerDialog(playerid, 9999, 0, "Информация о лесопилке", string, "Закрыть", "");
		        }
		        case 1: {
		            new one,two;
		            string = "";
					strcat(string, "{ffffff}| Список работников лесоповала:\n\n"cGRAY"");
					foreach(new i : Player) {
					    if(D::[i][dWoodsDuty] == 1) {
             				format(str,sizeof(str),"%s,",Player[i][uName]);
					        if(one != 8) {
								one ++;
								strcat(string,str);
							}
					        else {
					            one = 0;
					            strcat(string,str);
					            strcat(string,"\n");
					        }
					    }
					}
					strcat(string, "\n\n{ffffff}| Список работников в цеху:\n\n"cGRAY"");
					foreach(new i : Player) {
					    if(D::[i][dWoodsDuty] == 2) {
             				format(str,sizeof(str),"%s,",Player[i][uName]);
					        if(two != 8) {
								two ++;
								strcat(string,str);
							}
					        else {
					            two = 0;
					            strcat(string,str);
					            strcat(string,"\n");
					        }
					    }
					}
					strcat(string,"\n\n");
			        showPlayerDialog(playerid, 9999, 0, "Список рабочих лесопилки", string, "Закрыть", "");
		        }
		    }
		}
		case d_menu: {
		    if(!response) return 1;
		    switch(listitem) {
				case 0: {
					if(Player[playerid][uSettings][0] == 0) {
						Player[playerid][uSettings][0] = 1;
						if(GetPlayerVehicleSeat(playerid) == 0) {
							for(new i; i != 3; i++) TextDrawShowForPlayer(playerid, SpeedFon[i]);
							for(new i; i != 8; i++) PlayerTextDrawShow(playerid,Speed[i][playerid]);
							UpdateFuelBar(playerid,GetPlayerVehicleID(playerid));
						}
					}
					else if(Player[playerid][uSettings][0] == 1) {
						Player[playerid][uSettings][0] = 0;
						if(GetPlayerVehicleSeat(playerid) == 0) {
							for(new i; i != 3; i++) TextDrawHideForPlayer(playerid, SpeedFon[i]);
							for(new i; i != 8; i++) PlayerTextDrawHide(playerid,Speed[i][playerid]);
						}
					}
				}
				case 1: {
				    if(Player[playerid][uSettings][2] == 0) {
						Player[playerid][uSettings][2] = 1;
						Hunger(playerid,0);
					}
					else {
						Player[playerid][uSettings][2] = 0;
						Hunger(playerid,1);
					}
				}
				case 2: {
					if(Player[playerid][uSettings][3] == 0) {
						Player[playerid][uSettings][3] = 1;
						foreach(new i : Player) ShowPlayerNameTagForPlayer(playerid,i,false);
					}
					else {
						Player[playerid][uSettings][3] = 0;
						foreach(new i : Player) ShowPlayerNameTagForPlayer(playerid,i,true);
					}
				}
				case 3: {
					if(Player[playerid][uSettings][5] == 0) Player[playerid][uSettings][5] = 1;
					else Player[playerid][uSettings][5] = 0;
				}
				case 4: showPlayerDialog(playerid, d_menu + 1, 2, " ", "{ffffff}1. "cGRAY"Стандартный спавн\n{ffffff}2. "cGRAY"Фракция\n{ffffff}3. "cGRAY"Дом\n{ffffff}4. "cGRAY"Там где вышел", "Далее", "Закрыть");
				case 5: showPlayerDialog(playerid, d_menu + 2, 2, " ", "{ffffff}1. "cGRAY"Стандартная\n{ffffff}2. "cGRAY"Походка 1\n{ffffff}2. "cGRAY"Походка 2\n{ffffff}3. "cGRAY"Походка 3\n{ffffff}4. "cGRAY"Походка 4\n{ffffff}5. "cGRAY"Походка 5\n{ffffff}6. "cGRAY"Походка 6\n{ffffff}7. "cGRAY"Походка 7\n{ffffff}8. "cGRAY"Походка 8\n{ffffff}9. "cGRAY"Походка 9\n{ffffff}10. "cGRAY"Походка 10\n{ffffff}11. "cGRAY"Походка 11", "Далее", "Закрыть");
				case 6: showPlayerDialog(playerid, d_menu + 3, 2, " ", "{ffffff}1. "cGRAY"Стандартный\n{ffffff}2. "cGRAY"Стиль 1\n{ffffff}3. "cGRAY"Стиль 2\n{ffffff}4. "cGRAY"Стиль 3\n{ffffff}5. "cGRAY"Стиль 4\n{ffffff}6. "cGRAY"Стиль 5\n{ffffff}7. "cGRAY"Стиль 6\n"cGRAY"— Нет", "Далее", "Закрыть");
				case 7: showPlayerDialog(playerid, d_menu + 5, 2, " ", "{ffffff}1. "cGRAY"Стандартный\n{ffffff}2. "cGRAY"Бокс\n{ffffff}3. "cGRAY"Кунг-Фу\n{ffffff}4. "cGRAY"Кик-Бокс", "Далее", "Закрыть");
				case 8:
				{
					switch(Player[playerid][uOOC])
					{
					    case 0:
					    {
					        Player[playerid][uOOC] = 1;
					        format(query,sizeof(query),"UPDATE gb_users SET uOOC = '1' WHERE BINARY uName = '%s'",Player[playerid][uName]);
							mysql_tquery(1, query, "", "");
					    }
					    case 1:
					    {
					        Player[playerid][uOOC] = 0;
					        format(query,sizeof(query),"UPDATE gb_users SET uOOC = '0' WHERE BINARY uName = '%s'",Player[playerid][uName]);
							mysql_tquery(1, query, "", "");
					    }
					}
				    //	Player[playerid][uOOC] ? (""cGREEN"Вкл") : (""cRED"Выкл"),
					//	Player[playerid][uRO] ? (""cGREEN"Вкл") : (""cRED"Выкл"),
					//	Player[playerid][uPM] ? (""cGREEN"Вкл") : (""cRED"Выкл"));
				}
				case 9:
				{
				    switch(Player[playerid][uRO])
					{
					    case 0:
					    {
					        Player[playerid][uRO] = 1;
					        format(query,sizeof(query),"UPDATE gb_users SET uRO = '1' WHERE BINARY uName = '%s'",Player[playerid][uName]);
							mysql_tquery(1, query, "", "");
					    }
					    case 1:
					    {
					        Player[playerid][uRO] = 0;
					        format(query,sizeof(query),"UPDATE gb_users SET uRO = '0' WHERE BINARY uName = '%s'",Player[playerid][uName]);
							mysql_tquery(1, query, "", "");
					    }
					}
				}
				case 10:
				{
				    switch(Player[playerid][uPM])
					{
					    case 0:
					    {
					        Player[playerid][uPM] = 1;
					        format(query,sizeof(query),"UPDATE gb_users SET uPM = '1' WHERE BINARY uName = '%s'",Player[playerid][uName]);
							mysql_tquery(1, query, "", "");
					    }
					    case 1:
					    {
					        Player[playerid][uPM] = 0;
					        format(query,sizeof(query),"UPDATE gb_users SET uPM = '0' WHERE BINARY uName = '%s'",Player[playerid][uName]);
							mysql_tquery(1, query, "", "");
					    }
					}
				}
				case 11:
				{
				    switch(Player[playerid][uShowJobValue])
					{
					    case 0:
					    {
					        Player[playerid][uShowJobValue] = 1;
					        format(query,sizeof(query),"UPDATE gb_users SET uShowJobValue = '1' WHERE BINARY uName = '%s'",Player[playerid][uName]);
							mysql_tquery(1, query, "", "");
					    }
					    case 1:
					    {
					        Player[playerid][uShowJobValue] = 0;
					        format(query,sizeof(query),"UPDATE gb_users SET uShowJobValue = '0' WHERE BINARY uName = '%s'",Player[playerid][uName]);
							mysql_tquery(1, query, "", "");
					    }
					}
					JobValueTextDraw(playerid,Player[playerid][uShowJobValue]);
				}
				case 12:
				{
	    			switch(Player[playerid][uSettings][8])
					{
					    case 0:
					    {
					        new bool:selecttrue;
							for(new i; i != 48; i++)
							{
								if(Inv[playerid][invSlot][i] == 495) selecttrue = true;
							}
							if(selecttrue == false) return SendClientMessage(playerid,C_GRAY,""gbInfo"У вас нет рации! Купить её можно в магазине электроники!");
					        Player[playerid][uSettings][8] = 1;
					        format(string,sizeof(string),"CHANNEL:     %d~n~SLOT:        %d", Player[playerid][uRadioChanel], Player[playerid][uRadioSubChanel]);
							PlayerTextDrawSetString(playerid,RadioShow[1][playerid],string);
							PlayerTextDrawShow(playerid, RadioShow[1][playerid]);
							PlayerTextDrawShow(playerid, RadioShow[0][playerid]);
					    }
					    case 1:
					    {
					        Player[playerid][uSettings][8] = 0;
					        PlayerTextDrawHide(playerid, RadioShow[0][playerid]);
					        PlayerTextDrawHide(playerid, RadioShow[1][playerid]);
					    }
					}
				}
				case 13:
				{
				    if(Player[playerid][uEther] == 1) 
					{
						Player[playerid][uEther] = 0;
						SendClientMessage(playerid,C_GRAY,""gbAccess"Вы выключили показ эфира.");
						format(query,sizeof(query),"UPDATE gb_users SET uEther = '0' WHERE BINARY uName = '%s'",Player[playerid][uName]);
						mysql_tquery(1, query, "", "");
					}
					else if(Player[playerid][uEther] == 0) {
						Player[playerid][uEther] = 1;
						SendClientMessage(playerid,C_GRAY,""gbAccess"Вы включили показ эфира.");
						format(query,sizeof(query),"UPDATE gb_users SET uEther = '1' WHERE BINARY uName = '%s'",Player[playerid][uName]);
						mysql_tquery(1, query, "", "");
					}
				}
				case 14:
				{
				    showPlayerDialog(playerid, d_menu + 15, DIALOG_STYLE_LIST, " ", "{ffffff}1. "cGRAY"Установка кода безопасности\n{ffffff}2. "cGRAY"Отключить код безопасности", "Далее", "Отмена");
				}

			}
			
		    format(gb_string,sizeof(gb_string),"%d|%d|%d|%d|%d|%d|%d|%d|%d",Player[playerid][uSettings][0],Player[playerid][uSettings][1],Player[playerid][uSettings][2],
				Player[playerid][uSettings][3],Player[playerid][uSettings][4],Player[playerid][uSettings][5],Player[playerid][uSettings][6],Player[playerid][uSettings][7], Player[playerid][uSettings][8]);
			format(query,sizeof(query),"UPDATE gb_users SET uSettings = '%s' WHERE BINARY uName = '%s'", 
				gb_string, Player[playerid][uName] );
			mysql_tquery( mysql, query );
			//showSettings(playerid);
		}
		case d_menu + 15:
		{
		    if(!response) return true;
		    switch(listitem)
		    {
		        case 0: showPlayerDialog(playerid, d_menu + 16, DIALOG_STYLE_INPUT, " ", "{B4B5B7}Укажите шестизначный числовой пароль:", "Далее", "Отмена");
		        case 1:
		        {
		            if(Player[playerid][uPinCode] == 0) return SendClientMessage(playerid, -1, ""gbError"У Вас не активирована двухфакторная аутентификация!");
		            Player[playerid][uPinCode] = 0;
		            nowUpdateInfo(playerid , "d" , "gb_users" , "uName" , "uPinCode" , Player[playerid][uPinCode]);
		            SendClientMessage(playerid, -1, ""gbAccess"Вы отключили двухфакторную аутентификацию. Настоятельно рекомендуем Вам снова включить её!");
		        }
		    }
		}
        case d_menu + 16:
        {
            if(!response) return true;
            new code;
            if(sscanf(inputtext, "d", code)) return showPlayerDialog(playerid, d_menu + 16, DIALOG_STYLE_INPUT, " ", "{B4B5B7}Укажите шестизначный числовой пароль:", "Далее", "Отмена");
            if(strlen(inputtext) != 6) return showPlayerDialog(playerid, d_menu + 16, DIALOG_STYLE_INPUT, " ", "{B4B5B7}Укажите шестизначный числовой пароль:", "Далее", "Отмена");
            if(code < 0) return showPlayerDialog(playerid, d_menu + 16, DIALOG_STYLE_INPUT, " ", "{B4B5B7}Укажите шестизначный числовой пароль:", "Далее", "Отмена");
			new bool: status = true;
			for(new i = 0, j = strlen(inputtext); i < j; i++)
			{
			    if( inputtext[ i ] == '0' )
			    {
                    status = false;
					break;
			    }
			}
			if(status == false) return showPlayerDialog(playerid, d_menu + 16, DIALOG_STYLE_INPUT, " ", "{B4B5B7}Укажите шестизначный числовой пароль:", "Далее", "Отмена");
			nowUpdateInfo(playerid , "d" , "gb_users" , "uName" , "uPinCode" , strval(inputtext));
            SendClientMessage(playerid, -1, ""gbAccess"При каждой авторизации Вы будете вводить два пароля!");
        }
		case d_menu + 5: {
		    if(!response) return 1;
		    switch(listitem)
			{
			    case 0:
				{
					Player[playerid][uChangeStyle] = 0;
					format(query,sizeof(query),"UPDATE gb_users SET ChangeStyle = '0' WHERE BINARY uName = '%s'",Player[playerid][uName]);
					mysql_tquery(1, query, "", "");
					SendClientMessage(playerid, -1, ""gbAccess"Вы выбрали стиль боя: "cBLUE"Стандартный");
				}
				case 1:
				{
					if(Player[playerid][uStyle][0] >= 200)
					{
						Player[playerid][uChangeStyle] = 1;
						format(query,sizeof(query),"UPDATE gb_users SET ChangeStyle = '1' WHERE BINARY uName = '%s'",Player[playerid][uName]);
						mysql_tquery(1, query, "", "");
						SendClientMessage(playerid, -1, ""gbAccess"Вы выбрали стиль боя: "cBLUE"Бокс");
					}
					else SendClientMessage(playerid, -1, ""gbError"Данный стиль боя не изучен.");
				}
				case 2:
				{
					if(Player[playerid][uStyle][1] >= 200)
					{
						Player[playerid][uChangeStyle] = 2;
						format(query,sizeof(query),"UPDATE gb_users SET ChangeStyle = '2' WHERE BINARY uName = '%s'",Player[playerid][uName]);
						mysql_tquery(1, query, "", "");
						SendClientMessage(playerid, -1, ""gbAccess"Вы выбрали стиль боя: "cBLUE"Кунг-Фу");
					}
					else SendClientMessage(playerid, -1, ""gbError"Данный стиль боя не изучен.");
				}
				case 3:
				{
				    if(Player[playerid][uStyle][4] >= 200)
					{
						Player[playerid][uChangeStyle] = 3;
						format(query,sizeof(query),"UPDATE gb_users SET ChangeStyle = '3' WHERE BINARY uName = '%s'",Player[playerid][uName]);
						mysql_tquery(1, query, "", "");
						SendClientMessage(playerid, -1, ""gbAccess"Вы выбрали стиль боя: "cBLUE"Кик-бокс");
					}
				    else SendClientMessage(playerid, -1, ""gbError"Данный стиль боя не изучен.");
				}
			}
			SetPlayerFightingStyleEx(playerid);
		}
		case d_menu + 1: {
		    if(!response) return 1;
      		switch(listitem) {
		        case 0, 1:
				{
		            if(listitem == 1 && !Player[playerid][uMember] ) return SendMes( playerid, C_GRAY, ""gbError"Вы не состоите в организации!" );
					Player[playerid][uSettings][1] = listitem;
		        }
		        case 2: {
					if( !Player[playerid][uHouse] ) return SendMes( playerid, -1, ""gbError"У вас нет дома!" );
					Player[playerid][uSettings][1] = 2;
				}
				case 3: Player[playerid][uSettings][1] = 4;
			}
			SendMes(playerid,C_GRAY,""gbAccess"Вы выбрали новое место спавна вашего персонажа!");
			format( gb_string,sizeof gb_string,"%d|%d|%d|%d|%d|%d|%d|%d|%d",Player[playerid][uSettings][0],Player[playerid][uSettings][1],Player[playerid][uSettings][2],
				Player[playerid][uSettings][3],Player[playerid][uSettings][4],Player[playerid][uSettings][5],Player[playerid][uSettings][6],Player[playerid][uSettings][7], Player[playerid][uSettings][8]);
			format(query,sizeof query ,"UPDATE gb_users SET uSettings = '%s' WHERE BINARY uName = '%s'",
				gb_string,Player[playerid][uName]);
			mysql_tquery( mysql, query );
			showSettings(playerid);
		}
		case d_menu + 10:
		{
		    if(!response) return true;
		    SendMes( playerid, -1, "Не дописал =(((" );
		}
		case d_menu + 2:
		{
		    if(!response) return 1;
		    Player[playerid][uSettings][6] = listitem;
		    SendClientMessage(playerid,C_GRAY,""gbInfo"Вы сменили свой стиль походки.");
		    format(gb_string,sizeof(gb_string),"%d|%d|%d|%d|%d|%d|%d|%d|%d",Player[playerid][uSettings][0],Player[playerid][uSettings][1],Player[playerid][uSettings][2],
		    Player[playerid][uSettings][3],Player[playerid][uSettings][4],Player[playerid][uSettings][5],Player[playerid][uSettings][6],Player[playerid][uSettings][7], Player[playerid][uSettings][8]);
		    format(query,sizeof(query),"UPDATE gb_users SET uSettings = '%s' WHERE BINARY uName = '%s'",
				gb_string, Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
			showSettings(playerid);
		}
		case d_menu + 3: {
		    if(!response) return 1;
		    Player[playerid][uSettings][7] = listitem;
		    SendClientMessage(playerid,C_GRAY,""gbInfo"Вы сменили свой стиль разговора.");
		    format(gb_string,sizeof(gb_string),"%d|%d|%d|%d|%d|%d|%d|%d|%d",Player[playerid][uSettings][0],Player[playerid][uSettings][1],Player[playerid][uSettings][2],
		    Player[playerid][uSettings][3],Player[playerid][uSettings][4],Player[playerid][uSettings][5],Player[playerid][uSettings][6],Player[playerid][uSettings][7], Player[playerid][uSettings][8]);
		    format(query,sizeof(query),"UPDATE gb_users SET uSettings = '%s' WHERE BINARY uName = '%s'",
				gb_string,Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
			showSettings(playerid);
		}
		case d_phone: {
		    if(!response) return 1;
		    switch(listitem)
			{
		    	case 0: showPlayerDialog(playerid,d_phone + 5,1," ","{ffffff}Введите номер телефона на который хотите позвонить:\n\n"cRED"| Номер должен состоять только из цифр.\n| Владелец номера должен быть в штате.","Далее","Закрыть");
		    	case 1: showPlayerDialog(playerid,d_phone + 1,2,"Набрать номер","1. "cGRAY"Набрать номер такси{ffffff}\n2. "cGRAY"Звонок в 911","Далее","Закрыть");
		        //case 1: showPlayerDialog(playerid,d_phone + 1,2,"Набрать номер","1. "cGRAY"Набрать номер такси{ffffff}\n2. "cGRAY"Позвонить в полицию\n3. "cGRAY"Вызвать службу спасения","Далее","Закрыть");
		        case 2:	showPlayerDialog(playerid,9999,2,"Телефонная книга",""cBLUE"777 {ffffff}- SAN","Далее","Закрыть");
		    }
		}
		case d_phone + 1:
		{
		    if(!response) return 1;
			switch(listitem)
			{
			    case 0:
				{
			        new Float:p[3],rtext[20],bool:flag = false;
					new car = GetPlayerVehicleID(playerid);
					if(IsPlayerInAnyVehicle(playerid))
					{
						if(car >= ataxils[0] && car <= ataxils[1]) return SendClientMessage(playerid,C_GRAY,""gbError"Вы уже находитесь в автомобиле такси.");
					}
					else
					{
						GetPlayerPos(playerid,p[0],p[1],p[2]);
            			if(p[0] > -1080 && p[1] < 490) rtext = "Лос Сантос";
            			else if(p[0] > -1080 && p[1] > 490) rtext = "Лас Вентурас";
            			else if(p[0] < -1080) rtext = "Сан Фиерро";
            			for(new i; i != GetMaxPlayers() + 1; i ++) if(D::[i][dTaxiDuty] == true) { flag = true; break; }
            			if(flag == true)
						{
							SendClientMessage(playerid,C_GRAY,""gbInfo"Ваш вызов в обработке, ожидайте ответа.");
							foreach(new i : Player)
							{
				    			if(D::[i][dTaxiDuty] == true)
								{
									format(string,sizeof(string),"Диспетчер: Поступил вызов с города %s, кто возьмёт? ",rtext);
									SendClientMessage(i,0xFFFF99AA,string);
								}
							}
							taxicall = playerid;
							MeAction(playerid,"вызвал(-а) такси",1);
            			}
            			else if(flag == false) return SendClientMessage(playerid,C_GRAY,""gbError"Сейчас нет доступных водителей такси.");
					}
			    }
			    case 1:
			    {
			        showPlayerDialog(playerid,d_phone + 12,1," ","{ffffff}Диспетчер: Вы позвонили в службу 911 города Лос Сантос. Опишите ситуацию:","Далее","Закрыть");
			    }
				

			}
		}
		case d_phone + 2:
		{
			if(!response) return 1;
			SetPVarInt(playerid,"playerSelectedPhoneSlot",listitem);
			if(Player[playerid][uContacts][listitem] == 0) showPlayerDialog(playerid,d_phone + 3,1," ","{ffffff}Введите номер телефона, который хотите добавить:\n\n"cRED"| Номер должен состоять только из цифр.\n| Владелец номера должен быть в штате.","Далее","Закрыть");
			else {
				showPlayerDialog(playerid,d_phone + 4,2," ","1. "cGRAY"Позвонить на этот номер{ffffff}\n2. "cGRAY"Отправить СМС на этот номер{ffffff}\n3. "cGRAY"Попросить перезвонить{ffffff}\n4. "cGRAY"Удалить номер","Далее","Закрыть");
			}
		}
		case d_phone + 3: {
			if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_phone + 3,1," ","{ffffff}Введите номер телефона, который хотите добавить:\n\n"cRED"| Номер должен состоять только из цифр.\n| Владелец номера должен быть в штате.","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_phone + 3,1," ","{ffffff}Введите номер телефона, который хотите добавить:\n\n"cRED"| Номер должен состоять только из цифр.\n| Владелец номера должен быть в штате.","Далее","Закрыть");
			if(Player[playerid][uNumber] == strval(inputtext)) return showPlayerDialog(playerid,d_phone + 3,1," ","{ffffff}Введите номер телефона, который хотите добавить:\n\n"cRED"| Номер должен состоять только из цифр.\n| Владелец номера должен быть в штате.","Далее","Закрыть");
			foreach(new i : Player) {
				if(GetPVarInt(i,"uLogin") == 0) continue;
				if(Player[i][uNumber] == strval(inputtext)) {
					new id = GetPVarInt(playerid,"playerSelectedPhoneSlot");
					Player[playerid][uContacts][id] = strval(inputtext);
					strmid(phoneName[playerid][id], Player[i][uName], 0, strlen(Player[i][uName]), MAX_PLAYER_NAME);
					SendClientMessage(playerid,C_GRAY,""gbAccess"Вы добавили новый контакт в список контактов!");
					format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d|%d|%d",Player[playerid][uContacts][0],Player[playerid][uContacts][1],Player[playerid][uContacts][2],Player[playerid][uContacts][3],Player[playerid][uContacts][4],
					Player[playerid][uContacts][5],Player[playerid][uContacts][6],Player[playerid][uContacts][7],Player[playerid][uContacts][8],Player[playerid][uContacts][9]);
					format(query,sizeof(query),"UPDATE gb_users SET uContacts = '%s' WHERE BINARY uName = '%s'",string,Player[playerid][uName]);
					mysql_tquery(1, query, "", "");
					format(query,sizeof(query),"UPDATE gb_users SET uPhoneName%d = '%s' WHERE BINARY uName = '%s'",id + 1,phoneName[playerid][id],Player[playerid][uName]);
					mysql_tquery(1, query, "", "");
					break;
				}
			}
		}
		case d_phone + 4:
		{
			if(!response) return 1;
			new id = GetPVarInt(playerid,"playerSelectedPhoneSlot");
			switch(listitem)
			{
				case 0:
				{
					if(D::[playerid][dPhone] == true) return SendClientMessage(playerid,C_GRAY,""gbError"Вы уже говорите с кем-то по телефону!");
					foreach(new i : Player)
					{
						if(GetPVarInt(i,"uLogin") == 0) continue;
						if(Player[i][uNumber] == Player[playerid][uContacts][id])
						{
							if(Inv[i][invSlot][55] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"У данного человека нет мобильного телефона!");
							SetPVarInt(playerid,"phoneCaller",playerid);
							SetPVarInt(playerid,"phoneCalled",i);
							SetPVarInt(i,"phoneCaller",playerid);
							SetPVarInt(i,"phoneCalled",i);
							SendClientMessage(playerid,C_GRAY,""gbInfo"Вы начали звонить. Чтобы сбросить вызов, используйте - "cBLUE"N"cWHITE"." );
							D::[playerid][dPhone] = true;
							MeAction(i,"звонит мобильный телефон",1);
							format(string,sizeof(string),""gbAccess"У Вас звонит мобильный телефон, вызывает: "cBLUE"%d{ffffff}.",Player[playerid][uNumber]);
							SendClientMessage(i,C_GRAY,string);
								
							MeAction(i,"звонит мобильный телефон",1);
							
							
							SendMes( i, -1, ""gbInfo"Для принятия вызова, используйте - "cBLUE"Y"cWHITE", для отклонения - "cBLUE"N"cWHITE".");
							PhoneStatus(playerid,true);
							MeAction(playerid,"набирает кому-то по телефону",1);
							break;
						}
					}
				}
				case 1:
				{
					SetPVarString(playerid,"phoneSMSName",phoneName[playerid][id]);
					SetPVarInt(playerid,"phoneSMSUser",Player[playerid][uContacts][id]);
					showPlayerDialog(playerid,d_phone + 11,1," ","{ffffff}Введите текст СМС сообщения:\n\n"cRED"| Текст должен состоять только из букв и цифр.\n| Длинна текста не должна привышать 120 символов","Далее","Закрыть");
				}
				case 3:
				{
					Player[playerid][uContacts][id] = 0;
					strmid(phoneName[playerid][id], "Нет", 0, strlen("Нет"), MAX_PLAYER_NAME);
					SendClientMessage(playerid,C_GRAY,""gbAccess"Вы удалили контакт из списка контактов!");
					format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d|%d|%d",Player[playerid][uContacts][0],Player[playerid][uContacts][1],Player[playerid][uContacts][2],Player[playerid][uContacts][3],Player[playerid][uContacts][4],
					Player[playerid][uContacts][5],Player[playerid][uContacts][6],Player[playerid][uContacts][7],Player[playerid][uContacts][8],Player[playerid][uContacts][9]);
					format(query,sizeof(query),"UPDATE gb_users SET uContacts = '%s' WHERE BINARY uName = '%s'",string,Player[playerid][uName]);
					mysql_tquery(1, query, "", "");
					format(query,sizeof(query),"UPDATE gb_users SET uPhoneName%d = '%s' WHERE BINARY uName = '%s'",id + 1,phoneName[playerid][id],Player[playerid][uName]);
					mysql_tquery(1, query, "", "");
				}
			}
		}
		case d_phone + 5: {
			if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_phone + 5,1," ","{ffffff}Введите номер телефона на который хотите позвонить:\n\n"cRED"| Номер должен состоять только из цифр.\n| Владелец номера должен быть в штате.","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_phone + 5,1," ","{ffffff}Введите номер телефона на который хотите позвонить:\n\n"cRED"| Номер должен состоять только из цифр.\n| Владелец номера должен быть в штате.","Далее","Закрыть");
			if(strval(inputtext) == Player[playerid][uNumber]) return showPlayerDialog(playerid,d_phone + 5,1," ","{ffffff}Введите номер телефона на который хотите позвонить:\n\n"cRED"| Номер должен состоять только из цифр.\n| Владелец номера должен быть в штате.","Далее","Закрыть");
			if(D::[playerid][dPhone] == true) return SendClientMessage(playerid,C_GRAY,""gbError"Вы уже говорите с кем-то по телефону!");
			switch(strval(inputtext)) {
				case 777: {
					if(newsCalling == false) return SendClientMessage(playerid,C_GRAY,""gbError"Звонки в эфир в данный момент не принимаются!");
					if(newsClientEther != INVALID_PLAYER_ID) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но уже кто-то сидит в эфире!");
					if(random(3)) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но у вас не получилось дозвониться в эфир!");
					SendClientMessage(playerid,C_GRAY,""gbAccess"Вы дозвонились и теперь вы в эфире. (( "cBLUE"N - положить трубку {ffffff}))");
					SendClientMessage(newsLeaderEther,C_GRAY,""gbInfo"Кто-то дозвонился в ваш эфир.");
					newsClientEther = playerid;
					D::[playerid][dPhone] = true;
					PhoneStatus(playerid,true);
				}
				default: {
					foreach(new i : Player) {
						if(GetPVarInt(i,"uLogin") == 0) continue;
						if(Player[i][uNumber] == strval(inputtext)) {
							if(Inv[i][invSlot][55] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"У данного человека нет мобильного телефона!");
							SetPVarInt(playerid,"phoneCaller",playerid);
							SetPVarInt(playerid,"phoneCalled",i);
							SetPVarInt(i,"phoneCaller",playerid);
							SetPVarInt(i,"phoneCalled",i);
							D::[playerid][dPhone] = true;
							SendClientMessage(playerid,C_GRAY,""gbInfo"Вы начали звонить. Чтобы сбросить вызов, используйте - "cBLUE"N"cWHITE"." );
							MeAction(i,"звонит мобильный телефон",1);
							
							format(string,sizeof(string),""gbAccess"У Вас звонит мобильный телефон, вызывает: "cBLUE"%d{ffffff}.",Player[playerid][uNumber]);
							SendClientMessage(i,C_GRAY,string);
							
							SendMes( i, -1, ""gbInfo"Для принятия вызова, используйте - "cBLUE"Y"cWHITE", для отклонения - "cBLUE"N"cWHITE".");
							
							PhoneStatus(playerid,true);
							MeAction(playerid,"набирает кому-то по телефону",1);
							break;
						}
					}
				}
			}
		}
		case d_phone + 6: {
			if(!response) return 1;
			switch(listitem) {
				case 0: {
					format(query,sizeof(query),"SELECT mRead,mText,mNumber,mName FROM gb_messages WHERE mNumberTo = '%d' LIMIT 10",Player[playerid][uNumber]);
					mysql_tquery(1, query, "MySQLQuery", "dd", playerid, 13);
				}
				case 1: {
					format(query,sizeof(query),"SELECT mRead,mText,mNumberTo,mNameTo FROM gb_messages WHERE mNumber = '%d' AND mRead = '0' LIMIT 10",Player[playerid][uNumber]);
					mysql_tquery(1, query, "MySQLQuery", "dd", playerid, 14);
				}
				case 2: showPlayerDialog(playerid,d_phone + 10,1," ","{ffffff}Введите номер телефона на который вы хотите отправить сообщение:\n\n"cRED"| Номер должен состоять только из цифр.","Далее","Закрыть");
			}
		}
		case d_phone + 8: {
			if(!response) return 1;
			format(query,sizeof(query),"SELECT * FROM gb_messages WHERE mNumberTo = '%d' LIMIT 10",Player[playerid][uNumber]);
			mysql_tquery(1, query, "PhoneMessageOne", "dd", playerid, listitem);
		}
		case d_phone + 9: {
			if(!response) return 1;
			new id = GetPVarInt(playerid,"phoneSelectMessage");
			switch(listitem) {
				case 0: {
					format(query,sizeof(query),"SELECT mDate,mRead,mText,mNumber,mName FROM gb_messages WHERE mID = '%d' LIMIT 1",id);
                    mysql_tquery(1, query, "MySQLQuery", "dd", playerid, 16);
				}
				case 1: {
					format(query,sizeof(query),"DELETE FROM gb_messages WHERE mID = %d",id);
					mysql_tquery(1, query, "", "");
					SendClientMessage(playerid,C_GRAY,""gbAccess"Вы успешно удалили одно из сообщений!");
					DeletePVar(playerid,"phoneSelectMessage");
				}
			}
		}
		case d_phone + 10: {
			if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_phone + 10,1," ","{ffffff}Введите номер телефона на который вы хотите отправить сообщение:\n\n"cRED"| Номер должен состоять только из цифр.","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_phone + 10,1," ","{ffffff}Введите номер телефона на который вы хотите отправить сообщение:\n\n"cRED"| Номер должен состоять только из цифр.","Далее","Закрыть");
			if(Player[playerid][uNumber] == strval(inputtext)) return showPlayerDialog(playerid,d_phone + 10,1," ","{ffffff}Введите номер телефона на который вы хотите отправить сообщение:\n\n"cRED"| Номер должен состоять только из цифр.","Далее","Закрыть");
			switch(strval(inputtext)) {
				case 777: {
					if(newsLeaderEther == INVALID_PLAYER_ID) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но в данный момент студия не принимает СМС!");
					if(EtherStatus == false) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но в данный момент студия не принимает СМС!");
					if(newsEtherSMS == false) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но в данный момент студия не принимает СМС!");
					showPlayerDialog(playerid,d_phone + 15,1," ","{ffffff}Введите текст СМС сообщения:\n\n"cRED"| Текст должен состоять только из букв и цифр.\n| Длинна текста не должна привышать 120 символов","Далее","Закрыть");
				}
				default: {
					format(query,sizeof(query),"SELECT uName FROM gb_users WHERE uNumber = '%d' LIMIT 1", strval(inputtext));
					//mysql_tquery(1, query, "", "");
                    mysql_tquery(1, query, "MySQLSMS", "ds", playerid, inputtext);
				}
			}
		}
		case d_phone + 11: {
			if(!response) return 1;
			new id = GetPVarInt(playerid,"phoneSMSUser");
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_phone + 11,1," ","{ffffff}Введите текст СМС сообщения:\n\n"cRED"| Текст должен состоять только из букв и цифр.\n| Длинна текста не должна привышать 120 символов","Далее","Закрыть");
			if(NonSym(inputtext,120,1)) return showPlayerDialog(playerid,d_phone + 11,1," ","{ffffff}Введите текст СМС сообщения:\n\n"cRED"| Текст должен состоять только из букв и цифр.\n| Длинна текста не должна привышать 120 символов","Далее","Закрыть");
			new Nick[MAX_PLAYER_NAME];
			GetPVarString(playerid,"phoneSMSName",Nick,MAX_PLAYER_NAME);
			format(query,sizeof(query),"INSERT INTO gb_messages (mNumberTo,mNumber,mText,mNameTo,mName) VALUES (%d,%d,'%s','%s','%s')",id,Player[playerid][uNumber],inputtext,Nick,Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы успешно отправили СМС сообщение!");
			foreach(new i : Player) {
				if(GetPVarInt(i,"uLogin") == 0) continue;
				if(Player[i][uNumber] == id && Inv[i][invSlot][55] != 0) {
					SendClientMessage(i,C_GRAY,""gbAccess"Вам пришло новое сообщение на ваш мобильный!");
					MeAction(i,"вибрирует мобильный телефон",1);
					break;
				}
			}
		}
		case d_phone + 12:
		{	
			if(!response) 
				return 1;
			
			if( !strlen( inputtext ) ) 
				return showPlayerDialog( playerid,d_phone + 12,1," ","{ffffff}Диспетчер: Вы позвонили в службу 911 города Лос Сантос. Опишите ситуацию:","Далее","Закрыть");
			
			if( NonSym( inputtext, 50, 1 ) ) 
				return showPlayerDialog(playerid,d_phone + 12,1," ","{ffffff}Диспетчер: Вы позвонили в службу 911 города Лос Сантос. Опишите ситуацию:","Далее","Закрыть");
           
		    format:gb_string( "позвонил% в 911", Player[playerid][uSex] == 2 ? ("а") : ("") );
			MeAction( playerid, gb_string,1 );
			
			new 
				zone[ 32 ];

			GetPlayer2DZone( playerid, zone, sizeof zone );
			SendMes( playerid, -1, ""gbInfo"Ваш вызов находится в обработке, подождите." );
			
			SendMessageToEmergency( playerid, inputtext, zone );
			
			new Float: pPosition[3], curenstring[25], curenstring2[30];
			GetPlayerPos(playerid, pPosition[0], pPosition[1], pPosition[2]);
			for(new i = 0; i != MAX_CALLS; i++)
			{
			    if(CallInfo[i][cStatus] == false)
			    {
			        curenstring = "";
			        format(curenstring, sizeof(curenstring), "%s", Player[playerid][uName]);
			        strmid(CallInfo[i][cName], curenstring, 0, strlen(curenstring), MAX_PLAYER_NAME);
			        CallInfo[i][cX] = pPosition[0];
			        CallInfo[i][cY] = pPosition[1];
			        CallInfo[i][cZ] = pPosition[2];
			        CallInfo[i][cStatus] = true;
			        curenstring2 = "";
			        format(curenstring2, sizeof(curenstring2), "%s", zone);
			        strmid(CallInfo[i][cZone], curenstring2, 0, strlen( zone ), 30);
			        
			        break;
			    }
			}
		}
		case d_phone + 13: {
			if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_phone + 13,1," ","{ffffff}Укажите причину вызова службы спасения:\n"cRED"| Длина причины не может быть меньше 1 и не более 50 символов.","Далее","Закрыть");
			if(NonSym(inputtext,50,1)) return showPlayerDialog(playerid,d_phone + 13,1," ","{ffffff}Укажите причину вызова службы спасения:\n"cRED"| Длина причины не может быть меньше 1 и не более 50 символов.","Далее","Закрыть");
			new Float:p[3],rtext[20];
			if(!IsPlayerInAnyVehicle(playerid)) GetPlayerPos(playerid,p[0],p[1],p[2]);
			else GetVehiclePos(GetPlayerVehicleID(playerid),p[0],p[1],p[2]);
			if(p[0] > -1080 && p[1] < 490) rtext = "Лос Сантос";
            else if(p[0] > -1080 && p[1] > 490) rtext = "Лас Вентурас";
            else if(p[0] < -1080) rtext = "Сан Фиерро";

			MeAction(playerid,"вызвал(-а) службу спасения",1);
			new bool: cuff = false;
            for(new i = 10; i < 20; i ++)
			{
			    if(CallInfoList[i][cStatus]) continue;
			    CallInfoList[i][cPlayerID] = playerid;
			    CallInfoList[i][cStatus] = true;
			    cuff = true;
			    break;
			}
			if(cuff == false) return SendClientMessage(playerid,C_GRAY,""gbError"На данный момент больница не может принять вызов!");
			else
			{
			    foreach(new i : Player) {
					if(Player[i][uMember] == 5) {
						if(Player[i][uIsPlayerJob][2] == 1) {
							format(string,sizeof(string),"Диспетчер: Вызов из %s, причина вызова: %s.",rtext,inputtext);
							SendClientMessage(i,0xFFFF99AA,string);
						}
					}
				}
				SendClientMessage(playerid,C_GRAY,""gbAccess"Ваш вызов успешно принят, ожидайте!");
			}
			//medicalcall = playerid;
		}
		case d_phone + 14: {
			if(!response) return 1;
			switch(listitem) {
				case 0: {
					if(Player[playerid][uSettings][4] == 1) {
						Player[playerid][uSettings][4] = 0;
						SendClientMessage(playerid,C_GRAY,""gbAccess"Вы выключили показ объявлений в своём телефоне!");
					}
					else if(Player[playerid][uSettings][4] == 0) {
						Player[playerid][uSettings][4] = 1;
						SendClientMessage(playerid,C_GRAY,""gbAccess"Вы включили показ объявлений в своём телефоне!");
					}
				}
				case 1:
				{
				    if(Player[playerid][uRadio] == 1) {
						Player[playerid][uRadio] = 0;
						SendClientMessage(playerid,C_GRAY,""gbAccess"Вы выключили радио.");
						format(query,sizeof(query),"UPDATE gb_users SET uRadio = '0' WHERE BINARY uName = '%s'",Player[playerid][uName]);
						mysql_tquery(1, query, "", "");
					}
					else if(Player[playerid][uRadio] == 0) {
						Player[playerid][uRadio] = 1;
						SendClientMessage(playerid,C_GRAY,""gbAccess"Вы включили радио.");
						format(query,sizeof(query),"UPDATE gb_users SET uRadio = '1' WHERE BINARY uName = '%s'",Player[playerid][uName]);
						mysql_tquery(1, query, "", "");
					}
				}
			}
			format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d",Player[playerid][uSettings][0],Player[playerid][uSettings][1],Player[playerid][uSettings][2],
		    Player[playerid][uSettings][3],Player[playerid][uSettings][4],Player[playerid][uSettings][5],Player[playerid][uSettings][6],Player[playerid][uSettings][7]);
		    format(query,sizeof(query),"UPDATE gb_users SET uSettings = '%s' WHERE BINARY uName = '%s'",string,Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
		}
		case d_phone + 15: {
			if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_phone + 11,1," ","{ffffff}Введите текст СМС сообщения:\n\n"cRED"| Текст должен состоять только из букв и цифр.\n| Длинна текста не должна привышать 120 символов","Далее","Закрыть");
			format(string,sizeof(string),"[ SMS ] От %s ( %d ): %s",Player[playerid][uName],Player[playerid][uNumber],inputtext);
			foreach(new i : Player) {
				if(newsLeaderEther == i) SendClientMessage(i,FracColor[4],string);
			}
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы отправили СМС на номер студии SAN.");
		}
		case d_makeleader:
		{
			if(!response) return 1;
			new id = GetPVarInt(playerid, "MakeLeader");
			DeletePVar(playerid, "MakeLeader");
   			if(!strcmp(F::[listitem][fLeader], "None", true))
	    	{
				Player[id][uLeader] = listitem;
				Player[id][uMember] = listitem;
				Player[id][uRank] = 1;
				Player[id][uJob] = 0;
	    		format(string,sizeof(string),"UPDATE gb_users SET uLeader = '%d',uMember = '%d',uRank = '%d',uJob = '%d' WHERE BINARY uName = '%s'",
	    		Player[id][uLeader],Player[id][uMember],Player[id][uRank],Player[id][uJob],Player[id][uName]);
	    		mysql_tquery(1, string, "", "");
	    		//----------------------------------------
	    		strmid(F::[listitem][fLeader], Player[id][uName], 0, strlen(Player[id][uName]), MAX_PLAYER_NAME);
	    		format(string,sizeof(string),"UPDATE gb_frac SET fLeader = '%s' WHERE fID = '%d'", F::[listitem][fLeader], F::[listitem][fID]);
	    		mysql_tquery(1, string, "", "");
	    		format(string, sizeof(string), ""gbInfo"Вы успешно назначили %s на лидерство %s фракции", Player[id][uName], F::[listitem][fName]);
	    		SendClientMessage(playerid, -1, string);
	    		format(string, sizeof(string), ""gbAccess"Поздравляем! Вы были назначены на пост лидера - %s", F::[listitem][fName]);
	    		SendClientMessage(id, -1, string);
			}
			else
			{
			    new present, status;
    			present = INVALID_PLAYER_ID;
			    sscanf(F::[listitem][fLeader], "u", present);
			    if(IsPlayerConnected(present)) status = 1;
			    else status = 0;
			    if(status == 1) SetPVarInt(playerid, "MakeLeaderNone", present);
			    SetPVarInt(playerid, "makeleaderstatus", status);
			    SetPVarInt(playerid, "makeleaderselect", listitem);

			    format(string, sizeof(string), ""gbError"На данной лидерке есть лидер - %s\n"gbInfo"Status: %s\n\nВы уверены, что хотите снять лидера ?", F::[listitem][fLeader], status ? (""cGREEN"ONLINE") : (""cRED"OFFLINE"));
				showPlayerDialog(playerid, d_makeleader + 1,0," ",string,"Снять","Закрыть");
			}
		}
		case d_makeleader + 1: {
		    if(!response) return 1;
		    new id = GetPVarInt(playerid, "MakeLeaderNone");
		    new i = GetPVarInt(playerid, "makeleaderselect");
		    new status = GetPVarInt(playerid, "makeleaderstatus");

		    DeletePVar(playerid, "makeleaderstatus");
			DeletePVar(playerid, "MakeLeaderNone");
			DeletePVar(playerid, "makeleaderselect");

			switch(status)
			{
			    case 0:
			    {
			        format(string,sizeof(string),"UPDATE gb_users SET uLeader = '0',uMember = '0',uRank = '0',uJob = '0' WHERE BINARY uName = '%s'", F::[i][fLeader]);
		    		mysql_tquery(1, string, "", "");
		    		//----------------------------------------
		    		strmid(F::[i][fLeader], "None", 0, strlen("None"), MAX_PLAYER_NAME);
		    		format(string,sizeof(string),"UPDATE gb_frac SET fLeader = 'None' WHERE fID = '%d'",F::[i][fID]);
		    		mysql_tquery(1, string, "", "");
		    		SendClientMessage(playerid, -1, ""gbAccess"Вы успешно сняли лидера с фракции");
			    }
			    case 1:
			    {
			        if(id == INVALID_PLAYER_ID) return 1;
			        Player[id][uLeader] = 0;
					Player[id][uMember] = 0;
					Player[id][uRank] = 1;
					Player[id][uJob] = 0;
		    		format(string,sizeof(string),"UPDATE gb_users SET uLeader = '%d',uMember = '%d',uRank = '%d',uJob = '%d' WHERE BINARY uName = '%s'",
		    		Player[id][uLeader],Player[id][uMember],Player[id][uRank],Player[id][uJob],Player[id][uName]);
		    		mysql_tquery(1, string, "", "");
		    		//----------------------------------------------------------
		    		strmid(F::[i][fLeader], "None", 0, strlen("None"), MAX_PLAYER_NAME);
		    		format(string,sizeof(string),"UPDATE gb_frac SET fLeader = 'None' WHERE fID = '%d'",F::[i][fID]);
		    		mysql_tquery(1, string, "", "");
		    		SendClientMessage(playerid, -1, ""gbAccess"Вы успешно сняли лидера с фракции!");
		    		SendClientMessage(id, -1, ""gbError"Вы были сняты с поста лидера фракции!");
			    }
			}
		}
		case d_amoniment: {
		    if(!response) return 1;
		    switch(Bizz::[GetPVarInt(playerid, "PlayerBizzID")][bID])
		    {
		        case 87:
		        {
		            switch(listitem)
		            {
		                case 0:
						{
						    new cost = Bizz::[86][bSettings][5] * 200;
		                    if(Bizz::[86][bSettings][3] < 200)
							{
							    if(Bizz::[86][bRating] > 0) Bizz::[86][bRating]--;
							    SetBizzInt(86,"bRate", Bizz::[86][bRating]);
								return SendClientMessage(playerid,C_GRAY,""gbError"В бизнесе закончились товары!");

							}

                            if(Player[playerid][uMoney] < Bizz::[86][bSettings][5] * 200) return SendClientMessage(playerid,-1,""gbError"У вас недостаточно денег для покупки абонемента!");
                            Player[playerid][uMoney] -= Bizz::[86][bSettings][5] * 200;

							GivePlayerItem(playerid, 489, 1);
							MeAction(playerid,"купил(-а) абонемент",1);
							if(Bizz::[86][bRating] < 5000) Bizz::[86][bRating]++;
							SetBizzInt(86,"bRate", Bizz::[86][bRating]);
							format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
							mysql_tquery(1, query, "", "");
							SendClientMessage(playerid, -1, ""gbAccess"Вы приобрели абонемент");
							SendClientMessage(playerid, -1, ""gbAccess"Чтобы заниматься в спортзале, активируйте абонемент через свой инвентарь.");
							Bizz::[86][bSettings][3] -= 200;
							Bizz::[86][bSettings][6] += cost;

							format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[86][bSettings][0],Bizz::[86][bSettings][1],Bizz::[86][bSettings][2],
							Bizz::[86][bSettings][3],Bizz::[86][bSettings][4],Bizz::[86][bSettings][5],Bizz::[86][bSettings][6],Bizz::[86][bSettings][7]);
							SetBizzStr(Bizz::[86][bID],"bSettings",string);
						}
						case 1:
		                {
							new cost = Bizz::[86][bSettings][5] * 1400;
		                    if(Bizz::[86][bSettings][3] < 1400)
							{
							    if(Bizz::[86][bRating] > 0) Bizz::[86][bRating]--;
							    SetBizzInt(86,"bRate", Bizz::[86][bRating]);
								return SendClientMessage(playerid,C_GRAY,""gbError"В бизнесе закончились товары!");
							}

                            if(Player[playerid][uMoney] < Bizz::[86][bSettings][5] * 1400) return SendClientMessage(playerid,-1,""gbError"У вас недостаточно денег для покупки абонемента!");
                            Player[playerid][uMoney] -= Bizz::[86][bSettings][5] * 1400;
							GivePlayerItem(playerid, 491, 1);
							MeAction(playerid,"купил(-а) абонемент",1);
							if(Bizz::[86][bRating] < 5000) Bizz::[86][bRating]++;
							SetBizzInt(86,"bRate", Bizz::[86][bRating]);
							format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
							mysql_tquery(1, query, "", "");
							SendClientMessage(playerid, -1, ""gbAccess"Вы приобрели абонемент");
							SendClientMessage(playerid, -1, ""gbAccess"Чтобы заниматься в спортзале, активируйте абонемент через свой инвентарь.");

							Bizz::[86][bSettings][3] -= 1400;
							Bizz::[86][bSettings][6] += cost;

							format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[86][bSettings][0],Bizz::[86][bSettings][1],Bizz::[86][bSettings][2],
							Bizz::[86][bSettings][3],Bizz::[86][bSettings][4],Bizz::[86][bSettings][5],Bizz::[86][bSettings][6],Bizz::[86][bSettings][7]);
							SetBizzStr(Bizz::[86][bID],"bSettings",string);
		                }
		            }

				}
		        case 88:
		        {
		            switch(listitem)
		            {
		                case 0:
						{
						    new cost = Bizz::[87][bSettings][5] * 200;
		                    if(Bizz::[87][bSettings][3] < 200)
							{
							    if(Bizz::[87][bRating] > 0) Bizz::[87][bRating]--;
							    SetBizzInt(87,"bRate", Bizz::[87][bRating]);
								return SendClientMessage(playerid,C_GRAY,""gbError"В бизнесе закончились товары!");
							}
                            if(Player[playerid][uMoney] < Bizz::[87][bSettings][5] * 200) return SendClientMessage(playerid,-1,""gbError"У вас недостаточно денег для покупки абонемента!");
                            Player[playerid][uMoney] -= Bizz::[87][bSettings][5] * 200;
							GivePlayerItem(playerid, 490, 1);
							MeAction(playerid,"купил(-а) абонемент",1);
							if(Bizz::[87][bRating] < 5000) Bizz::[87][bRating]++;
							SetBizzInt(87,"bRate", Bizz::[87][bRating]);
							format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
							mysql_tquery(1, query, "", "");
							SendClientMessage(playerid, -1, ""gbAccess"Вы приобрели абонемент");
							SendClientMessage(playerid, -1, ""gbAccess"Чтобы заниматься в спортзале, активируйте абонемент через свой инвентарь.");
							Bizz::[87][bSettings][3] -= 200;
							Bizz::[87][bSettings][6] += cost;

							format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[87][bSettings][0],Bizz::[87][bSettings][1],Bizz::[87][bSettings][2],
							Bizz::[87][bSettings][3],Bizz::[87][bSettings][4],Bizz::[87][bSettings][5],Bizz::[87][bSettings][6],Bizz::[87][bSettings][7]);
							SetBizzStr(Bizz::[87][bID],"bSettings",string);
						}
						case 1:
		                {
		                    new cost = Bizz::[87][bSettings][5] * 1400;
		                    if(Bizz::[87][bSettings][3] < 1400)
							{
							    if(Bizz::[87][bRating] > 0) Bizz::[87][bRating]--;
							    SetBizzInt(87,"bRate", Bizz::[87][bRating]);
								return SendClientMessage(playerid,C_GRAY,""gbError"В бизнесе закончились товары!");
							}

                            if(Player[playerid][uMoney] < Bizz::[87][bSettings][5] * 1400) return SendClientMessage(playerid,-1,""gbError"У вас недостаточно денег для покупки абонемента!");
                            Player[playerid][uMoney] -= Bizz::[87][bSettings][5] * 1400;
							GivePlayerItem(playerid, 492, 7);
							MeAction(playerid,"купил(-а) абонемент",1);
							if(Bizz::[87][bRating] < 5000) Bizz::[87][bRating]++;
							SetBizzInt(87,"bRate", Bizz::[87][bRating]);
							format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
							mysql_tquery(1, query, "", "");
							SendClientMessage(playerid, -1, ""gbAccess"Вы приобрели абонемент");
							SendClientMessage(playerid, -1, ""gbAccess"Чтобы заниматься в спортзале, активируйте абонемент через свой инвентарь.");
							Bizz::[87][bSettings][3] -= 1400;
							Bizz::[87][bSettings][6] += cost;

							format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[87][bSettings][0],Bizz::[87][bSettings][1],Bizz::[87][bSettings][2],
							Bizz::[87][bSettings][3],Bizz::[87][bSettings][4],Bizz::[87][bSettings][5],Bizz::[87][bSettings][6],Bizz::[87][bSettings][7]);
							SetBizzStr(Bizz::[87][bID],"bSettings",string);
		                }
		            }
		        }
		        case 89:
		        {
		            switch(listitem)
		            {
		                case 0:
						{
						    new cost = Bizz::[88][bSettings][5] * 200;
		                    if(Bizz::[88][bSettings][3] < 200)
							{
							    if(Bizz::[88][bRating] > 0) Bizz::[88][bRating]--;
							    SetBizzInt(88,"bRate", Bizz::[88][bRating]);
								return SendClientMessage(playerid,C_GRAY,""gbError"В бизнесе закончились товары!");
							}

                            if(Player[playerid][uMoney] < Bizz::[88][bSettings][5] * 200) return SendClientMessage(playerid,-1,""gbError"У вас недостаточно денег для покупки абонемента!");
                            Player[playerid][uMoney] -= Bizz::[88][bSettings][5] * 200;
							GivePlayerItem(playerid, 493, 1);
							MeAction(playerid,"купил(-а) абонемент",1);
							if(Bizz::[88][bRating] < 5000) Bizz::[88][bRating]++;
							SetBizzInt(88,"bRate", Bizz::[88][bRating]);
							format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
							mysql_tquery(1, query, "", "");
							SendClientMessage(playerid, -1, ""gbAccess"Вы приобрели абонемент");
							SendClientMessage(playerid, -1, ""gbAccess"Чтобы заниматься в спортзале, активируйте абонемент через свой инвентарь.");
							Bizz::[88][bSettings][3] -= 200;
							Bizz::[88][bSettings][6] += cost;

							format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[88][bSettings][0],Bizz::[88][bSettings][1],Bizz::[88][bSettings][2],
							Bizz::[88][bSettings][3],Bizz::[88][bSettings][4],Bizz::[88][bSettings][5],Bizz::[88][bSettings][6],Bizz::[88][bSettings][7]);
							SetBizzStr(Bizz::[88][bID],"bSettings",string);
						}
						case 1:
		                {
		                    new cost = Bizz::[88][bSettings][5] * 1400;
		                    if(Bizz::[88][bSettings][3] < 1400)
							{
							    if(Bizz::[88][bRating] > 0) Bizz::[88][bRating]--;
							    SetBizzInt(88,"bRate", Bizz::[88][bRating]);
								return SendClientMessage(playerid,C_GRAY,""gbError"В бизнесе закончились товары!");
							}

                            if(Player[playerid][uMoney] < Bizz::[88][bSettings][5] * 1400) return SendClientMessage(playerid,-1,""gbError"У вас недостаточно денег для покупки абонемента!");
                            Player[playerid][uMoney] -= Bizz::[88][bSettings][5] * 1400;
							GivePlayerItem(playerid, 494, 7);
							MeAction(playerid,"купил(-а) абонемент",1);
							if(Bizz::[88][bRating] < 5000) Bizz::[88][bRating]++;
							SetBizzInt(88,"bRate", Bizz::[88][bRating]);
							format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
							mysql_tquery(1, query, "", "");
							SendClientMessage(playerid, -1, ""gbAccess"Вы приобрели абонемент");
							SendClientMessage(playerid, -1, ""gbAccess"Чтобы заниматься в спортзале, активируйте абонемент через свой инвентарь.");
							Bizz::[88][bSettings][3] -= 1400;
							Bizz::[88][bSettings][6] += cost;

							format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[88][bSettings][0],Bizz::[88][bSettings][1],Bizz::[88][bSettings][2],
							Bizz::[88][bSettings][3],Bizz::[88][bSettings][4],Bizz::[88][bSettings][5],Bizz::[88][bSettings][6],Bizz::[88][bSettings][7]);
							SetBizzStr(Bizz::[88][bID],"bSettings",string);
		                }
		            }
		        }
		    }
		}
	
		//showPlayerDialog(playerid,d_weapon,2," ","1. "cGRAY"M4{ffffff}\n2. "cGRAY"Desert Eagle{ffffff}\n3. "cGRAY"AK-47{ffffff}\n4. "cGRAY"MP5{ffffff}","Далее","Закрыть");
		case d_a_menu: {
		    if(!response) return 1;
		    switch(listitem) {
		        case 0: showMenu( playerid );
		        case 1: showInventory(playerid);
		        case 2: 
				{
		        	if( GetPVarInt(playerid,"playerCuffed") || Player[playerid][uDeath] ) 
						return SendClientMessage( playerid, C_WHITE, ""gbError"Вы не можете достать мобильный телефон." );
				
					showPhone(playerid);
		        }
		        case 3: CallLocalFunction( "cmd_gps", "i", playerid );
		        case 4: CallLocalFunction( "cmd_myharki", "i", playerid );
				case 5: CallLocalFunction( "cmd_favanim", "i", playerid );
		    }
		}
		case d_a_menu + 1: 
		{
		    if( !response ) 
				return 1;
				
		    if( IsMute( playerid, TYPE_OOC ) ) 
				return SendClientMessage( playerid, C_GRAY, !PLAYER_MUTED );
				
		    if( inputtext[0] == EOS ) 
				return showPlayerDialog( playerid, d_a_menu + 1, 1, "Связь с администрацией",
					""gbInfo"Введите запрос администрации или операторам поддержки:\n\n\
					"cRED"| Если Вы указываете жалобу, не забудьте указать ID игрока на которого жалуетесь.\n\
					"cRED"| Запрос не должен содержать в себе оффтоп.",
					"Далее", "Закрыть"
				);
		    
			if( NonSym( inputtext, 120, 1 ) )
				return showPlayerDialog( playerid, d_a_menu + 1, 1, "Связь с администрацией",
					""gbInfo"Введите запрос администрации или операторам поддержки:\n\n\
					"cRED"| Если Вы указываете жалобу, не забудьте указать ID игрока на которого жалуетесь.\n\
					"cRED"| Запрос не должен содержать в себе оффтоп.",
					"Далее", "Закрыть"
				);
				
			cmd_report( playerid, inputtext );
		}
		case d_amoniment + 4: {
		    if(!response) return 1;
		    string = "";
		    switch(listitem) {

		        case 0:
				{
                    format(string, sizeof(string), "Название\tДень\tСтоимость абонемента\n{ffffff}Кик-бокс\t1\t%d\nКик-бокс\t7\t%d", Bizz::[88][bSettings][5] * 200, Bizz::[88][bSettings][5] * 1400);
                    if(Player[playerid][uStyleDate][2] < getdate()) showPlayerDialog(playerid,d_amoniment,5,"Покупка абонемента",string,"Далее","Закрыть");
                    else SendClientMessage(playerid, -1, ""gbError"У вас уже есть абонемент от данного спортзала!");
				}
				case 1: {
					strcat(string,"{ffffff}В данном спортзале изучают стиль боя, как "cBLUE"Кикбоксинг.\n");
					strcat(string,"Кикбоксинг{FFFFFF} — спортивное единоборство, зародившееся в 1960-х годах.\n");
					strcat(string,"В широком смысле слова под кикбоксингом иногда понимают различные ударные единоборства,\n");
					strcat(string,"правилами которых разрешены удары руками и ногами с использованием в экипировке боксёрских перчаток.\n");
					showPlayerDialog(playerid,9999,0," ",string,"Закрыть","");
		        }
		        case 2: {
          			strcat(string,"{ffffff}Всё очень просто, для начала тебе надо улучшить свои характеристики выносливости и силы,\n");
			  		strcat(string,"сделать это можно на специальных тренажёрах, которые стоят в спортзале. И запомни,\n");
			  		strcat(string,"чтобы более лучше изучить "cBLUE"Кикбокс{ffffff}, нужна хорошая сила и выносливость.\n");
					strcat(string,"После тебе нужно отрабатывать удары на груше.\n\n");
					strcat(string,"И не забывай, что после того как ты изучишь стиль боя, тебе нужно будет регулярно посещать зал для поддержания\n");
					strcat(string,"спортивной формы, иначе врятли ты сможешь использовать данный стиль боя в бою.\n");

                    strcat(string,"* (( Для изучения и использования Кикбокса, Вам надо 850 силы и 800 выносливости. ))\n");
					showPlayerDialog(playerid,9999,0," ",string,"Закрыть","");
		        }
			}
		}
		case d_amoniment + 5: {
		    if(!response) return 1;
		    string = "";
		    switch(listitem) {

		        case 0:
				{
                    format(string, sizeof(string), "Название\tДень\tСтоимость абонемента\n{ffffff}Бокс\t1\t%d\nБокс\t7\t%d", Bizz::[86][bSettings][5] * 200, Bizz::[86][bSettings][5] * 1400);
					if(Player[playerid][uStyleDate][0] < getdate()) showPlayerDialog(playerid,d_amoniment,5,"Покупка абонемента",string,"Далее","Закрыть");
					else SendClientMessage(playerid, -1, ""gbError"У вас уже есть абонемент от данного спортзала!");
				}
				case 1: {
    				strcat(string,"{ffffff}В данном спортзале изучают стиль боя, как "cBLUE"Бокс.\n");
					strcat(string,"Бокс{FFFFFF} — контактный вид спорта, единоборство, в котором спортсмены наносят друг другу\n");
					strcat(string,"удары кулаками в специальных перчатках.\n");
					showPlayerDialog(playerid,9999,0," ",string,"Закрыть","");
		        }
		        case 2: {
        	 		strcat(string,"{ffffff}Всё очень просто, для начала тебе надо улучшить свои характеристики выносливости и силы,\n");
					strcat(string,"cделать это можно на специальных тренажёрах, которые стоят в спортзале.\n");
					strcat(string,"И запомни, чтобы более лучше изучить "cBLUE"Бокс{ffffff}, нужна хорошая сила.\n");
					strcat(string,"После тебе нужно отрабатывать удары на груше.\n\n");
					strcat(string,"И не забывай, что после того как ты изучишь стиль боя, тебе нужно будет регулярно посещать зал\n");
					strcat(string,"для поддержания спортивной формы, иначе врятли ты сможешь использовать данный стиль боя в бою.\n");
					strcat(string,"* (( Для изучения и использования Бокса, Вам надо 900 силы и 750 выносливости. ))\n");
					showPlayerDialog(playerid,9999,0," ",string,"Закрыть","");
		        }
			}
		}
		case d_amoniment + 2: {
		    if(!response) return 1;
		    string = "";
		    switch(listitem) {

		        case 0:
				{
                    format(string, sizeof(string), "Название\tДень\tСтоимость абонемента\n{ffffff}Кунг-Фу\t1\t%d\nКунг-Фу\t7\t%d", Bizz::[87][bSettings][5] * 200, Bizz::[87][bSettings][5] * 1400);
                    if(Player[playerid][uStyleDate][1] < getdate()) showPlayerDialog(playerid,d_amoniment,5,"Покупка абонемента",string,"Далее","Закрыть");
                    else SendClientMessage(playerid, -1, ""gbError"У Вас уже есть абонемент от данного спортзала!");
				}
				case 1: {
		            strcat(string,"{ffffff}В данном спортзале изучают стиль боя, как "cBLUE"Кунг-Фу.\n");
					strcat(string,"Кунг-Фу{ffffff} - способствует развитию духа через совершенствование тела,\n");
					strcat(string,"которое, в свою очередь, имеет просто огромнейшие возможности.\n");
					showPlayerDialog(playerid,9999,0," ",string,"Закрыть","");
		        }
		        case 2: {
          			strcat(string,"{ffffff}Всё очень просто, для начала Вам надо улучшить свои характеристики выносливости и силы,\n");
			  		strcat(string,"сделать это можно на специальных тренажёрах, которые стоят в спортзале.\n");
			  		strcat(string,"И запомните, чтобы более лучше изучить "cBLUE"Кунг-Фу,{ffffff} нужна хорошая выносливость.\n");
					strcat(string,"После Вам нужно отрабатывать удары на груше.\n\n");
					strcat(string,"И не забывайте, что после того как Вы изучите стиль боя, Вам нужно будет регулярно\n");
					strcat(string,"посещать зал для поддержания спортивной формы, иначе врятли\n");
					strcat(string,"Вы сможешь использовать данный стиль боя в бою.\n");
					strcat(string,"* (( Для изучения и использования Кунг-Фу, Вам надо 700 силы и 900 выносливости. ))\n");
					showPlayerDialog(playerid,9999,0," ",string,"Закрыть","");
		        }
			}
		}
		
		
		
		case d_buy_menu + 7:
		{
		    if(!response) return true;
		    new id = strval(inputtext)-1;
		    if(!strlen(inputtext)) return showPlayerDialog(playerid,d_buy_menu + 7,1," ","Введите номер бизнеса для получения копии ключа:","Далее","Отмена");
		    if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_buy_menu + 7,1," ","Введите номер бизнеса для получения копии ключа:","Далее","Отмена");
			if(id > cBizz || strval(inputtext) < 1) return showPlayerDialog(playerid,d_buy_menu + 7,1," ","Введите номер бизнеса для получения копии ключа:","Далее","Отмена");
			if(!strcmp(Bizz::[id][bOwner],Player[playerid][uName],true))
	 		{
	 		    SetPVarInt(playerid, "BizNewKey", id);
				showPlayerDialog(playerid,d_buy_menu + 8,0,"Центр купли-продажи","{ffffff}Стоимость дубликата ключей стоит 300$","Купить","Закрыть");
		    }
		    else SendClientMessage(playerid, C_GRAY, ""gbError"Вы не владелец этого бизнеса!");
		}
		case d_buy_menu + 8:
		{
		    if(!response) return true;
		    new id = GetPVarInt(playerid, "BizNewKey");
		    if(Player[playerid][uMoney] < 300) return SendClientMessage(playerid, C_GRAY, "У Вас недостаточно средств!");
		    SendClientMessage(playerid, C_GRAY, ""gbAccess"Вы успешно купили комплект ключей от своего бизнеса!");
			Player[playerid][uMoney] -= 300;
			mysql_format(1, query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
            switch(Bizz::[id][bSettings][7])
			{
				case 0: GivePlayerItem(playerid,377,id + 1);
				case 1: GivePlayerItem(playerid,410,id + 1);
				case 2: GivePlayerItem(playerid,411,id + 1);
				case 3: GivePlayerItem(playerid,412,id + 1);
				case 4: GivePlayerItem(playerid,413,id + 1);
				case 5: GivePlayerItem(playerid,421,id + 1);
				case 6: GivePlayerItem(playerid,422,id + 1);
				case 7: GivePlayerItem(playerid,423,id + 1);
				case 8: GivePlayerItem(playerid,424,id + 1);
				case 9: GivePlayerItem(playerid,425,id + 1);
				case 10: GivePlayerItem(playerid,484,id + 1);
				case 11: GivePlayerItem(playerid,487,id + 1);
				case 12: GivePlayerItem(playerid,488,id + 1);
			}
			DeletePVar(playerid, "HouseNewKey");
		}
		case d_bizz_menu:
		{
			if(!response) return 1;
			switch(listitem) {
				case 0: showPlayerDialog(playerid,d_bizz_menu + 1,2,"Центр купли-продажи","1. Закусочная{ffffff}\n2. Бар{ffffff}\n3. Ресторан{ffffff}\n4. Магазин одежды{ffffff}\n5. Магазин электроники{ffffff}\n6. Автосалон{ffffff}\n8. Магазин оружия{ffffff}\n9. Магазин мебели{ffffff}\n10. Клуб{ffffff}\n11. Заправка{ffffff}\n12. Все для отдыха\n13. Аренда транспорта\n14. Спортзалы","Далее","Закрыть");
				case 1: showPlayerDialog(playerid,d_bizz_menu + 2,2,"Центр купли-продажи","1. "cGRAY"Продать бизнес центру купли-продажи{ffffff}\n2. "cGRAY"Продать бизнес человеку","Далее","Закрыть");
			}
		}
		case d_bizz_menu + 1: {
			if(!response) return 1;
			SetPVarInt(playerid,"SelectedClassBizz",listitem);
			new bool:view = false;
			string = "";
			for(new i; i != cBizz; i ++) {
			    if(!strcmp(Bizz::[i][bOwner],"None",true) && Bizz::[i][bSettings][7] == listitem) {
				//if(!strcmp(Bizz::[i][bOwner],"None",true) && Bizz::[i][bSettings][2] == GetPVarInt(playerid,"BuyHouseCity") && Bizz::[i][bSettings][7] == listitem) {
					format(str,sizeof(str),"{ffffff}№%i - Стоимость "cGREEN"$%d\n",i + 1,Bizz::[i][bSettings][0]);
					strcat(string,str);
					view = true;
				}
			}
			if(view == false) return SendClientMessage(playerid,C_GRAY,""gbError"Все бизнесы в этом городе были распроданы.");
			showPlayerDialog(playerid,d_bizz_menu + 4,1,"Центр купли-продажи",string,"Далее","Закрыть");
		}
		case d_bizz_menu + 2: {
			if(!response) return 1;
			switch(listitem) {
				case 0: showPlayerDialog(playerid,d_bizz_menu + 3,2,"Продажа бизнеса","1. Закусочная{ffffff}\n2. Бар{ffffff}\n3. Ресторан{ffffff}\n4. Магазин одежды{ffffff}\n5. Магазин электроники{ffffff}\n6. Автосалон{ffffff}\n8. Магазин оружия{ffffff}\n9. Магазин мебели{ffffff}\n10. Клуб{ffffff}\n11. Заправка{ffffff}\n12. Все для отдыха\n13. Аренда транспорта\n14. Спортзалы","Далее","Закрыть");
				case 1: showPlayerDialog(playerid,d_bizz_menu + 7,2,"Продажа бизнеса","1. Закусочная{ffffff}\n2. Бар{ffffff}\n3. Ресторан{ffffff}\n4. Магазин одежды{ffffff}\n5. Магазин электроники{ffffff}\n6. Автосалон{ffffff}\n8. Магазин оружия{ffffff}\n9. Магазин мебели{ffffff}\n10. Клуб{ffffff}\n11. Заправка{ffffff}\n12. Все для отдыха\n13. Аренда транспорта\n14. Спортзалы","Далее","Закрыть");
			}
		}
		case d_bizz_menu + 3: {
			if(!response) return 1;
			SetPVarInt(playerid,"SelectedClassBizz",listitem);
			showPlayerDialog(playerid,d_bizz_menu + 6,1,"Продажа бизнеса","{ffffff}Введите Ваш номер бизнеса в это окошко:\n\n"cGREEN"| Посмотреть номер бизнеса вы можете в своей статистике Y.\n| Посмотреть номер бизнеса вы можете в информации о ключах","Далее","Закрыть");
		}
		case d_bizz_menu + 4: {
			if(!response) return 1;
			new id = strval(inputtext) - 1;
			if(!strlen(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит этому центру купли-продажи недвижимости.");
			if(!isNumeric(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит этому центру купли-продажи недвижимости.");
			//if(GetPVarInt(playerid,"BuyHouseCity") != Bizz::[id][bSettings][2]) return SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит этому центру купли-продажи недвижимости.");
			if(id > cBizz || strval(inputtext) < 1) return SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит этому центру купли-продажи недвижимости.");
			if(Bizz::[id][bCamera] != false) return SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит этому центру купли-продажи недвижимости.");
			if(GetPVarInt(playerid,"SelectedClassBizz") != Bizz::[id][bSettings][7]) return SendClientMessage(playerid,C_GRAY,""gbError"Этот бизнес не принадлежит этому разделу!");
			if(!strcmp(Bizz::[id][bOwner],"None",true)) {
				Bizz::[id][bCamera] = true;
				SetPVarInt(playerid,"BizzBuyingCamera",id);
				SetPVarInt(playerid,"PlayerCameraHouse",1);
				SetPVarInt(playerid,"PlayerBizzID",id);
				switch(Bizz::[id][bSettings][7])
				{
					case 0: format(string,sizeof(string),"{ffffff}| Информация о данном бизнесе:\n\n"cGRAY"Номер бизнеса - %d\nСтоимость бизнеса - "cGREEN"$%d"cGRAY"\nТип бизнеса - Закусочная",Bizz::[id][bID],Bizz::[id][bSettings][0]);
					case 1: format(string,sizeof(string),"{ffffff}| Информация о данном бизнесе:\n\n"cGRAY"Номер бизнеса - %d\nСтоимость бизнеса - "cGREEN"$%d"cGRAY"\nТип бизнеса - Бар",Bizz::[id][bID],Bizz::[id][bSettings][0]);
					case 2: format(string,sizeof(string),"{ffffff}| Информация о данном бизнесе:\n\n"cGRAY"Номер бизнеса - %d\nСтоимость бизнеса - "cGREEN"$%d"cGRAY"\nТип бизнеса - Ресторан",Bizz::[id][bID],Bizz::[id][bSettings][0]);
					case 3: format(string,sizeof(string),"{ffffff}| Информация о данном бизнесе:\n\n"cGRAY"Номер бизнеса - %d\nСтоимость бизнеса - "cGREEN"$%d"cGRAY"\nТип бизнеса - Магазин одежды",Bizz::[id][bID],Bizz::[id][bSettings][0]);
					case 4: format(string,sizeof(string),"{ffffff}| Информация о данном бизнесе:\n\n"cGRAY"Номер бизнеса - %d\nСтоимость бизнеса - "cGREEN"$%d"cGRAY"\nТип бизнеса - Магазин электроники",Bizz::[id][bID],Bizz::[id][bSettings][0]);
					case 5: format(string,sizeof(string),"{ffffff}| Информация о данном бизнесе:\n\n"cGRAY"Номер бизнеса - %d\nСтоимость бизнеса - "cGREEN"$%d"cGRAY"\nТип бизнеса - Автосалон",Bizz::[id][bID],Bizz::[id][bSettings][0]);
					case 6: format(string,sizeof(string),"{ffffff}| Информация о данном бизнесе:\n\n"cGRAY"Номер бизнеса - %d\nСтоимость бизнеса - "cGREEN"$%d"cGRAY"\nТип бизнеса - Магазин оружия",Bizz::[id][bID],Bizz::[id][bSettings][0]);
					case 7: format(string,sizeof(string),"{ffffff}| Информация о данном бизнесе:\n\n"cGRAY"Номер бизнеса - %d\nСтоимость бизнеса - "cGREEN"$%d"cGRAY"\nТип бизнеса - Магазин мебели",Bizz::[id][bID],Bizz::[id][bSettings][0]);
					case 8: format(string,sizeof(string),"{ffffff}| Информация о данном бизнесе:\n\n"cGRAY"Номер бизнеса - %d\nСтоимость бизнеса - "cGREEN"$%d"cGRAY"\nТип бизнеса - Клуб",Bizz::[id][bID],Bizz::[id][bSettings][0]);
					case 9: format(string,sizeof(string),"{ffffff}| Информация о данном бизнесе:\n\n"cGRAY"Номер бизнеса - %d\nСтоимость бизнеса - "cGREEN"$%d"cGRAY"\nТип бизнеса - Заправка",Bizz::[id][bID],Bizz::[id][bSettings][0]);
					case 10: format(string,sizeof(string),"{ffffff}| Информация о данном бизнесе:\n\n"cGRAY"Номер бизнеса - %d\nСтоимость бизнеса - "cGREEN"$%d"cGRAY"\nТип бизнеса - Все для отдыха",Bizz::[id][bID],Bizz::[id][bSettings][0]);
                    case 11: format(string,sizeof(string),"{ffffff}| Информация о данном бизнесе:\n\n"cGRAY"Номер бизнеса - %d\nСтоимость бизнеса - "cGREEN"$%d"cGRAY"\nТип бизнеса - Аренда автомобилей",Bizz::[id][bID],Bizz::[id][bSettings][0]);
                    case 12: format(string,sizeof(string),"{ffffff}| Информация о данном бизнесе:\n\n"cGRAY"Номер бизнеса - %d\nСтоимость бизнеса - "cGREEN"$%d"cGRAY"\nТип бизнеса - Спортзал",Bizz::[id][bID],Bizz::[id][bSettings][0]);
				}
				showPlayerDialog(playerid,d_bizz_menu + 5,0," ",string,"Купить","Закрыть");
				new Float:dist = 6.0,Float:p[4];
				GetPlayerPos(playerid,p[0],p[1],p[2]);
				SetPVarFloat(playerid,"HouseBuyX",p[0]);
				SetPVarFloat(playerid,"HouseBuyY",p[1]);
				SetPVarFloat(playerid,"HouseBuyZ",p[2]);
				setPlayerPos(playerid,Bizz::[id][bEnter][0] + 7.0 * -floatsin(Bizz::[id][bEnter][3] + 180.0,degrees),Bizz::[id][bEnter][1] + 7.0 * floatcos(Bizz::[id][bEnter][3] + 180.0,degrees),Bizz::[id][bEnter][2]);
				SetPlayerInterior(playerid,0);
				SetPlayerVirtualWorld(playerid,1);
				InterpolateCameraPos(playerid,Bizz::[id][bEnter][0],Bizz::[id][bEnter][1],Bizz::[id][bEnter][2],Bizz::[id][bEnter][0] + dist * -floatsin(Bizz::[id][bEnter][3] + 180.0,degrees),Bizz::[id][bEnter][1] + dist * floatcos(Bizz::[id][bEnter][3] + 180.0,degrees),Bizz::[id][bEnter][2],600,1000);
				InterpolateCameraLookAt(playerid,Bizz::[id][bEnter][0],Bizz::[id][bEnter][1],Bizz::[id][bEnter][2],Bizz::[id][bEnter][0],Bizz::[id][bEnter][1],Bizz::[id][bEnter][2],600,1000);
			}
			else SendClientMessage(playerid,C_GRAY,""gbError"Данный бизнес уже кто-то выкупил и он не может быть продан.");
		}
		case d_bizz_menu + 5: {
			setPlayerPos(playerid,GetPVarFloat(playerid,"HouseBuyX"),GetPVarFloat(playerid,"HouseBuyY"),GetPVarFloat(playerid,"HouseBuyZ"));
//			spawnFreezeTime(playerid);
        	SetCameraBehindPlayer(playerid);
        	SetPlayerVirtualWorld(playerid,0);
        	SetPlayerInterior(playerid,1);
		    DeletePVar(playerid,"HouseBuyX");
			DeletePVar(playerid,"HouseBuyY");
			DeletePVar(playerid,"HouseBuyZ");
		    DeletePVar(playerid,"PlayerCameraHouse");
		    Bizz::[GetPVarInt(playerid,"BizzBuyingCamera")][bCamera] = false;
		    DeletePVar(playerid,"BizzBuyingCamera");
			
			if( !response ) 
				return 1;
			
			new countbizz = 0;
		    for(new i; i != cBizz; i ++) {
		    	if(!strcmp(Bizz::[i][bOwner],Player[playerid][uName],true)) countbizz ++;
		    }
			if( Player[playerid][uPremium] ) 
			{
				if( countbizz >= 2) return SendMes( playerid, C_GRAY, ""gbError"У вас уже достаточно бизнесов и купить ещё один невозможно!" );
			}
			else 
			{
			    if(countbizz >= 1) return SendClientMessage(playerid,C_GRAY,""gbError"У вас уже достаточно бизнесов и купить ещё один невозможно!");
			}
			MeAction(playerid,"купил(-а) бизнес",1);
			new id = GetPVarInt(playerid,"PlayerBizzID");
			
			if(Player[playerid][uMoney] < Bizz::[id][bSettings][0]) 
				return SendClientMessage(playerid,C_GRAY,""gbError"У вас недостаточно средств для покупки этого бизнеса.");
			
			strmid(Bizz::[id][bOwner], Player[playerid][uName], 0, strlen(Player[playerid][uName]), MAX_PLAYER_NAME);
			SetBizzStr(Bizz::[id][bID],"bOwner",Bizz::[id][bOwner]);
		    Player[playerid][uMoney] -= Bizz::[id][bSettings][0];


			Bizz::[id][bOwnerID] = Player[playerid][uID];
            SetBizzInt(Bizz::[id][bID],"SellDate",Bizz::[id][bOwnerID]);

            Bizz::[id][SellDate] = getdate();
            SetBizzInt(Bizz::[id][bID],"SellDate",Bizz::[id][SellDate]);

		    Bizz::[id][bBizzRent] = 1;
		    format(query,sizeof(query),"UPDATE gb_business SET bBizzRent = '%d' WHERE bID = '%d'",Bizz::[id][bBizzRent],Bizz::[id][bID]);
			mysql_tquery(1, query, "", "");
		    format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
		    switch(Bizz::[id][bSettings][7])
			{
		    	case 0: GivePlayerItem(playerid,377,id + 1);
		    	case 1: GivePlayerItem(playerid,410,id + 1);
		    	case 2: GivePlayerItem(playerid,411,id + 1);
		    	case 3: GivePlayerItem(playerid,412,id + 1);
		    	case 4: GivePlayerItem(playerid,413,id + 1);
		    	case 5: GivePlayerItem(playerid,421,id + 1);
		    	case 6: GivePlayerItem(playerid,422,id + 1);
		    	case 7: GivePlayerItem(playerid,423,id + 1);
		    	case 8: GivePlayerItem(playerid,424,id + 1);
		    	case 9: GivePlayerItem(playerid,425,id + 1);
		    	case 10: GivePlayerItem(playerid,484,id + 1);
		    	case 11: GivePlayerItem(playerid,487,id + 1);
		    	case 12: GivePlayerItem(playerid,488,id + 1);
		    }
		    SendClientMessage(playerid,C_GRAY,""gbAccess"Вы купили собственный бизнес, ваш бизнес автоматически оплачен на "cBLUE"1 {ffffff}день.");
		    SetPlayerCheckpoint(playerid,Bizz::[id][bEnter][0], Bizz::[id][bEnter][1], Bizz::[id][bEnter][2],5.0);
		}
		case d_bizz_menu + 6: {
			if(!response) return 1;
			new id = strval(inputtext) - 1;
			if(!strlen(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит этому центру купли-продажи недвижимости.");
			if(!isNumeric(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит этому центру купли-продажи недвижимости.");
			//if(GetPVarInt(playerid,"BuyHouseCity") != Bizz::[id][bSettings][2]) return SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит этому центру купли-продажи недвижимости.");
			if(id > cBizz || strval(inputtext) < 1) return SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит этому центру купли-продажи недвижимости.");
			if(GetPVarInt(playerid,"SelectedClassBizz") != Bizz::[id][bSettings][7]) return SendClientMessage(playerid,C_GRAY,""gbError"Этот бизнес не принадлежит этому разделу!");
			if(!strcmp(Bizz::[id][bOwner],Player[playerid][uName],true)) {

				strmid(Bizz::[id][bOwner], "None", 0, strlen("None"), 24);
				SetBizzStr(Bizz::[id][bID],"bOwner", Bizz::[id][bOwner]);
				new cash;
				switch( Player[playerid][uPremium] ) {
					case 1 : cash = floatround( Bizz::[id][bSettings][0] * 0.7 );
					case 2 : cash = floatround( Bizz::[id][bSettings][0] * 0.8 );
					case 3 : cash = floatround( Bizz::[id][bSettings][0] * 0.9 );
					case 4 : cash = floatround( Bizz::[id][bSettings][0] * 0.95 );
					default: 
					{
						cash = floatround( Bizz::[id][bSettings][0] * 0.75 );
					}
				}	
				SendMes( playerid, C_GRAY, ""gbAccess"Вы продали собственный бизнес за "cGREEN"$%d", cash );
					
				Player[playerid][uMoney] += cash;
				Bizz::[id][bOwnerID] = 0;
				SetBizzInt(Bizz::[id][bID],"bOwnerID", Bizz::[id][bOwnerID]);

				mysql_format( mysql, query, sizeof query,"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
				mysql_query( mysql, query );


			    switch(Bizz::[id][bSettings][7]) {
			        case 3: {
			            if(Bizz::[id][bUpdate][1] == 1) {
				    		for(new i; i != 351; i ++) DestroyDynamicObject(Bizz::[id][bObjects][i]);
				    		for(new i; i != 5; i ++) {
				    		if (IsValidDynamic3DTextLabel(Bizz::[id][bTextBuy][i]))
								DestroyDynamic3DTextLabel(Bizz::[id][bTextBuy][i]);
							}
				    	}
			        }
			        case 8: {
			            if(Bizz::[id][bUpdate][1] == 1) {
				    		for(new i; i < 54; i ++) DestroyDynamicObject(Bizz::[id][bAObject][i]);
				    		if (IsValidDynamic3DTextLabel(Bizz::[id][bAText]))
				    			DestroyDynamic3DTextLabel(Bizz::[id][bAText]);
				    	}
			        }
			    }
	   			if(Bizz::[id][bUpdate][0] != 0) Bizz::[id][bUpdate][0] = 0;
	   			if(Bizz::[id][bUpdate][1] != 0) Bizz::[id][bUpdate][1] = 0;
	   			if(Bizz::[id][bUpdate][2] != 0) Bizz::[id][bUpdate][2] = 0;

		    	format( gb_string, sizeof gb_string,"%d|%d|%d",Bizz::[id][bUpdate][0],Bizz::[id][bUpdate][1],Bizz::[id][bUpdate][2]);
				SetBizzStr( Bizz::[id][bID], "bUpdate", gb_string);

				for(new i; i != MAX_SLOTS; i ++) {
					switch(Inv[playerid][invSlot][i]) {
						case 377,410 .. 413,421 .. 425,484,487,488: {
							if(Inv[playerid][invSlotKol][i] == id + 1) {
								Inv[playerid][invSlot][i] = 0;
                        		Inv[playerid][invSlotKol][i] = 0;
                        		printf("%d | %d", Inv[playerid][invSlot][i], Inv[playerid][invSlotKol][i]);
							}
						}
					}
				}

				MeAction(playerid,"продал(-а) собственный бизнес",1);
			}
			else SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит вам!");
		}
		case d_bizz_menu + 7: {
			if(!response) return 1;
			SetPVarInt(playerid,"SelectedClassBizz",listitem);
			showPlayerDialog(playerid,d_bizz_menu + 8,1,"Продажа бизнеса","{ffffff}Введите Ваш номер бизнеса в это окошко:\n\n"cGREEN"| Посмотреть номер бизнеса вы можете в своей статистике Y.\n| Посмотреть номер бизнеса вы можете в информации о ключах","Далее","Закрыть");
		}
		case d_bizz_menu + 8: {
		    if(!response) return 1;
		    new id = strval(inputtext) - 1;
		    if(!strlen(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит этому центру купли-продажи недвижимости.");
		    if(!isNumeric(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит этому центру купли-продажи недвижимости.");
		    //if(GetPVarInt(playerid,"BuyHouseCity") != Bizz::[id][bSettings][2]) return SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит этому центру купли-продажи недвижимости.");
            if(id > cBizz || strval(inputtext) < 1) return SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит этому центру купли-продажи недвижимости.");
			if(!strcmp(Bizz::[id][bOwner],Player[playerid][uName],true)) {
			    SetPVarInt(playerid,"SellBusinessID",id);
			    showPlayerDialog(playerid,d_bizz_menu + 9,1," ","{ffffff}Введите в окошко ID человека, которому хотите продать бизнес:\n\n"cGREEN"| ID можно посмотреть через TAB не закрывая окно.\n| Человек должен находиться рядом с Вами.","Далее","Закрыть");
			}
			else SendClientMessage(playerid,C_GRAY,""gbError"Указанный вами бизнес не принадлежит вам!");
		}
		case d_bizz_menu + 9: {
		    if(!response) return 1;
		    new id = strval(inputtext);
		    if(!strlen(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Данного человека нет рядом с вами, простите, но продажа отменена.");
		    if(!isNumeric(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Данного человека нет рядом с вами, простите, но продажа отменена.");
		    if(!IsPlayerConnected(id)) return SendClientMessage(playerid,C_GRAY,""gbError"Данного человека нет рядом с вами, простите, но продажа отменена.");
			if(GetPVarInt(id,"uLogin") != 1) return SendClientMessage(playerid,C_GRAY,""gbError"Данного человека нет рядом с вами, простите, но продажа отменена.");
			if(id == playerid) return SendClientMessage(playerid,C_GRAY,""gbError"Данного человека нет рядом с вами, простите, но продажа отменена.");
			if(GetDistanceBetweenPlayers(playerid,id) > 10.0) return SendClientMessage(playerid,C_GRAY,""gbError"Данного человека нет рядом с вами, простите, но продажа отменена.");
			SetPVarInt(playerid,"SellBusinessIDPlayer",id);
			format(string,sizeof(string),"{ffffff}Введите в окошко цену, за которую вы хотите продать бизнес:\n\n"cGREEN"| Минимальная цена Вашего бизнеса - $%d\n| Максимальная цена Вашего бизнеса - $%d",Bizz::[GetPVarInt(playerid,"SellBusinessID")][bSettings][0] / 100 * 80,Bizz::[GetPVarInt(playerid,"SellBusinessID")][bSettings][0] * 2);
			showPlayerDialog(playerid,d_bizz_menu + 10,1," ",string,"Далее","Закрыть");
		}
		case d_bizz_menu + 10: {
		    if(!response) return 1;
		    new id = strval(inputtext);
		    if(!strlen(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Вам отказано в продаже вашего бизнеса, попробуйте позже.");
		    if(!isNumeric(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Вам отказано в продаже вашего бизнеса, попробуйте позже.");
			if(id < Bizz::[GetPVarInt(playerid,"SellBusinessID")][bSettings][0] / 100 * 80) return SendClientMessage(playerid,C_GRAY,""gbError"Цена бизнеса слишком мала для продажи.");
			if(id > Bizz::[GetPVarInt(playerid,"SellBusinessID")][bSettings][0] * 2) return SendClientMessage(playerid,C_GRAY,""gbError"Цена бизнеса слишком велика для продажи.");
			format(string,sizeof(string),"{ffffff}| Информация о покупке бизнеса:"cGRAY"\n\nВладелец бизнеса - %s\nСтоимость бизнеса (гос.) - "cGREEN"$%d"cGRAY"\nСтоимость бизнеса (продажа) - "cGREEN"$%d",Bizz::[GetPVarInt(playerid,"SellBusinessID")][bOwner],Bizz::[GetPVarInt(playerid,"SellBusinessID")][bSettings][0],id);
			showPlayerDialog(GetPVarInt(playerid,"SellBusinessIDPlayer"),d_bizz_menu + 11,0,"Покупка бизнеса",string,"Далее","Закрыть");
			SetPVarInt(GetPVarInt(playerid,"SellBusinessIDPlayer"),"SellBusinessID",GetPVarInt(playerid,"SellBusinessID"));
			SetPVarInt(GetPVarInt(playerid,"SellBusinessIDPlayer"),"SellBusinessIDPlayer",playerid);
            SetPVarInt(GetPVarInt(playerid,"SellBusinessIDPlayer"),"SellBusinessIDPrice",id);
            DeletePVar(playerid,"SellBusinessIDPlayer");
			DeletePVar(playerid,"SellBusinessID");
			DeletePVar(playerid,"SellBusinessIDPrice");
		}
		case d_bizz_menu + 11: {
		    if(!response) {
				if(!IsPlayerConnected(GetPVarInt(playerid,"SellBusinessIDPlayer"))) SendClientMessage(playerid,C_GRAY,""gbError"Данного человека нет рядом с вами, простите, но продажа отменена.");
				DeletePVar(playerid,"SellBusinessIDPlayer");
				DeletePVar(playerid,"SellBusinessID");
				DeletePVar(playerid,"SellBusinessIDPrice");
				return 1;
		    }
		    new id = GetPVarInt(playerid,"SellBusinessIDPlayer"),price = GetPVarInt(playerid,"SellBusinessIDPrice"),idhouse = GetPVarInt(playerid,"SellBusinessID");
		    DeletePVar(playerid,"SellBusinessIDPlayer");
			DeletePVar(playerid,"SellBusinessID");
			DeletePVar(playerid,"SellBusinessIDPrice");
			if(!IsPlayerConnected(id)) return SendClientMessage(playerid,C_GRAY,""gbError"Данного человека нет рядом с вами, простите, но продажа отменена.");
            if(Player[playerid][uMoney] < price) {
				SendClientMessage(playerid,C_GRAY,""gbError"У вас недостаточно средств для покупки этого бизнеса.");
				SendClientMessage(id,C_GRAY,""gbError"Простите, но у покупателя нет денег!");
				return 1;
		    }
			
		    if(!strcmp(Bizz::[idhouse][bOwner],Player[id][uName],true)) 
			{
		        SendClientMessage(playerid,C_GRAY,""gbAccess"Вы выкупили бизнес, ключи добавлены вам в инвентарь.");
		        SendClientMessage(id,C_GREEN,""gbAccess"Покупатель купил Ваш бизнес, деньги за бизнес выданы Вам на руки.");
			    
			    Player[id][uMoney] += price;
				Player[playerid][uMoney] -= price;
				mysql_format(1, query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
				mysql_tquery(1, query, "", "");
				mysql_format(1, query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[id][uMoney],Player[id][uName]);
				mysql_tquery(1, query, "", "");

			    format(string,sizeof(string),"купил(-а) бизнес у %s",Player[id][uName]);
				MeAction(playerid,string,1);
				format(string,sizeof(string),"продал(-а) бизнес %s'y",Player[playerid][uName]);
				MeAction(id,string,1);

				strmid(Bizz::[idhouse][bOwner], Player[playerid][uName], 0, strlen(Player[playerid][uName]), MAX_PLAYER_NAME);
			    SetBizzStr(Bizz::[idhouse][bID],"bOwner",Bizz::[idhouse][bOwner]);

				Bizz::[idhouse][bOwnerID] = Player[playerid][uID];
			    SetBizzInt(Bizz::[idhouse][bID],"bOwnerID",Bizz::[idhouse][bOwnerID]);

			    for(new i; i != MAX_SLOTS; i ++) {
					switch(Inv[id][invSlot][i]) {
						case 377,410 .. 413,421 .. 425,484,487,488: {
							if(Inv[id][invSlotKol][i] == idhouse + 1) {
								Inv[id][invSlot][i] = 0;
                        		Inv[id][invSlotKol][i] = 0;
                        		printf("%d | %d", Inv[playerid][invSlot][i], Inv[playerid][invSlotKol][i]);
								break;
							}
						}
					}
				}
				switch(Bizz::[idhouse][bSettings][7]) {
			    	case 0: GivePlayerItem(playerid,377,idhouse + 1);
			    	case 1: GivePlayerItem(playerid,410,idhouse + 1);
			    	case 2: GivePlayerItem(playerid,411,idhouse + 1);
			    	case 3: GivePlayerItem(playerid,412,idhouse + 1);
			    	case 4: GivePlayerItem(playerid,413,idhouse + 1);
			    	case 5: GivePlayerItem(playerid,421,idhouse + 1);
			    	case 6: GivePlayerItem(playerid,422,idhouse + 1);
			    	case 7: GivePlayerItem(playerid,423,idhouse + 1);
			    	case 8: GivePlayerItem(playerid,424,idhouse + 1);
			    	case 9: GivePlayerItem(playerid,425,idhouse + 1);
			    	case 10: GivePlayerItem(playerid,484,idhouse + 1);
			    	case 11: GivePlayerItem(playerid,487,idhouse + 1);
			    	case 12: GivePlayerItem(playerid,488,idhouse + 1);
			    }

		        switch(Bizz::[idhouse][bSettings][7]) {
			        case 3: {
			            if(Bizz::[idhouse][bUpdate][1] == 1) {
				    		for(new i; i != 351; i ++) DestroyDynamicObject(Bizz::[idhouse][bObjects][i]);
				    		for(new i; i != 5; i ++) {
							if (IsValidDynamic3DTextLabel(Bizz::[idhouse][bTextBuy][i]))
								DestroyDynamic3DTextLabel(Bizz::[idhouse][bTextBuy][i]);
							}
				    	}
			        }
			        case 8: {
			            if(Bizz::[idhouse][bUpdate][1] == 1) {
				    		for(new i; i != 54; i ++) DestroyDynamicObject(Bizz::[idhouse][bAObject][i]);
				    		if (IsValidDynamic3DTextLabel(Bizz::[idhouse][bAText]))
				    			DestroyDynamic3DTextLabel(Bizz::[idhouse][bAText]);
				    	}
			        }
			    }

		    }
		    else SendClientMessage(playerid,C_GRAY,""gbError"Данный бизнес уже кто-то выкупил и он не может быть продан.");
		}
		case d_bizz: 
		{
			if(!response) return 1;
			new id = GetPVarInt(playerid,"PlayerBizzID");
			
			if( !IsOwnerBusiness( id, playerid ) )
				return 1;
				
			switch(listitem) {
				case 0: {
					string = "";
					format(str,sizeof(str),"{ffffff}| Информация о собственном бизнесе:"cGRAY"\n\n%s\n\n",Bizz::[id][bName]),strcat(string,str);
					format(str,sizeof(str),"Владелец - %s\n",Bizz::[id][bOwner]),strcat(string,str);
					format(str,sizeof(str),"Стоимость ( Гос. ) - "cGREEN"$%d"cGRAY"\n",Bizz::[id][bSettings][0]),strcat(string,str);
					switch(Bizz::[id][bSettings][7]) {
						case 9: format(str,sizeof(str),"Заполненность топливных отсеков - %d/%d л\n\n",Bizz::[id][bSettings][3],MAX_BUSINESS_BURGERS * (1 + Bizz::[id][bUpdate][0])),strcat(string,str);
						default: format(str,sizeof(str),"Заполненность складских помещений - %d/%d\n\n",Bizz::[id][bSettings][3],MAX_BUSINESS_BURGERS * (1 + Bizz::[id][bUpdate][0])),strcat(string,str);
					}
					switch(Bizz::[id][bSettings][7]) {
						case 9: format(str,sizeof(str),"Увеличенные топливные отсеки - %s\n",Bizz::[id][bUpdate][0] ? (""cGREEN"Есть"cGRAY"") : (""cRED"Нет"cGRAY"")),strcat(string,str);
						default: format(str,sizeof(str),"Расширенные складские помещения - %s\n",Bizz::[id][bUpdate][0] ? (""cGREEN"Есть"cGRAY"") : (""cRED"Нет"cGRAY"")),strcat(string,str);
					}
					if(Bizz::[id][bSettings][7] != 9) format(str,sizeof(str),"Расширенный ассортимент к продаже - %s\n",Bizz::[id][bUpdate][1] ? (""cGREEN"Есть"cGRAY"") : (""cRED"Нет"cGRAY"")),strcat(string,str);
					format(str,sizeof(str),"\n\nВ сейфе бизнеса - "cGREEN"$%d"cGRAY"\n\nЧасов без продуктов: - "cGREEN"%d\n",Bizz::[id][bSettings][6], Bizz::[id][bSellHour]),strcat(string,str);
					//format(str, sizeof(str), "{AFAFAF}Рейтинг бизнеса — {33AA33} %d", Bizz:[id][bRating]), strcat(string,str);
					format(str, sizeof(str), "{AFAFAF}Рейтинг бизнеса — {33AA33} %d", Bizz::[id][bRating]), strcat(string,str);
					showPlayerDialog(playerid,9999,0," ",string,"Закрыть","");
				}
				case 1: {
					string = "";
					switch(Bizz::[id][bSettings][7]) {
						case 9: format(str,sizeof(str),"Увеличенные топливные отсеки - %s ( $%d )\n",Bizz::[id][bUpdate][0] ? (""cGREEN"Есть{ffffff}") : (""cRED"Нет{ffffff}"),PRICE_BUSINESS_UPDATE1),strcat(string,str);
						default: format(str,sizeof(str),"Расширенные складские помещения - %s ( $%d )\n",Bizz::[id][bUpdate][0] ? (""cGREEN"Есть{ffffff}") : (""cRED"Нет{ffffff}"),PRICE_BUSINESS_UPDATE1),strcat(string,str);
					}
					if(Bizz::[id][bSettings][7] != 9 && Bizz::[id][bSettings][7] != 11 && Bizz::[id][bSettings][7] != 12) format(str,sizeof(str),"Расширенный ассортимент к продаже - %s ( $%d )",Bizz::[id][bUpdate][1] ? (""cGREEN"Есть{ffffff}") : (""cRED"Нет{ffffff}"),PRICE_BUSINESS_UPDATE2),strcat(string,str);
					showPlayerDialog(playerid,d_bizz + 1,2," ",string,"Далее","Закрыть");
				}
				case 2: {
					switch(Bizz::[id][bSettings][7]) {
						case 5: format(string,sizeof(string),"{ffffff}1. "cGRAY"Сменить название бизнеса - "cGREEN"%s\n{ffffff}2. "cGRAY"Заказать товары в бизнес",Bizz::[id][bName]);
						case 9: format(string,sizeof(string),"{ffffff}1. "cGRAY"Сменить название бизнеса - "cGREEN"%s\n{ffffff}2. "cGRAY"Установить цену за 1 литр топлива - "cGREEN"$%d\n{ffffff}3. "cGRAY"Заказать топливо в АЗС",Bizz::[id][bName],Bizz::[id][bSettings][5]);
						default: format(string,sizeof(string),"{ffffff}1. "cGRAY"Сменить название бизнеса - "cGREEN"%s\n{ffffff}2. "cGRAY"Установить цену за 1 продукт - "cGREEN"$%d\n{ffffff}3. "cGRAY"Заказать товары в бизнес",Bizz::[id][bName],Bizz::[id][bSettings][5]);
					}
					showPlayerDialog(playerid,d_bizz + 2,2," ",string,"Далее","Закрыть");
				}
				case 3: showPlayerDialog(playerid,d_bizz + 5,2," ","1. "cGRAY"Положить деньги в сейф бизнеса{ffffff}\n2. "cGRAY"Взять деньги из сейфа бизнеса{ffffff}","Далее","Закрыть");
			}
		}
		case d_bizz + 35: {
		    if(response) {
			    RemovePlayerFromVehicle(playerid);
				KillTimer( player_rent_timer[playerid] );
			    if(D::[playerid][dRentVehicleID]) SetVehicleToRespawn(D::[playerid][dRentVehicleID]);
			    return 1;
			}
		
		 	OnPlayerRentAccept(playerid);
		}
		case d_bizz + 34: {
		    if(!response) {
				removePlayerFromVehicle(playerid);
				if(D::[playerid][dRentVehicleID]) SetVehicleToRespawn(D::[playerid][dRentVehicleID]);

				return 1;
			}
		    if(!strlen(inputtext))
			{
			 	SendClientMessage(playerid,C_GRAY,""gbError"Вы не можете оставить строку пустой!");
            	SetPVarInt(playerid, "rent_veh", -1);
	            format(string, sizeof(string), "{ffffff}Вы можете арендовать это транспортное средство на время.\n\n"gbInfo"Стоимость аренды для данного ТС: "cGREEN"$%i/минута\n\n"gbInfo"Введите, на сколько минут Вы хотите арендовать данное ТС:", Bizz::[84][bSettings][5]*ProdVehicleLal(GetPlayerVehicleID(playerid)));
				showPlayerDialog(playerid, d_bizz + 34, DIALOG_STYLE_INPUT, "Аренда транспорта", string, "Далее", "Отмена");

	            return 1;
			}
			if(strval(inputtext) < 20 || strval(inputtext) > 120)
			{
			 	SendClientMessage(playerid,C_GRAY,""gbError"Значение указывайте от 20 до 120.");
            	SetPVarInt(playerid, "rent_veh", -1);
                format(string, sizeof(string), "{ffffff}Вы можете арендовать это транспортное средство на время.\n\n"gbInfo"Стоимость аренды для данного ТС: "cGREEN"$%i/минута\n\n"gbInfo"Введите, на сколько минут Вы хотите арендовать данное ТС:", Bizz::[84][bSettings][5]*ProdVehicleLal(GetPlayerVehicleID(playerid)));
				showPlayerDialog(playerid, d_bizz + 34, DIALOG_STYLE_INPUT, "Аренда транспорта", string, "Далее", "Отмена");
				return 1;
			}
   			if(!isNumeric(inputtext))
			{
			 	SendClientMessage(playerid,C_GRAY,""gbError"Значение указывайте от 20 до 120.");
			 	SetPVarInt(playerid, "rent_veh", -1);
                format(string, sizeof(string), "{ffffff}Вы можете арендовать это транспортное средство на время.\n\n"gbInfo"Стоимость аренды для данного ТС: "cGREEN"$%i/минута\n\n"gbInfo"Введите, на сколько минут Вы хотите арендовать данное ТС:", Bizz::[84][bSettings][5]*ProdVehicleLal(GetPlayerVehicleID(playerid)));
				showPlayerDialog(playerid, d_bizz + 34, DIALOG_STYLE_INPUT, "Аренда транспорта", string, "Далее", "Отмена");
				return 1;
			}
			OnPlayerRentVeh(playerid, strval(inputtext));
		}
		case d_bizz + 1: {
			if(!response) return 1;
			new id = GetPVarInt(playerid,"PlayerBizzID"),list;
			switch(Bizz::[id][bSettings][7]) {
			    case 9: if(listitem == 1) list = listitem + 1;
				default: list = listitem;
			}
			switch(list) {
			    case 0: {
			        if(Player[playerid][uMoney] < PRICE_BUSINESS_UPDATE1) return SendClientMessage(playerid,C_GRAY,""gbError"У вас недостаточно средств для улучшения бизнеса.");
					if(Bizz::[id][bUpdate][list] != 0) return SendClientMessage(playerid,C_GRAY,""gbError"Это улучшение уже есть у вашего бизнеса.");
					Bizz::[id][bUpdate][list] = 1;
					Player[playerid][uMoney] -= PRICE_BUSINESS_UPDATE1;
					SendClientMessage(playerid,C_GRAY,""gbAccess"Вы расширили складские помещения или топливные отсеки в своём бизнесе!");
				}
			    case 1: {
			        if(Player[playerid][uMoney] < PRICE_BUSINESS_UPDATE2) return SendClientMessage(playerid,C_GRAY,""gbError"У вас недостаточно средств для улучшения бизнеса.");
                    if(Bizz::[id][bUpdate][list] != 0) return SendClientMessage(playerid,C_GRAY,""gbError"Это улучшение уже есть у вашего бизнеса.");
					Bizz::[id][bUpdate][list] = 1;
					Player[playerid][uMoney] -= PRICE_BUSINESS_UPDATE2;
					switch(Bizz::[id][bSettings][7]) {
						case 0: {
							Bizz::[id][bProdItems][4] = 40; Bizz::[id][bProdItems][5] = 40; Bizz::[id][bProdItems][6] = 50; Bizz::[id][bProdItems][7] = 60;
                			Bizz::[id][bItems][4] = 406; Bizz::[id][bItems][5] = 407; Bizz::[id][bItems][6] = 408; Bizz::[id][bItems][7] = 409;
						}
						case 1: {
							Bizz::[id][bItems][4] = 418; Bizz::[id][bItems][5] = 419; Bizz::[id][bItems][6] = 420;
        					Bizz::[id][bProdItems][4] = 20; Bizz::[id][bProdItems][5] = 30; Bizz::[id][bProdItems][6] = 45;
						}
						case 3: {
							ClothesObjects(id);
    						ClothesBuying(id);
						}
						case 4: {
							Bizz::[id][bItems][8] = 399;
							Bizz::[id][bItems][9] = 400;
							Bizz::[id][bItems][10] = 401;
							Bizz::[id][bItems][11] = 469;

		        			Bizz::[id][bProdItems][8] = 300;
							Bizz::[id][bProdItems][9] = 300;
							Bizz::[id][bProdItems][10] = 300;
							Bizz::[id][bProdItems][11] = 300;
						}
						case 6:
						{
							Bizz::[id][bItems][11] = 323;
							Bizz::[id][bItems][12] = 327;
							Bizz::[id][bItems][13] = 338;
							Bizz::[id][bItems][14] = 391;
							Bizz::[id][bItems][15] = 392;
						}
						case 8: {
						    AlhambraObjects(id);
						}
						case 9: {
						    Bizz::[id][bItems][0] = 442,Bizz::[id][bItems][1] = 414,Bizz::[id][bItems][2] = 402, Bizz::[id][bItems][3] = 406,Bizz::[id][bItems][4] = 404,Bizz::[id][bItems][5] = 450;
    						Bizz::[id][bProdItems][0] = 20,Bizz::[id][bProdItems][1] = 15,Bizz::[id][bProdItems][2] = 10,Bizz::[id][bProdItems][3] = 40,Bizz::[id][bProdItems][4] = 20,Bizz::[id][bProdItems][5] = 40;
						}
						case 10:
						{
						    Bizz::[id][bItems][8] = 471,
						    Bizz::[id][bProdItems][8] = 100,
						    Bizz::[id][bItems][9] = 478,
						    Bizz::[id][bProdItems][9] = 150,
							Bizz::[id][bItems][10] = 324,
						    Bizz::[id][bProdItems][10] = 324;

						    Bizz::[id][bItems][11] = 480,
						    Bizz::[id][bProdItems][11] = 20;
						}
					}
					SendClientMessage(playerid,C_GRAY,""gbAccess"Вы расширили ассортимент к продаже в своём бизнесе!");
				}
			}


			format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
			GameTextForPlayer(playerid, "~g~Updated", 5000, 1);
			format(string,sizeof(string),"%d|%d|%d",Bizz::[id][bUpdate][0],Bizz::[id][bUpdate][1],Bizz::[id][bUpdate][2]);
			SetBizzStr(Bizz::[id][bID],"bUpdate",string);
			MeAction(playerid,"улучшил(-а) свой бизнес",1);
			return 1;
		}
		case d_bizz + 2: {
			if(!response) return 1;
			new id = GetPVarInt(playerid,"PlayerBizzID"),list = listitem;
			
			if( !IsOwnerBusiness( id, playerid ) )
				return 1;
				
			if(listitem == 1 && Bizz::[id][bSettings][7] == 5) list = listitem + 1;
			switch(list) {
				case 0: showPlayerDialog(playerid,d_bizz + 3,1," ","{ffffff}Введите в окошко новое название бизнеса:\n\n"cGREEN"| Название бизнеса не должно быть меньше 1 и не больше 16 символов.","Далее","Закрыть");
				case 1: {
				    switch(Bizz::[id][bSettings][7]) {
				        case 5: {
				            format(string,sizeof(string),"{ffffff}Введите кол-во товаров которое хотите заказать:\n\n"cGRAY"| Складское помещение: %d / %d ед.\n"gbInfo"ВНИМАНИЕ!!! Вы не снимите деньги, пока не выполнят ваш заказ\nа так-же заказывать продукты можно только за 1 раз",
							Bizz::[id][bSettings][3],MAX_BUSINESS_BURGERS * (1 + Bizz::[id][bUpdate][0]));
							showPlayerDialog(playerid,d_bizz + 18,1," ",string,"Далее","Закрыть");
				        }
						default: showPlayerDialog(playerid,d_bizz + 4,1," ","{ffffff}Введите цену:\n\n"cGREEN"| Минимальная цена $1 и максимальная $5","Далее","Закрыть");
					}
				}
				case 2: {
					switch(Bizz::[id][bSettings][7]) {
						case 9: {
							format(string,sizeof(string),"{ffffff}Введите кол-во топлива которое хотите заказать:\n\n"cGRAY"| Топливные резервуары: %d / %d л.",
							Bizz::[id][bSettings][3],MAX_BUSINESS_BURGERS * (1 + Bizz::[id][bUpdate][0]));
							showPlayerDialog(playerid,d_bizz + 19,1," ",string,"Далее","Закрыть");
						}
						default: {
							format(string,sizeof(string),"{ffffff}Введите кол-во товаров которое хотите заказать:\n\n"cGRAY"| Складское помещение: %d / %d ед.\n"gbInfo"ВНИМАНИЕ!!! Вы не снимите деньги, пока не выполнят ваш заказ\nа так-же заказывать продукты можно только за 1 раз",
							Bizz::[id][bSettings][3],MAX_BUSINESS_BURGERS * (1 + Bizz::[id][bUpdate][0]));
							showPlayerDialog(playerid,d_bizz + 18,1," ",string,"Далее","Закрыть");
						}
					}
				}
			}
		}
		case d_bizz + 3: {
			if(!response) return 1;
			new id = GetPVarInt(playerid,"PlayerBizzID");
			
			if( !IsOwnerBusiness( id, playerid ) )
				return 1;
				
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_bizz + 2,1," ","{ffffff}Введите в окошко новое название бизнеса:\n\n"cGREEN"| Название бизнеса не должно быть меньше 1 и не больше 16 символов.","Далее","Закрыть");
			if(NonSym(inputtext,16,1)) return showPlayerDialog(playerid,d_bizz + 2,1," ","{ffffff}Введите в окошко новое название бизнеса:\n\n"cGREEN"| Название бизнеса не должно быть меньше 1 и не больше 16 символов.","Далее","Закрыть");
			strmid(Bizz::[id][bName], inputtext, 0, strlen(inputtext), 31);
		    SetBizzStr(Bizz::[id][bID],"bName",Bizz::[id][bName]);
		   	switch(Bizz::[id][bSettings][7]) {
		   		case 0: format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nЗакусочная "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[id][bID],Bizz::[id][bName],Bizz::[id][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
        		case 1: format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nБар "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[id][bID],Bizz::[id][bName],Bizz::[id][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
        		case 2: format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nРесторан "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[id][bID],Bizz::[id][bName],Bizz::[id][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
        		case 3: format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nМагазин одежды "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[id][bID],Bizz::[id][bName],Bizz::[id][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
        		case 4: format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nМагазин электроники "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[id][bID],Bizz::[id][bName],Bizz::[id][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
        		case 5: format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nАвтосалон "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[id][bID],Bizz::[id][bName],Bizz::[id][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
        		case 6: format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nМагазин оружия "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[id][bID],Bizz::[id][bName],Bizz::[id][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
        		case 7: format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nМагазин мебели "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[id][bID],Bizz::[id][bName],Bizz::[id][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
        		case 8: format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nКлуб "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[id][bID],Bizz::[id][bName],Bizz::[id][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
        		case 9: format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nЗаправка "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[id][bID],Bizz::[id][bName],Bizz::[id][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
        		case 10: format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nВсе для отдыха "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[id][bID],Bizz::[id][bName],Bizz::[id][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
        		case 11: format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nАренда транспорта "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[id][bID],Bizz::[id][bName],Bizz::[id][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
                case 12: format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nСпортзал "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[id][bID],Bizz::[id][bName],Bizz::[id][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
			}
			UpdateDynamic3DTextLabelText(Bizz::[id][bText],C_BLUE,string);
			return 1;
		}
		case d_bizz + 4: {
			if(!response) return 1;
			new id = GetPVarInt(playerid,"PlayerBizzID");
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_bizz + 4,1," ","{ffffff}Введите цену:\n\n"cGREEN"| Минимальная цена $1 и максимальная $5","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_bizz + 4,1," ","{ffffff}Введите цену:\n\n"cGREEN"| Минимальная цена $1 и максимальная $5","Далее","Закрыть");
			if(strval(inputtext) < 1 || strval(inputtext) > 5) return showPlayerDialog(playerid,d_bizz + 4,1," ","{ffffff}Введите цену:\n\n"cGREEN"| Минимальная цена $1 и максимальная $5","Далее","Закрыть");
			Bizz::[id][bSettings][5] = strval(inputtext);
			format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[id][bSettings][0],Bizz::[id][bSettings][1],Bizz::[id][bSettings][2],
			Bizz::[id][bSettings][3],Bizz::[id][bSettings][4],Bizz::[id][bSettings][5],Bizz::[id][bSettings][6],Bizz::[id][bSettings][7]);
			SetBizzStr(Bizz::[id][bID],"bSettings",string);
			GameTextForPlayer(playerid, "~g~Updated", 5000, 1);
			return 1;
		}
		case d_bizz + 5: {
			if(!response) return 1;
			new id = GetPVarInt(playerid,"PlayerBizzID");
			
			if( !IsOwnerBusiness( id, playerid ) )
				return 1;
				
			switch(listitem) {
				case 0: showPlayerDialog(playerid,d_bizz + 6,1," ","{ffffff}Введите сумму которую вы хотите положить в сейф:","Далее","Закрыть");
				case 1: {
					format(string,sizeof(string),"{ffffff}В сейфе бизнеса - "cGREEN"$%d\n\n{ffffff}Введите сумму которую хотите снять:",Bizz::[id][bSettings][6]);
					showPlayerDialog(playerid,d_bizz + 7,1," ",string,"Далее","Закрыть");
				}
			}
		}
		case d_bizz + 6: {
			if(!response) return 1;
			new id = GetPVarInt(playerid,"PlayerBizzID");
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_bizz + 6,1," ","{ffffff}Введите сумму которую вы хотите положить в сейф:","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_bizz + 6,1," ","{ffffff}Введите сумму которую вы хотите положить в сейф:","Далее","Закрыть");
			if(strval(inputtext) < 1 || strval(inputtext) > 1000000) return showPlayerDialog(playerid,d_bizz + 6,1," ","{ffffff}Введите сумму которую вы хотите положить в сейф:","Далее","Закрыть");
			if(Player[playerid][uMoney] < strval(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"У вас недостаточно средств для того, чтобы положить их в сейф.");
			Player[playerid][uMoney] -= strval(inputtext);
			format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
			Bizz::[id][bSettings][6] += strval(inputtext);
			format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[id][bSettings][0],Bizz::[id][bSettings][1],Bizz::[id][bSettings][2],
			Bizz::[id][bSettings][3],Bizz::[id][bSettings][4],Bizz::[id][bSettings][5],Bizz::[id][bSettings][6],Bizz::[id][bSettings][7]);
			SetBizzStr(Bizz::[id][bID],"bSettings",string);
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы успешно положили деньги в сейф бизнеса.");
			MeAction(playerid,"положил(-а) деньги в сейф",1);
			return 1;
		}
		case d_bizz + 7: {
			if(!response) return 1;
			new id = GetPVarInt(playerid,"PlayerBizzID");
			
			if( !IsOwnerBusiness( id, playerid ) )
				return 1;
				
			if(!strlen(inputtext)) {
				format(string,sizeof(string),"{ffffff}В сейфе бизнеса - "cGREEN"$%d\n\n{ffffff}Введите сумму которую хотите снять:",Bizz::[id][bSettings][6]);
				return showPlayerDialog(playerid,d_bizz + 7,1," ",string,"Далее","Закрыть");
			}
			if(!isNumeric(inputtext)) {
				format(string,sizeof(string),"{ffffff}В сейфе бизнеса - "cGREEN"$%d\n\n{ffffff}Введите сумму которую хотите снять:",Bizz::[id][bSettings][6]);
				return showPlayerDialog(playerid,d_bizz + 7,1," ",string,"Далее","Закрыть");
			}
			if(strval(inputtext) < 1 || strval(inputtext) > 1000000) {
				format(string,sizeof(string),"{ffffff}В сейфе бизнеса - "cGREEN"$%d\n\n{ffffff}Введите сумму которую хотите снять:",Bizz::[id][bSettings][6]);
				return showPlayerDialog(playerid,d_bizz + 7,1," ",string,"Далее","Закрыть");
			}
			if(Bizz::[id][bSettings][6] < strval(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"В сейфе бизнеса нет такого кол-ва денег.");
			if(Bizz::[id][bProds] == true) return SendClientMessage(playerid,C_GRAY,""gbError"На момент заказа, деньги снять нельзя.");
			Bizz::[id][bSettings][6] -= strval(inputtext);
			Player[playerid][uMoney] += strval(inputtext);
			format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
			format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[id][bSettings][0],Bizz::[id][bSettings][1],Bizz::[id][bSettings][2],
			Bizz::[id][bSettings][3],Bizz::[id][bSettings][4],Bizz::[id][bSettings][5],Bizz::[id][bSettings][6],Bizz::[id][bSettings][7]);
			SetBizzStr(Bizz::[id][bID],"bSettings",string);
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы успешно взяли деньги из сейфа бизнеса.");
			MeAction(playerid,"взял(-а) деньги из сейфа",1);
			return 1;
		}
		case d_bizz + 8: {// Pokupka Vovanm93
			if(!response) {
				SetPVarInt(playerid,"playerSelectBuyingSlot",-1);
			    return 1;
			}
			new id = GetPVarInt(playerid,"PlayerBizzID");
			if(Player[playerid][uMoney] < Bizz::[id][bProdItems][GetPVarInt(playerid,"playerSelectBuyingSlot")] * Bizz::[id][bSettings][5]) return SendClientMessage(playerid,C_GRAY,""gbError"У вас недостаточно средств для покупки этого!");

			switch(Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")]) {
			    //324, 473, 325, 476, 480
			    case 322, 323, 326, 327, 329..338, 387..392:
				//case 322, 323, 326.338, 340, 342..348, 350..392:
				{
			        if(Player[playerid][uLicenses][3] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"Для покупки оружия, вам необходима лицензия!");
			    }
			}

			if(Bizz::[id][bSettings][7] != 9) {
				if(Bizz::[id][bSettings][3] < Bizz::[id][bProdItems][GetPVarInt(playerid,"playerSelectBuyingSlot")])
				{
				    if(Bizz::[id][bRating] > 0) Bizz::[id][bRating]--;
				    SetBizzInt(Bizz::[id][bID],"bRate", Bizz::[id][bRating]);
				    return SendClientMessage(playerid,C_GRAY,""gbError"В бизнесе закончились товары!");
				}
				Bizz::[id][bSettings][3] -= Bizz::[id][bProdItems][GetPVarInt(playerid,"playerSelectBuyingSlot")];
			}

			Player[playerid][uMoney] -= Bizz::[id][bProdItems][GetPVarInt(playerid,"playerSelectBuyingSlot")] * Bizz::[id][bSettings][5];
            format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, query, "", "");

			if(!strcmp(Bizz::[id][bOwner],"None",true)) {}
			else Bizz::[id][bSettings][6] += Bizz::[id][bProdItems][GetPVarInt(playerid,"playerSelectBuyingSlot")] * Bizz::[id][bSettings][5];
			format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[id][bSettings][0],Bizz::[id][bSettings][1],Bizz::[id][bSettings][2],
			Bizz::[id][bSettings][3],Bizz::[id][bSettings][4],Bizz::[id][bSettings][5],Bizz::[id][bSettings][6],Bizz::[id][bSettings][7]);
			SetBizzStr(Bizz::[id][bID],"bSettings",string);

			switch(Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")]) {
				case 393 .. 401: {
					if(Player[playerid][uNumber] == 0)
					{
						Player[playerid][uNumber] = random(999999);
						format(string,sizeof(string),""gbAccess"Вы купили телефон, ваш номер телефона - "cBLUE"%d",Player[playerid][uNumber]);
						SendClientMessage(playerid,C_GRAY,string);
						nowUpdateInfo(playerid , "d" , "gb_users" , "uName" , "uNumber" , Player[playerid][uNumber]);
					}
					GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],1);
				}
				case 470: GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],20);
				case 477: GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],10);
				case 469: GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],1);
				//Bizz::[cBizz][bItems][9] = 341; Bizz::[cBizz][bProdItems][9] = 300;
				case 457: GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],1);
				case 321 .. 325: GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],1);
			    case 326: GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],100);
			    case 327,328: GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],1);
			    case 329 .. 338: GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],0);
			    case 339 .. 341: GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],200);

				case 387 .. 389: GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],15);
			    case 390: GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],40);
			    case 391,392: GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],90);
			    case 515,516: GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],20);
				//case 134:
				default: GivePlayerItem(playerid,Bizz::[id][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")],1);
			}
            MeAction(playerid,"купил(-а) что-то",1);
            if(Bizz::[id][bRating] < 5000) Bizz::[id][bRating]++;
            SetBizzInt(Bizz::[id][bID],"bRate", Bizz::[id][bRating]);
			SetPVarInt(playerid,"playerSelectBuyingSlot",-1);
		}
		case d_bizz + 9: {
			if(!response) {
				SetPVarInt(playerid,"playerSelectBuyingSlot",-1);
			    return 1;
			}
			new id = GetPVarInt(playerid,"PlayerBizzID");
			if(Player[playerid][uMoney] < PlayerBuyingItemsShopProd[playerid][GetPVarInt(playerid,"playerSelectBuyingSlot")] * Bizz::[id][bSettings][5]) return SendClientMessage(playerid,C_GRAY,""gbError"У вас недостаточно средств для покупки этого!");
			if(Bizz::[id][bSettings][3] < PlayerBuyingItemsShopProd[playerid][GetPVarInt(playerid,"playerSelectBuyingSlot")]) return SendClientMessage(playerid,C_GRAY,""gbError"В бизнесе закончились товары!");
			Bizz::[id][bSettings][3] -= PlayerBuyingItemsShopProd[playerid][GetPVarInt(playerid,"playerSelectBuyingSlot")];
			Player[playerid][uMoney] -= PlayerBuyingItemsShopProd[playerid][GetPVarInt(playerid,"playerSelectBuyingSlot")] * Bizz::[id][bSettings][5];
            format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, query, "", "");

			if(!strcmp(Bizz::[id][bOwner],"None",true)) {}
			else Bizz::[id][bSettings][6] += PlayerBuyingItemsShopProd[playerid][GetPVarInt(playerid,"playerSelectBuyingSlot")] * Bizz::[id][bSettings][5];
			if(Bizz::[id][bRating] < 5000) Bizz::[id][bRating]++;
			format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[id][bSettings][0],Bizz::[id][bSettings][1],Bizz::[id][bSettings][2],
			Bizz::[id][bSettings][3],Bizz::[id][bSettings][4],Bizz::[id][bSettings][5],Bizz::[id][bSettings][6],Bizz::[id][bSettings][7]);
			SetBizzStr(Bizz::[id][bID],"bSettings",string);
			GivePlayerItem(playerid,PlayerBuyingItemsShop[playerid][GetPVarInt(playerid,"playerSelectBuyingSlot")], 1);
			SetPVarInt(playerid,"playerSelectBuyingSlot",-1);
			MeAction(playerid,"купил(-а) что-то",1);
		}
		case d_bizz + 18: {
			if(!response) return 1;
			new id = GetPVarInt(playerid,"PlayerBizzID");
			if(!strlen(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Неверное кол-во товаров на заказ!");
			if(strval(inputtext) < 1000 || strval(inputtext) + Bizz::[id][bSettings][3] > MAX_BUSINESS_BURGERS * (1 + Bizz::[id][bUpdate][0])) return SendClientMessage(playerid,C_GRAY,""gbError"Неверное кол-во товаров на заказ!");
			if(Bizz::[id][bSettings][6] < strval(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Недостаточно денег для оплаты товаров! ( Положите деньги в сейф бизнеса )");
			if(Bizz::[id][bProds] == true) return SendClientMessage(playerid,C_GRAY,""gbError"Подождите, пока выполнят ваш предыдущий заказ");
			new bool:count = false;
			for(new i; i != 20; i ++) {
			    if(Product::[i][bID] == 0 && Product::[i][bCount] == 0) {
			        Product::[i][bID] = id;
			        Product::[i][bCount] = strval(inputtext);
			        Product::[i][bStatus] = false;
					Bizz::[id][bProds] = true;
			        SendClientMessage(playerid,C_GRAY,""gbAccess"Вы заказали товары в свой бизнес!");
			        count = true;
			        break;
			    }
			}
			if(count == false) SendClientMessage(playerid,C_GRAY,""gbError"Простите, но больше места под заказы нет!");
		}
		case d_bizz + 19: {
			if(!response) return 1;
			new id = GetPVarInt(playerid,"PlayerBizzID");
			if(!strlen(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Неверное кол-во топлива на заказ!");
			if(strval(inputtext) < 1000 || strval(inputtext) + Bizz::[id][bSettings][3] > MAX_BUSINESS_BURGERS * (1 + Bizz::[id][bUpdate][0])) return SendClientMessage(playerid,C_GRAY,""gbError"Неверное кол-во топлива на заказ!");
			if(Bizz::[id][bSettings][6] < strval(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Недостаточно денег для оплаты топлива! ( Положите деньги в сейф бизнеса )");

			new bool:count = false;
			for(new i; i != 15; i ++) {
				if(Fuel::[i][bID] == 0 && Fuel::[i][bCount] == 0) {
				    Fuel::[i][bID] = id;
				    Fuel::[i][bCount] = strval(inputtext);
				    Fuel::[i][bStatus] = false;
				    SendClientMessage(playerid,C_GRAY,""gbAccess"Вы заказали топливо в свою АЗС!");
				    count = true;
				    break;
				}
			}
			if(count == false) SendClientMessage(playerid,C_GRAY,""gbError"Простите, но больше места под заказы нет!");
		}
		case d_inventory + 1: 
		{
		    if(!response) 
				return 1;
		   
			format:gb_string( "(( Игрок удалил предмет '%s' ))",
				_itemsInfo[ Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] ][invName]
			);
			
			SetPlayerChatBubble( playerid, gb_string, 0xFFFFFF50, 25.0, 5000 );
					
		    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
        	Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] = 0;
        	PlayerTextDrawSetPreviewModel(playerid, invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")], 19464);
			PlayerTextDrawSetPreviewRot(playerid, invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")], 0.000000, 0.000000, 90.000000, 0.100000);
			PlayerTextDrawShow(playerid,invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")]);
			
			SaveInventory(playerid);
        	SetPVarInt(playerid,"selectSlot",-1);
			SetPVarInt(playerid,"changeSlot",-1);
		}
		case d_inventory+4: {
		    if(!response) return 1;
		    new id = GetPVarInt(playerid, "PlayerTransferDrugs");
		    new money = GetPVarInt(playerid, "PlayerTransferDrugsMoney");

			new Float:kg;
    		for(new g; g != 56; g++) kg += _itemsInfo[ Inv[id][invSlot][g]][invKg];
		    if(kg + _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invKg] > MAX_PLAYER_KG + Player[id][uJobDouble][6]) return SendClientMessage(playerid,C_GRAY,""gbError"Игрок и так слишком много несет с собой!");



			if(Player[playerid][uMoney] < money) return SendClientMessage(id,C_GRAY,""gbError"У игрока не достаточно денег!");

            format(string,sizeof(string),"INSERT INTO `transfer_inv` (NameOne,NameTwo,AccountIDOne,AccountIDTwo,Money,invID) VALUES ('%s','%s','%d','%d','%d','%d')", Player[playerid][uName], Player[id][uName], Player[playerid][uID], Player[id][uID], money, Inv[id][invSlot][GetPVarInt(id,"selectSlot")]);
			mysql_tquery(1, string, "", "");

            PlayerTextDrawSetPreviewModel(id, invSPlayer[id][GetPVarInt(id,"selectSlot")], 19464);
			PlayerTextDrawSetPreviewRot(id, invSPlayer[id][GetPVarInt(id,"selectSlot")], 0.000000, 0.000000, 90.000000, 0.100000);
			PlayerTextDrawShow(id, invSPlayer[id][GetPVarInt(id,"selectSlot")]);

			GivePlayerItem(playerid, Inv[id][invSlot][GetPVarInt(id,"selectSlot")], Inv[id][invSlotKol][GetPVarInt(id,"selectSlot")]);
			Inv[id][invSlot][GetPVarInt(id,"selectSlot")] = 0;
			Inv[id][invSlotKol][GetPVarInt(id,"selectSlot")] = 0;


			//logs( 11, "продал игроку", Player[id][uID], Player[playerid][uID], ,money );

			format(string,sizeof(string),"продал(-а) что-то %s",Player[playerid][uName]);
			MeAction(id,string,1);
			format(string,sizeof(string),"взял(-а) что-то от %s",Player[id][uName]);
			MeAction(playerid,string,1);

			Player[playerid][uMoney] -= money;
		 	format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, query, "", "");

			Player[id][uMoney] += money;
		 	format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[id][uMoney],Player[id][uName]);
			mysql_tquery(1, query, "", "");

			SetPVarInt(id,"selectSlot",-1);
			SetPVarInt(id,"changeSlot",-1);

			SaveInventory(playerid);
			SaveInventory(id);
		}
		case d_inventory+3: {
		    if(!response) return 1;
		    new id = GetPVarInt(playerid, "PlayerTrasferDrugsTwo");
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_inventory+3,1," ","{ffffff}Введите стоимость для продажи вещи:\n\n"cGREEN"| Человек должен находиться рядом с вами.","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_inventory+3,1," ","{ffffff}Введите стоимость для продажи вещи:\n\n"cGREEN"| Человек должен находиться рядом с вами.","Далее","Закрыть");
            if(strval(inputtext) < 1 || strval(inputtext) > 10000) {
			    SendClientMessage(playerid,C_GRAY,""gbAccess"Указывайте стоимость 1 до 10000.");
				return showPlayerDialog(playerid,d_inventory+3,1," ","{ffffff}Введите стоимость для продажи вещи:\n\n"cGREEN"| Человек должен находиться рядом с вами.","Далее","Закрыть");
			}

			SetPVarInt(id, "PlayerTransferDrugs", playerid);
            SetPVarInt(id, "PlayerTransferDrugsMoney", strval(inputtext));
            format(string, sizeof(string), ""gbInfo"%s[%d] предлагает Вам купить:\n"gbAccess"[ %s ] за "cGREEN"%d$\n\nВы хотите купить данный предмет ?", Player[playerid][uName], playerid,_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invName], strval(inputtext));
            showPlayerDialog(id,d_inventory+4,0," ",string,"Да","Нет");

		}
		case d_inventory+2: {
			if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_inventory+2,1," ","{ffffff}Введите ID человека, которому хотите продать предмет:\n\n"cGREEN"| Человек должен находиться рядом с вами.\n"cRED"Не закрывайте инвентарь, до соглашения о продаже","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_inventory+2,1," ","{ffffff}Введите ID человека, которому хотите продать предмет:\n\n"cGREEN"| Человек должен находиться рядом с вами.\n"cRED"Не закрывайте инвентарь, до соглашения о продаже","Далее","Закрыть");
			if(!IsPlayerConnected(strval(inputtext))) return showPlayerDialog(playerid,d_inventory+2,1," ","{ffffff}Введите ID человека, которому хотите продать предмет:\n\n"cGREEN"| Человек должен находиться рядом с вами.\n"cRED"Не закрывайте инвентарь, до соглашения о продаже","Далее","Закрыть");
			if(GetDistanceBetweenPlayers(playerid,strval(inputtext)) > 3.0) return showPlayerDialog(playerid,d_inventory+2,1," ","{ffffff}Введите ID человека, которому хотите продать предмет:\n\n"cGREEN"| Человек должен находиться рядом с вами.\n"cRED"Не закрывайте инвентарь, до соглашения о продаже","Далее","Закрыть");
			SetPVarInt(playerid, "PlayerTrasferDrugsTwo", strval(inputtext));
			showPlayerDialog(playerid,d_inventory+3,1," ","{ffffff}Введите стоимость для продажи вещи:\n\n"cGREEN"| Человек должен находиться рядом с вами.","Далее","Закрыть");
		}
		case d_inventory: {
			if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_inventory,1," ","{ffffff}Введите ID человека, которому хотите передать предмет:\n\n"cGREEN"| Человек должен находиться рядом с вами.","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_inventory,1," ","{ffffff}Введите ID человека, которому хотите передать предмет:\n\n"cGREEN"| Человек должен находиться рядом с вами.","Далее","Закрыть");
			if(!IsPlayerConnected(strval(inputtext))) return showPlayerDialog(playerid,d_inventory,1," ","{ffffff}Введите ID человека, которому хотите передать предмет:\n\n"cGREEN"| Человек должен находиться рядом с вами.","Далее","Закрыть");
			if(GetDistanceBetweenPlayers(playerid,strval(inputtext)) > 3.0) return showPlayerDialog(playerid,d_inventory,1," ","{ffffff}Введите ID человека, которому хотите передать предмет:\n\n"cGREEN"| Человек должен находиться рядом с вами.","Далее","Закрыть");
			
		
			switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invID]) 
			{
				case 65 .. 80,90,91,97,103,340,462: return SendClientMessage(playerid,C_GRAY,""gbError"Данный предмет нельзя выкидывать/передавать/складывать!");
				case 158: {
					if( GetPVarInt( playerid, "use_slot_9" ) == 158 ) return SendClientMessage( playerid, C_GRAY, ""gbError"Вы не можете передать предмет вы его используете!" );
				}
				case 156: {
					if( GetPVarInt( playerid, "use_slot_9" ) == 156 ) return SendClientMessage( playerid, C_GRAY, ""gbError"Вы не можете передать предмет вы его используете!" );
				}
			}
			
			switch( Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] )
			{
				case 434, 523, 524 : 
				{
					if( Player[strval(inputtext)][uMember] != 5 || Player[strval(inputtext)][uIsPlayerJob][2] == 0 )
						return SendMes( playerid, -1, ""gbAccess"Данный предмет можно передать только своим коллегам." );
				}
			}
			
			new id = strval(inputtext);
			new Float:kg;
    		for(new g; g != 56; g++) kg += _itemsInfo[ Inv[id][invSlot][g] ][invKg];
			if(kg + _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invKg] > MAX_PLAYER_KG + Player[id][uJobDouble][6]) return SendClientMessage(playerid,C_GRAY,""gbError"Игрок и так сильно много несёте с собой!");


            PlayerTextDrawSetPreviewModel(playerid, invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")], 19464);
			PlayerTextDrawSetPreviewRot(playerid, invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")], 0.000000, 0.000000, 90.000000, 0.100000);
			PlayerTextDrawShow(playerid, invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")]);
			GivePlayerItem(id, Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")], Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]);
			Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] = 0;
			Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;



			format(string,sizeof(string),"передал%s что-то %s", 
				Player[playerid][uSex] == 1 ? ("") : ("а"),
				Player[id][uName]
			);
			
			MeAction(playerid,string,1);
			format(string,sizeof(string),"взял%s что-то от %s",
				Player[id][uSex] == 1 ? ("") : ("а"),
				Player[playerid][uName]
			);
			
			MeAction(id,string,1);

			SetPVarInt(playerid,"selectSlot",-1);
			SetPVarInt(playerid,"changeSlot",-1);

			SaveInventory(playerid);
			SaveInventory(id);
		}
		case d_fill: {
			if(!response) return 1;
			new id = GetPVarInt(playerid,"PlayerBizzID");
			if(!strlen(inputtext)) {
				format(string,sizeof(string),"{ffffff}Введите кол-во топлива, которое хотите заправить:\n\nСтоимость 1 литра: "cGREEN"$%d{ffffff}\nМаскимальное кол-во топлива: "cGREEN"%.0f{ffffff}",
				Bizz::[id][bSettings][5],MaxVehicleFuel[GetVehicleModel(GetPlayerVehicleID(playerid)) - 400] - V::[GetPlayerVehicleID(playerid)][vFuel]);
				showPlayerDialog(playerid,d_fill,1," ",string,"Далее","Закрыть");
				return 1;
			}
			if(!isNumeric(inputtext)) {
				format(string,sizeof(string),"{ffffff}Введите кол-во топлива, которое хотите заправить:\n\nСтоимость 1 литра: "cGREEN"$%d{ffffff}\nМаскимальное кол-во топлива: "cGREEN"%.0f{ffffff}",
				Bizz::[id][bSettings][5],MaxVehicleFuel[GetVehicleModel(GetPlayerVehicleID(playerid)) - 400] - V::[GetPlayerVehicleID(playerid)][vFuel]);
				showPlayerDialog(playerid,d_fill,1," ",string,"Далее","Закрыть");
				return 1;
			}
			if(strval(inputtext) < 1 || strval(inputtext) > MaxVehicleFuel[GetVehicleModel(GetPlayerVehicleID(playerid)) - 400] - V::[GetPlayerVehicleID(playerid)][vFuel]) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но такое кол-во топлива не влезет вам в бак!");
			if(Player[playerid][uMoney] < strval(inputtext) * Bizz::[id][bSettings][5]) return SendClientMessage(playerid,C_GRAY,""gbError"У вас недостаточно средств для покупки топлива!");
			if(Bizz::[id][bSettings][3] < strval(inputtext))
			{
			    if(Bizz::[id][bRating] > 0) Bizz::[id][bRating]--;
			    SetBizzInt(Bizz::[id][bID],"bRate", Bizz::[id][bRating]);
			    return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но на этой АЗС закончилось толиво!");
			}
			Player[playerid][uMoney] -= strval(inputtext) * Bizz::[id][bSettings][5];
			format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
			Bizz::[id][bSettings][3] -= strval(inputtext);

			if(!strcmp(Bizz::[id][bOwner],"None",true)) {}
			else Bizz::[id][bSettings][6] += strval(inputtext) * Bizz::[id][bSettings][5];

			V::[GetPlayerVehicleID(playerid)][vFuel] += floatstr(inputtext);
			format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[id][bSettings][0],Bizz::[id][bSettings][1],Bizz::[id][bSettings][2],
			Bizz::[id][bSettings][3],Bizz::[id][bSettings][4],Bizz::[id][bSettings][5],Bizz::[id][bSettings][6],Bizz::[id][bSettings][7]);
			SetBizzStr(Bizz::[id][bID],"bSettings",string);
			if(Bizz::[id][bRating] < 5000) Bizz::[id][bRating]++;
			SetBizzInt(Bizz::[id][bID],"bRate", Bizz::[id][bRating]);
		}
		case d_frac+35:
		{
		    if(!response) return 1;
			switch(listitem)
			{
		    	case 0: showPlayerDialog(playerid,d_frac + 4,2," ","1. "cGRAY"Принять человека в организацию{ffffff}\n2. "cGRAY"Уволить человека из организации{ffffff}\n3. "cGRAY"Повысить/Понизить человека в должности{ffffff}\n4. "cGRAY"Показать полный список сотрудников","Далее","Закрыть");
				case 1:
				{
					switch(Player[playerid][uLeader])
					{
						case 1,2: showPlayerDialog(playerid,d_frac + 1,2," ","1. "cGRAY"Управление рангами организации{ffffff}\n3. "cGRAY"Настройки полномочий{ffffff}\n2. "cGRAY"Управление оружием организации","Далее","Закрыть");
						default: showPlayerDialog(playerid,d_frac + 1,2," ","1. "cGRAY"Управление рангами организации","Далее","Закрыть");
					}
				}
				case 2:
				{
				    if(F::[Player[playerid][uMember]][fRank][4] > Player[playerid][uRank]) return SendClientMessage(playerid, -1, ""gbError"У вас нет полномочий!");
					switch(Player[playerid][uMember])
					{
						case 1: {
							for(new i; i <= MAX_VEHICLES; i ++) {
								if(i >= sherifcar[0] && i <= sherifcar[1]) {
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
								}
								if(vehiclecallsign[i] == 1)
								{
								    if(IsValidDynamic3DTextLabel(vehicle3Dtext[i]))
								    {
						 				DestroyDynamic3DTextLabel(vehicle3Dtext[i]);
										vehicle3Dtext[i] = Text3D: INVALID_3DTEXT_ID; 
									   	vehiclecallsign[i] = 0;
									}
								}
							}
						}
						case 2:
						{
							for(new i; i <= MAX_VEHICLES; i ++)
							{
								if(i >= lspdcars[0] && i <= lspdcars[1])
								{
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
									if(vehiclecallsign[i] == 1)
									{
                                        if(IsValidDynamic3DTextLabel(vehicle3Dtext[i]))
									    {
							 				DestroyDynamic3DTextLabel(vehicle3Dtext[i]);
											vehicle3Dtext[i] = Text3D: INVALID_3DTEXT_ID;
										   	vehiclecallsign[i] = 0;
										}
									}
								}
							}
						}
						case 3: {
							for(new i; i <= MAX_VEHICLES; i ++) {
								if(i >= medicalcar[0] && i <= medicalcar[1])
								{
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
								}
								if(vehiclecallsign[i] == 1)
								{
					 				if(IsValidDynamic3DTextLabel(vehicle3Dtext[i]))
								    {
						 				DestroyDynamic3DTextLabel(vehicle3Dtext[i]);
										vehicle3Dtext[i] = Text3D: INVALID_3DTEXT_ID;
									   	vehiclecallsign[i] = 0;
									}
								}
							}
						}
						case 4: {
							for(new i; i <= MAX_VEHICLES; i ++) {
								if(i >= smicars[0] && i <= smicars[1]) {
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
								}
							}
						}
						case 5:
						{
							for(new i; i <= MAX_VEHICLES; i ++)
							{
								if(i >= fd_cars[0] && i <= fd_cars[1])
								{
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
									if(vehiclecallsign[i] == 1)
									{
								 		if(IsValidDynamic3DTextLabel(vehicle3Dtext[i]))
									    {
							 				DestroyDynamic3DTextLabel(vehicle3Dtext[i]);
										   	vehiclecallsign[i] = 0;
										}
									}
								}
							}
						}
						case 6: {
							for(new i; i <= MAX_VEHICLES; i ++) {
								if(i >= meria[0] && i <= meria[1]) {
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
								}
							}
						}
						case 7: {
							for(new i; i <= MAX_VEHICLES; i ++) {
								if(i >= comm[0] && i <= comm[1]) {
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
								}
							}
						}
						case 8: {
							for(new i; i <= MAX_VEHICLES; i ++) {
								if(i >= sasd_car[0] && i <= sasd_car[1]) {
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
								}
								if(vehiclecallsign[i] == 1)
								{
								    if(IsValidDynamic3DTextLabel(vehicle3Dtext[i]))
								    {
						 				DestroyDynamic3DTextLabel(vehicle3Dtext[i]);
										vehicle3Dtext[i] = Text3D: INVALID_3DTEXT_ID;
									   	vehiclecallsign[i] = 0;
									}
								}
							}
						}
						default: {}
					}
					SendClientMessage(playerid,C_GRAY,""gbAccess"Вы заспавнили не используемый транспорт вашей фракции!");
				}
			}
		}
		case d_frac:
		{
			if(!response) return 1;
			switch(listitem)
			{
				case 0:
				{
				    string = "";
				    strcat(string, "1. "cGRAY"Принять человека в организацию{ffffff}\n");
				    strcat(string, "2. "cGRAY"Уволить человека из организации{ffffff}\n");
				    strcat(string, "3. "cGRAY"Повысить/Понизить человека в должности{ffffff}\n");
				    strcat(string, "4. "cGRAY"Показать полный список сотрудников{ffffff}\n");
				    if( Player[playerid][uMember] != 7 ) strcat(string, "5. "cGRAY"Изменить подфракцию{ffffff}");
				    showPlayerDialog(playerid,d_frac + 4,2," ",string,"Далее","Закрыть");
				}

				case 1:
				{
					switch(Player[playerid][uLeader])
					{
						case 1,2,8: showPlayerDialog(playerid,d_frac + 1,2," ","1. "cGRAY"Управление рангами организации{ffffff}\n2. "cGRAY"Настройка полномочий{ffffff}\n3. "cGRAY"Управление оружием организации","Далее","Закрыть");
						default: showPlayerDialog(playerid,d_frac + 1,2," ","1. "cGRAY"Управление рангами организации{ffffff}\n2. "cGRAY"Настройка полномочий{ffffff}","Далее","Закрыть");
					}
				}
				case 2:
				{
				    if(F::[Player[playerid][uMember]][fRank][4] > Player[playerid][uRank]) return SendClientMessage(playerid, -1, ""gbError"У вас нет полномочий!");
					switch(Player[playerid][uMember]) {
						case 1: {
							for(new i; i <= MAX_VEHICLES; i ++) {
								if(i >= sherifcar[0] && i <= sherifcar[1]) {
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
								}
								if(vehiclecallsign[i] == 1)
								{
					 				if(IsValidDynamic3DTextLabel(vehicle3Dtext[i]))
								    {
						 				DestroyDynamic3DTextLabel(vehicle3Dtext[i]);
									   	vehiclecallsign[i] = 0;
									}
								}
							}
						}
						case 2: {
							for(new i; i <= MAX_VEHICLES; i ++) {
								if(i >= lspdcars[0] && i <= lspdcars[1]) {
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
									if(vehiclecallsign[i] == 1)
									{
								 		if(IsValidDynamic3DTextLabel(vehicle3Dtext[i]))
									    {
							 				DestroyDynamic3DTextLabel(vehicle3Dtext[i]);
											vehicle3Dtext[i] = Text3D: INVALID_3DTEXT_ID;
										   	vehiclecallsign[i] = 0;
										}
									}
								}
							}
						}
						case 3: {
							for(new i; i <= MAX_VEHICLES; i ++)
							{
								if(i >= medicalcar[0] && i <= medicalcar[1])
								{
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
								}
								if(vehiclecallsign[i] == 1)
								{
					 				if(IsValidDynamic3DTextLabel(vehicle3Dtext[i]))
								    {
						 				DestroyDynamic3DTextLabel(vehicle3Dtext[i]);
									   	vehiclecallsign[i] = 0;
									}
								}
							}
						}
						case 4: {
							for(new i; i <= MAX_VEHICLES; i ++) {
								if(i >= smicars[0] && i <= smicars[1]) {
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
								}
							}
						}
						case 5:
						{
							for(new i; i <= MAX_VEHICLES; i ++)
							{
								if(i >= fd_cars[0] && i <= fd_cars[1])
								{
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
								}
								if(vehiclecallsign[i] == 1)
								{
					 				if(IsValidDynamic3DTextLabel(vehicle3Dtext[i]))
								    {
						 				DestroyDynamic3DTextLabel(vehicle3Dtext[i]);
										vehicle3Dtext[i] = Text3D: INVALID_3DTEXT_ID;
									   	vehiclecallsign[i] = 0;
									}
								}
							}
						}
						case 6: {
							for(new i; i <= MAX_VEHICLES; i ++) {
								if(i >= meria[0] && i <= meria[1]) {
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
								}
							}
						}
						case 7: {
							for(new i; i <= MAX_VEHICLES; i ++) {
								if(i >= comm[0] && i <= comm[1]) {
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
								}
							}
						}
						case 8: {
							for(new i; i <= MAX_VEHICLES; i ++) {
								if(i >= sasd_car[0] && i <= sasd_car[1]) {
									if(!IsVehicleOccupied(i)) SetVehicleToRespawn(i);
								}
								if(vehiclecallsign[i] == 1)
								{
					 				if(IsValidDynamic3DTextLabel(vehicle3Dtext[i]))
								    {
						 				DestroyDynamic3DTextLabel(vehicle3Dtext[i]);
										vehicle3Dtext[i] = Text3D: INVALID_3DTEXT_ID;
									   	vehiclecallsign[i] = 0;
									}
								}
							}
							
						}
						default: {}
					}
					SendClientMessage(playerid,C_GRAY,""gbAccess"Вы заспавнили не используемый транспорт вашей фракции!");
				}
				case 3:
				{
					if(Player[playerid][uLeader]) showPlayerDialog(playerid,d_meria,2,"Управление финансами","1. "cGRAY"Информация\n{ffffff}2. "cGRAY"Настройка налогов\n{ffffff}3. "cGRAY"Настройка зарплат\n{ffffff}4. "cGRAY"Цены за проезд\n{ffffff}5. "cGRAY"Настройка налога на прибыль","Далее","Закрыть");
					else SendClientMessage(playerid,C_GRAY,""gbError"Доступно только для лидера!");
				}
				case 4:
				{
					if(Player[playerid][uLeader]) showPlayerDialog(playerid,d_meria+10,2,"Управление ресурсами","1. "cGRAY"Заказ медикаментов\n{ffffff}2. "cGRAY"Заказ оружия","Далее","Закрыть");
					else SendClientMessage(playerid,C_GRAY,""gbError"Доступно только для лидера!");
				}
			}
		}
		case d_frac + 1:
		{
			if(!response) return 1;
			switch(listitem) {
				case 0: {
				    if(Player[playerid][uLeader])
				    {
						switch(Player[playerid][uLeader]) {
							case 4,6,7: {
								string = "";
								for(new i; i != 15; i ++) {
									format(str,sizeof(str),"{ffffff}%i. "cGRAY"%s\n",i + 1,FRank[Player[playerid][uLeader]][i]);
									strcat(string,str);
								}
							}
							default: {
								string = "";
								for(new i; i != 15; i ++) {
									format(str,sizeof(str),"{ffffff}%i. "cGRAY"%s{ffffff} - "cGRAY"%d\n",i + 1,FRank[Player[playerid][uLeader]][i],F::[Player[playerid][uLeader]][fSkins][i]);
									strcat(string,str);
								}
							}
						}
						showPlayerDialog(playerid,d_frac + 2,2," ",string,"Далее","Закрыть");
					}
					else return SendClientMessage(playerid, -1, ""gbError"Доступно только для лидера");
				}
				case 1: {

				    if(Player[playerid][uLeader])
				    {
				        if(Player[playerid][uMember] == 2 || Player[playerid][uMember] == 8 )
				        {
				            new strs[90];
				            format(strs, sizeof(strs), "1. Принять нового члена в организацию - С %d ранга\n", F::[Player[playerid][uMember]][fRank][0]);
				            strcat(string,strs);
				            format(strs, sizeof(strs), "2. Выкинуть члена организации - С %d ранга\n", F::[Player[playerid][uMember]][fRank][1]);
				            strcat(string,strs);
				            format(strs, sizeof(strs), "3. Повысить/понизить в ранг члена организации - С %d ранга\n", F::[Player[playerid][uMember]][fRank][2]);
				            strcat(string,strs);
				            format(strs, sizeof(strs), "4. Смена названия ранга - С %d ранга\n", F::[Player[playerid][uMember]][fRank][3]);
				            strcat(string,strs);
				            format(strs, sizeof(strs), "5. Спавн транспорта - С %d ранга\n", F::[Player[playerid][uMember]][fRank][4]);
				            strcat(string,strs);
				            format(strs, sizeof(strs), "6. Выдача лицензии - С %d ранга", F::[Player[playerid][uMember]][fRank][5]);
				            strcat(string,strs);
				            format(strs, sizeof(strs), "7. Выдача лицензии - С %d ранга", F::[Player[playerid][uMember]][fRank][6]);
				            strcat(string,strs);

							showPlayerDialog(playerid,d_frac + 23,2," ", string,"Далее","Закрыть");
				        }
				        else
				        {
					        format(string, sizeof(string), "1. Принять нового члена в организацию - С %d ранга\n2. Выкинуть члена организации - С %d ранга\n3. Повысить/понизить в ранг члена организации - С %d ранга\n4. Смена названия ранга - С %d ранга\n5. Спавн транспорта - С %d ранга", F::[Player[playerid][uMember]][fRank][0], F::[Player[playerid][uMember]][fRank][1], F::[Player[playerid][uMember]][fRank][2], F::[Player[playerid][uMember]][fRank][3], F::[Player[playerid][uMember]][fRank][4]);
							showPlayerDialog(playerid,d_frac + 23,2," ", string,"Далее","Закрыть");
						}
					}
					else return SendClientMessage(playerid, -1, ""gbError"Доступно только для лидера");
				}
				case 2: {
				    if(strcmp(F::[Player[playerid][uLeader]][fLeader], Player[playerid][uName], true) == 0)
				    {
						string = "";
						for(new i; i != 6; i ++) {
							format(str,sizeof(str),"{ffffff}%i. "cGRAY"%s - С %d ранга\n",i + 1,_itemsInfo[FracGuns[Player[playerid][uMember]][i]][invName],F::[Player[playerid][uMember]][fGuns][i]);
							strcat(string,str);
						}
						showPlayerDialog(playerid,d_frac + 14,2," ",string,"Далее","Закрыть");
                    }
					else return SendClientMessage(playerid, -1, ""gbError"Доступно только для лидера");
				}
			}
		}
		case d_frac + 24: {
		    if(!response) return 1;
   			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_frac + 24, 1, " ",""gbInfo"Укажите ранг с какого будет доступен данный пункт:","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_frac + 24, 1, " ",""gbInfo"Укажите ранг с какого будет доступен данный пункт:","Далее","Закрыть");
			if(strval(inputtext) < 0 || strval(inputtext) > 20) return showPlayerDialog(playerid, d_frac + 24, 1, " ",""gbInfo"Укажите ранг с какого будет доступен данный пункт:","Далее","Закрыть");
			new money = strval(inputtext);
            F::[Player[playerid][uMember]][fRank][GetPVarInt(playerid, "GangRank")] = money;
			format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d", F::[Player[playerid][uMember]][fRank][0], F::[Player[playerid][uMember]][fRank][1], F::[Player[playerid][uMember]][fRank][2], F::[Player[playerid][uMember]][fRank][3], F::[Player[playerid][uMember]][fRank][4], F::[Player[playerid][uMember]][fRank][5], F::[Player[playerid][uMember]][fRank][6]);
            format(query,sizeof(query),"UPDATE gb_frac SET fRank = '%s' WHERE fID = '%d' LIMIT 1", string, Player[playerid][uLeader]);
			mysql_tquery(1, query, "", "");
			DeletePVar(playerid, "GangRank");
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы успешно поменяли полномочия!");
		}

		case d_frac + 23: {
		    if(!response) return 1;
		    switch(listitem) {
		        case 0: {
					format(string, sizeof(string), ""gbInfo"Укажите ранг с какого будет доступен данный пункт:\nТекущее значения на принятие нового члена организации - "cGREEN"%d", F::[Player[playerid][uMember]][fRank][0]);
              		showPlayerDialog(playerid,d_frac + 24, 1, " ", string,"Далее","Закрыть");
					SetPVarInt(playerid, "GangRank", 0);
				}
		        case 1: {
		            format(string, sizeof(string), ""gbInfo"Укажите ранг с какого будет доступен данный пункт:\nТекущее значения на выкидывание члена организации - "cGREEN"%d", F::[Player[playerid][uMember]][fRank][1]);
		            showPlayerDialog(playerid,d_frac + 24, 1, " ", string,"Далее","Закрыть");
					SetPVarInt(playerid, "GangRank", 1);
		        }
		        case 2:
		        {
		            format(string, sizeof(string), ""gbInfo"Укажите ранг с какого будет доступен данный пункт:\nТекущее значения на изменение ранга - "cGREEN"%d", F::[Player[playerid][uMember]][fRank][2]);
		            showPlayerDialog(playerid,d_frac + 24, 1, " ", string,"Далее","Закрыть");
					SetPVarInt(playerid, "GangRank", 2);
		        }
		        case 3:
		        {
		        	format(string, sizeof(string), ""gbInfo"Укажите ранг с какого будет доступен данный пункт:\nТекущее значения на изменение скина - "cGREEN"%d", F::[Player[playerid][uMember]][fRank][3]);
     				showPlayerDialog(playerid,d_frac + 24, 1, " ", string, "Далее", "Закрыть");
					SetPVarInt(playerid, "GangRank", 3);
				}
				case 4:
		        {
		        	format(string, sizeof(string), ""gbInfo"Укажите ранг с какого будет доступен данный пункт:\nТекущее значения на спавн транспорта - "cGREEN"%d", F::[Player[playerid][uMember]][fRank][4]);
     				showPlayerDialog(playerid,d_frac + 24, 1, " ", string, "Далее", "Закрыть");
					SetPVarInt(playerid, "GangRank", 4);
				}
				case 5:
				{
				    format(string, sizeof(string), ""gbInfo"Укажите ранг с какого будет доступен данный пункт:\nТекущее значения на выдачу лицензии - "cGREEN"%d", F::[Player[playerid][uMember]][fRank][5]);
     				showPlayerDialog(playerid,d_frac + 24, 1, " ", string, "Далее", "Закрыть");
					SetPVarInt(playerid, "GangRank", 5);
				}
				case 6:
				{
				    format(string, sizeof(string), ""gbInfo"Укажите ранг с какого будет доступен данный пункт:\nТекущее значения на смену подфракции - "cGREEN"%d", F::[Player[playerid][uMember]][fRank][6]);
     				showPlayerDialog(playerid,d_frac + 24, 1, " ", string, "Далее", "Закрыть");
					SetPVarInt(playerid, "GangRank", 6);
				}
			}
		}

		case d_frac + 2: {
			if(!response) return 1;
			SetPVarInt(playerid,"playerSelectSlotRank",listitem);
			switch(Player[playerid][uLeader]) {
				case 4,6,7: showPlayerDialog(playerid,d_frac + 10,2," ","1. "cGRAY"Сменить название ранга","Далее","Закрыть");
				default: showPlayerDialog(playerid,d_frac + 10,2," ","1. "cGRAY"Сменить название ранга{ffffff}","Далее","Закрыть");
			}
		}
		case d_frac + 3: {
			if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_frac + 3,1," ","{ffffff}Введите новое название для этого ранга: \n\n"cRED"| Название может быть не меньше 1 и не больше 15 символов.\n| В название ранга запрещены любые символы и цифры.","Далее","Закрыть");
			if(isNumeric(inputtext)) return showPlayerDialog(playerid,d_frac + 3,1," ","{ffffff}Введите новое название для этого ранга: \n\n"cRED"| Название может быть не меньше 1 и не больше 15 символов.\n| В название ранга запрещены любые символы и цифры.","Далее","Закрыть");
			if(NonSym(inputtext,48,1)) return showPlayerDialog(playerid,d_frac + 3,1," ","{ffffff}Введите новое название для этого ранга: \n\n"cRED"| Название может быть не меньше 1 и не больше 15 символов.\n| В название ранга запрещены любые символы.","Далее","Закрыть");
			new rank = GetPVarInt(playerid,"playerSelectSlotRank");
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы успешно сменили название текущего ранга!");
			strmid(FRank[Player[playerid][uLeader]][rank], inputtext, 0, strlen(inputtext), 48);
			format(query,sizeof(query),"UPDATE gb_frac SET fRank%d = '%s' WHERE fID = '%d' LIMIT 1",rank + 1,FRank[Player[playerid][uLeader]][rank],Player[playerid][uLeader]);
			mysql_tquery(1, query, "", "");
		}
		case d_frac + 4:
		{
			if(!response) return 1;
			switch(listitem)
			{
				case 0: showPlayerDialog(playerid,d_frac + 5,1," ","{ffffff}Введите ID человека которого хотите принять в организацию:\n\n","Далее","Закрыть");
				case 1: showPlayerDialog(playerid,d_frac + 6,1," ","{ffffff}Введите ID человека которого хотите уволить из организации:\n\n","Далее","Закрыть");
				case 2: showPlayerDialog(playerid,d_frac + 7,1," ","{ffffff}Введите ID человека которого хотите повысить в должности:\n\n","Далее","Закрыть");
				case 3: {
					format(query,sizeof(query),"SELECT uName,uRank FROM gb_users WHERE uMember = '%d' LIMIT 10",Player[playerid][uMember]);
					mysql_tquery(1, query, "MySQLQuery", "dd", playerid, 18);
				}
				case 4:
				{
				    showPlayerDialog(playerid,d_frac + 20,1," ","{ffffff}Введите ID человека которому хотите изменить подфракцию\n\n","Далее","Закрыть");
				}
			}
		}
		case d_frac + 20:
		{
		    if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_frac + 20,1," ","{ffffff}Введите ID человека которому хотите изменить подфракцию\n\n","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_frac + 20,1," ","{ffffff}Введите ID человека которому хотите изменить подфракцию\n\n","Далее","Закрыть");
			if(!IsPlayerConnected(strval(inputtext))) return showPlayerDialog(playerid,d_frac + 20,1," ","{ffffff}Введите ID человека которому хотите изменить подфракцию\n\n"gbError"Игрок вышел из игры","Далее","Закрыть");
			if(Player[strval(inputtext)][uMember] == 0) return showPlayerDialog(playerid,d_frac + 20,1," ","{ffffff}Введите ID человека которому хотите изменить подфракцию\n\n"gbError"Игрок не находится в организации","Далее","Закрыть");
			if(Player[strval(inputtext)][uMember] != Player[playerid][uMember]) showPlayerDialog(playerid,d_frac + 20,1," ","{ffffff}Введите ID человека которому хотите изменить подфракцию\n\n"gbError"Игрок не из Вашей организации","Далее","Закрыть");
			SetPVarInt(playerid,"ChangeIDSubFrac", strval(inputtext));
			showPlayerDialog(playerid,d_frac + 21,1," ","{ffffff}Введите ID подфракции\n\nЧисло от 1 до 4","Далее","Закрыть");

			//format(string, sizeof(string), "%s %s изменил Вашу подфракцию на %d", FRank[Player[playerid][uMember]][Player[playerid][uRank] - 1], Player[playerid][uName], );
			//SendClientMessage

		}
		case d_frac + 21:
		{
		    if(!response) return 1;
		    if(!strlen(inputtext)) showPlayerDialog(playerid,d_frac + 21,1," ","{ffffff}Введите ID подфракции\n\nЧисло от 1 до 4","Далее","Закрыть");
		    if(!isNumeric(inputtext)) showPlayerDialog(playerid,d_frac + 21,1," ","{ffffff}Введите ID подфракции\n\nЧисло от 1 до 4","Далее","Закрыть");
		    if(strval(inputtext) < 0 || strval(inputtext) > 4) showPlayerDialog(playerid,d_frac + 21,1," ","{ffffff}Введите ID подфракции\n\nЧисло от 1 до 4."gbError"Вы ввели некорректное число.","Далее","Закрыть");
			new changeID = GetPVarInt(playerid, "ChangeIDSubFrac");
			Player[changeID][uSubFrac] = strval(inputtext);
			format(string, sizeof(string), ""gbAccess"%s %s изменил Вашу подфракцию на %d.", FRank[Player[playerid][uMember]][Player[playerid][uRank] - 1], Player[playerid][uName], strval(inputtext));
			SendClientMessage(changeID, C_WHITE, string);
			nowUpdateInfo(changeID , "d" , "gb_users" , "uName" , "uSubFrac" , Player[changeID][uSubFrac]);

		}
		case d_frac + 5:
		{
			if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_frac + 5,1," ","{ffffff}Введите ID человека которого хотите принять в организацию:\n\n","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_frac + 5,1," ","{ffffff}Введите ID человека которого хотите принять в организацию:\n\n","Далее","Закрыть");
			if(!IsPlayerConnected(strval(inputtext))) return showPlayerDialog(playerid,d_frac + 5,1," ","{ffffff}Введите ID человека которого хотите принять в организацию:\n\n"gbError"Игрок вышел из игры","Далее","Закрыть");
			if(Player[strval(inputtext)][uMember] != 0) return showPlayerDialog(playerid,d_frac + 5,1," ","{ffffff}Введите ID человека которого хотите принять в организацию:\n\n"gbError"Игро состоит уже во фракции","Далее","Закрыть");
            if(Player[strval(inputtext)][uCrimeM] != 0) return showPlayerDialog(playerid,d_frac + 5,1," ","{ffffff}Введите ID человека которого хотите принять в организацию:\n\n"gbError"Игрок состоит в банде","Далее","Закрыть");
			if(F::[Player[playerid][uMember]][fRank][0] > Player[playerid][uRank]) return showPlayerDialog(playerid,d_frac + 5,1," ","{ffffff}Введите ID человека которого хотите принять в организацию:\n\n"gbError"Не достаточно полномочий","Далее","Закрыть");

			SetPVarInt(strval(inputtext),"playerInviteFrac",Player[playerid][uMember]);
			format(string,sizeof(string),"{ffffff}| Приглашение в организацию:"cGRAY"\n\nЛидер организации - %s\nПриглашает вас в организацию - {%06x}%s",Player[playerid][uName],FracColor[Player[playerid][uMember]] >>> 8,F::[Player[playerid][uMember]][fName]);
			showPlayerDialog(strval(inputtext),d_frac + 9,0," ",string,"Далее","Закрыть");
			SendClientMessage(playerid,C_GRAY,""gbInfo"Вы пригласили кого-то в свою организацию, ожидайте ответа!");
		}
		case d_frac + 6: {
			if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_frac + 6,1," ","{ffffff}Введите ID человека которого хотите уволить из организации:\n\n","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_frac + 6,1," ","{ffffff}Введите ID человека которого хотите уволить из организации:\n\n","Далее","Закрыть");
			if(!IsPlayerConnected(strval(inputtext))) return showPlayerDialog(playerid,d_frac + 6,1," ","{ffffff}Введите ID человека которого хотите уволить из организации:\n\n","Далее","Закрыть");
			if(Player[strval(inputtext)][uMember] != Player[playerid][uMember]) return showPlayerDialog(playerid,d_frac + 6,1," ","{ffffff}Введите ID человека которого хотите уволить из организации:\n\n","Далее","Закрыть");
			if(playerid == strval(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Вы не можете уволить самого себя из организации!");
			if(F::[Player[playerid][uMember]][fRank][1] > Player[playerid][uRank] || Player[strval(inputtext)][uRank] > Player[playerid][uRank]) return showPlayerDialog(playerid,d_frac + 6,1," ","{ffffff}Введите ID человека которого хотите уволить из организации:\n\n","Далее","Закрыть");


			new id = strval(inputtext);
			Player[id][uMember] = 0;
			Player[id][uRank] = 0;
			format(query,sizeof(query),"UPDATE gb_users SET uMember = '%d',uRank = '%d' WHERE BINARY uName = '%s'",Player[id][uMember],Player[id][uRank],Player[id][uName]);
			mysql_tquery(1, query, "", "");
			SetPlayerColor(id,FracColor[0]);
			GetBackSkin(id);
			if(Player[id][uIsPlayerJob][0] == 1)
			{
				RemovePlayerAttachedObject(id,5);
				RemovePlayerAttachedObject(id,6);
                Player[id][uIsPlayerJob][0] = 0;
				
			}
			if(Player[id][uIsPlayerJob][1] == 1) Player[id][uIsPlayerJob][1] = 0;
			if(Player[id][uIsPlayerJob][2] == 1) Player[id][uIsPlayerJob][2] = 0;
			
			UpdatePlayerJob( id );
			RemoveStateItems( id );
			
			if(newsLeaderEther == strval(inputtext)) {
				newsLeaderEther = INVALID_PLAYER_ID;
				D::[newsClientEther][dPhone] = false;
				PhoneStatus(newsClientEther,false);
				newsClientEther = INVALID_PLAYER_ID;
				SendClientMessage(newsClientEther,C_GRAY,""gbError"Эфир был экстренно приостановлен!");
				EtherStatus = false;
			}
			SendClientMessage(strval(inputtext),C_GRAY,""gbInfo"Вас уволили из организации!");
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы уволили своего сотрудника из организации!");
		}
		case d_frac + 7: {
			if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_frac + 7,1," ","{ffffff}Введите ID человека которого хотите повысить в должности:\n\n","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_frac + 7,1," ","{ffffff}Введите ID человека которого хотите повысить в должности:\n\n","Далее","Закрыть");
			if(!IsPlayerConnected(strval(inputtext))) return showPlayerDialog(playerid,d_frac + 7,1," ","{ffffff}Введите ID человека которого хотите повысить в должности:\n\n","Далее","Закрыть");
			if(Player[strval(inputtext)][uMember] != Player[playerid][uMember]) return showPlayerDialog(playerid,d_frac + 7,1," ","{ffffff}Введите ID человека которого хотите повысить в должности:\n\n","Далее","Закрыть");
            if(F::[Player[playerid][uMember]][fRank][2] > Player[playerid][uRank] || Player[strval(inputtext)][uRank] > Player[playerid][uRank]) return showPlayerDialog(playerid,d_frac + 7,1," ","{ffffff}Введите ID человека которого хотите повысить в должности:\n\n","Далее","Закрыть");

			SetPVarInt(playerid,"playerSelectIDFrac",strval(inputtext));
			showPlayerDialog(playerid,d_frac + 8,1," ","{ffffff}Введите введите новый номер должности:\n\n"cRED"| Должность может быть не меньше 1 и не больше 15.","Далее","Закрыть");
		}
		case d_frac + 8: {
			if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_frac + 8,1," ","{ffffff}Введите введите новый номер должности:\n\n"cRED"| Должность может быть не меньше 1 и не больше 15.","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_frac + 8,1," ","{ffffff}Введите введите новый номер должности:\n\n"cRED"| Должность может быть не меньше 1 и не больше 15.","Далее","Закрыть");
			if(!IsPlayerConnected(GetPVarInt(playerid,"playerSelectIDFrac"))) return SendClientMessage(playerid,C_GRAY,""gbError"Этот человек покинул штат, так что его должность нельзя изменить!");
			if(Player[GetPVarInt(playerid,"playerSelectIDFrac")][uMember] != Player[playerid][uMember]) return SendClientMessage(playerid,C_GRAY,""gbError"Этот человек не находится в вашей организации!");
			if(strval(inputtext) < 1 || strval(inputtext) > 15) return showPlayerDialog(playerid,d_frac + 8,1," ","{ffffff}Введите введите новый номер должности:\n\n"cRED"| Должность может быть не меньше 1 и не больше 15.","Далее","Закрыть");
			Player[GetPVarInt(playerid,"playerSelectIDFrac")][uRank] = strval(inputtext);
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы установили новую должность своему сотруднику!");
			SendClientMessage(GetPVarInt(playerid,"playerSelectIDFrac"),C_GRAY,""gbAccess"Вам установили новую должность в организации!");
			format(query,sizeof(query),"UPDATE gb_users SET uRank = '%d' WHERE BINARY uName = '%s'",Player[GetPVarInt(playerid,"playerSelectIDFrac")][uRank],Player[GetPVarInt(playerid,"playerSelectIDFrac")][uName]);
			mysql_tquery(1, query, "", "");
		}
		case d_frac + 9: {
			if(response) {
				Player[playerid][uMember] = GetPVarInt(playerid,"playerInviteFrac");
				Player[playerid][uRank] = 1;
				Player[playerid][uJob] = 0;
				format(query,sizeof(query),"UPDATE gb_users SET uMember = '%d',uRank = '%d',uJob = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMember],Player[playerid][uRank],Player[playerid][uJob],Player[playerid][uName]);
				mysql_tquery(1, query, "", "");
				format(string,sizeof(string),"[F] %s вступает в организацию.",Player[playerid][uName]);
				foreach(new i : Player) {
					if(Player[playerid][uMember] == Player[i][uMember]) SendClientMessage(i,FracColor[Player[i][uMember]],string);
				}
				switch(Player[playerid][uMember]) {
				    case 1,2,3,5: {}
				    default: SetPlayerColor(playerid,FracColor[Player[playerid][uMember]]);
				}
				DeletePVar(playerid,"playerInviteFrac");
			}
			else {
				DeletePVar(playerid,"playerInviteFrac");
				SendClientMessage(playerid,C_GRAY,""gbError"Вы отказались вступать в организацию!");
			}
		}
		case d_frac + 10: {
			if(!response) return 1;
			switch(listitem) {
				case 0: showPlayerDialog(playerid,d_frac + 3,1," ","{ffffff}Введите новое название для этого ранга: \n\n"cRED"| Название может быть не меньше 1 и не больше 15 символов.\n| В название ранга запрещены любые символы и цифры.","Далее","Закрыть");
			}
		}
		case d_frac + 11: {
			if(!response) return 1;
			new rank = GetPVarInt(playerid,"playerSelectSlotRank");
			F::[Player[playerid][uLeader]][fSkins][rank] = SkinsFrac[Player[playerid][uLeader]][listitem];
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы установили новый скин для этого ранга!");
			format(query,sizeof(query),"UPDATE gb_frac SET fSkins = '%d|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d' WHERE fID = '%d'",
			F::[Player[playerid][uLeader]][fSkins][0],F::[Player[playerid][uLeader]][fSkins][1],F::[Player[playerid][uLeader]][fSkins][2],F::[Player[playerid][uLeader]][fSkins][3],
			F::[Player[playerid][uLeader]][fSkins][4],F::[Player[playerid][uLeader]][fSkins][5],F::[Player[playerid][uLeader]][fSkins][6],F::[Player[playerid][uLeader]][fSkins][7],
			F::[Player[playerid][uLeader]][fSkins][8],F::[Player[playerid][uLeader]][fSkins][9],F::[Player[playerid][uLeader]][fSkins][10],F::[Player[playerid][uLeader]][fSkins][11],
			F::[Player[playerid][uLeader]][fSkins][12],F::[Player[playerid][uLeader]][fSkins][13],F::[Player[playerid][uLeader]][fSkins][14],Player[playerid][uLeader]);
			mysql_tquery(1, query, "", "");
		}
		case d_frac + 12: {
			if(!response) return 1;

			if(listitem != 10) {
				new list = GetPVarInt(playerid,"pageFrac") * 10;
				format(query,sizeof(query),"SELECT uID,uName,uRank FROM gb_users WHERE uMember = '%d' LIMIT %d,10",Player[playerid][uMember],list);
				mysql_tquery(1, query, "ListForFrac", "dd", playerid, listitem);
			}
			else {
				SetPVarInt(playerid,"pageFrac",GetPVarInt(playerid,"pageFrac") + 1);
				new list = GetPVarInt(playerid,"pageFrac") * 10;
				format(query,sizeof(query),"SELECT uName,uRank FROM gb_users WHERE uMember = '%d' LIMIT %d,10",Player[playerid][uMember],list);
				mysql_tquery(1, query, "MySQLQuery", "dd", playerid, 20);
			}
		}
		case d_frac + 13: {
			if(!response) return 1;
			new id = GetPVarInt(playerid,"playerSelectFracID");
			if(Player[playerid][uID] == id) return SendClientMessage(playerid,C_GRAY,""gbError"Вы не можете уволить самого себя из организации!");
			if(F::[Player[playerid][uMember]][fRank][1] > Player[playerid][uRank]) return SendClientMessage(playerid,C_GRAY,""gbError"Ваш ранг не достаточен!");
			format(query,sizeof(query),"UPDATE gb_users SET uMember = '0',uRank = '0' WHERE uID = '%d'",id);
			mysql_tquery(1, query, "", "");
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы уволили своего сотрудника из организации!");
			foreach(new i : Player) {
				if(GetPVarInt(playerid,"uLogin") == 0) continue;
				if(Player[i][uID] == id) {
					Player[i][uMember] = 0;
					Player[i][uRank] = 0;
					GetBackSkin(i);
					SetPlayerColor(i,FracColor[0]);
					format(query,sizeof(query),"UPDATE gb_users SET uMember = '%d',uRank = '%d' WHERE BINARY uName = '%s'",Player[i][uMember],Player[i][uRank],Player[i][uName]);
					mysql_tquery(1, query, "", "");
					if(Player[i][uIsPlayerJob][0] == 1)
					{
						RemovePlayerAttachedObject(i,9);
						RemovePlayerAttachedObject(i,8);
						Player[i][uIsPlayerJob][0] = 0;
						UpdatePlayerJob( playerid );
					}
					if(Player[i][uIsPlayerJob][1] == 1)
					{
						RemovePlayerAttachedObject(i,9);
						RemovePlayerAttachedObject(i,8);
						Player[i][uIsPlayerJob][1] = 0;
						UpdatePlayerJob( playerid );
					}
					if(Player[i][uIsPlayerJob][2] == 1)
					{
						RemovePlayerAttachedObject(i,9);
						RemovePlayerAttachedObject(i,8);
						Player[i][uIsPlayerJob][2] = 0;
						UpdatePlayerJob( playerid );
					}
					
					RemoveStateItems( playerid );
					
					if(newsLeaderEther == i) {
						newsLeaderEther = INVALID_PLAYER_ID;
						D::[newsClientEther][dPhone] = false;
						PhoneStatus(newsClientEther,false);
						newsClientEther = INVALID_PLAYER_ID;
						SendClientMessage(newsClientEther,C_GRAY,""gbInfo"Эфир был экстренно приостановлен!");
						EtherStatus = false;
					}
					SendClientMessage(i,C_GRAY,""gbInfo"Вас уволили из организации!");
					break;
				}
			}
		}
		case d_frac + 14: {
			if(!response) return 1;
			SetPVarInt(playerid,"playerSelectSlotGun",listitem);
			showPlayerDialog(playerid,d_frac + 15,1," ","{ffffff}Введите новый ранг с которого будет разрешено данное оружие:\n\n"cRED"| Вводимый ранг может быть не меньше 1 и не больше 15.","Далее","Закрыть");
		}
		case d_frac + 15:
		{
			new slot = GetPVarInt(playerid,"playerSelectSlotGun");
			DeletePVar(playerid,"playerSelectSlotGun");
			if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_frac + 15,1," ","{ffffff}Введите новый ранг с которого будет разрешено данное оружие:\n\n"cRED"| Вводимый ранг может быть не меньше 1 и не больше 15.","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_frac + 15,1," ","{ffffff}Введите новый ранг с которого будет разрешено данное оружие:\n\n"cRED"| Вводимый ранг может быть не меньше 1 и не больше 15.","Далее","Закрыть");
			if(strval(inputtext) < 1 || strval(inputtext) > 15) return showPlayerDialog(playerid,d_frac + 15,1," ","{ffffff}Введите новый ранг с которого будет разрешено данное оружие:\n\n"cRED"| Вводимый ранг может быть не меньше 1 и не больше 15.","Далее","Закрыть");
			F::[Player[playerid][uMember]][fGuns][slot] = strval(inputtext);
			format(query,sizeof(query),"UPDATE gb_frac SET fGuns = '%d|%d|%d|%d|%d|%d' WHERE fID = '%d' LIMIT 1",F::[Player[playerid][uMember]][fGuns][0],
			F::[Player[playerid][uMember]][fGuns][1],F::[Player[playerid][uMember]][fGuns][2],F::[Player[playerid][uMember]][fGuns][3],F::[Player[playerid][uMember]][fGuns][4],F::[Player[playerid][uMember]][fGuns][5],Player[playerid][uLeader]);
			mysql_tquery(1, query, "", "");
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы установили новый доступ к выбранному оружию!");
		}
		case d_enterfrac:
		{
		    if(!response) return true;
		    switch(listitem)
		    {
		        case 0:
		        {
		            if(Player[playerid][uIsPlayerJob][2] == 1) return SendClientMessage(playerid, C_GRAY, ""gbError"Вы уже находитесь на дежурстве!");
		            showPlayerDialog(playerid, d_enterfrac + 1, 2, "Гардероб", "1. "cGRAY"Заступить на дежурство в рабочей одежде{ffffff}\n2. "cGRAY"Заступить на дежурство в гражданской одежде", "Далее", "Закрыть");
		        }
		        case 1:
		        {
		            if(Player[playerid][uIsPlayerJob][2] == 0) return SendClientMessage(playerid, C_GRAY, ""gbError"Вы не выходили на дежурство!");
		            GetBackSkin(playerid);
		            SendClientMessage(playerid,C_GRAY,""gbAccess"Вы закончили своё дежурство!");
		            SetPlayerColor(playerid,FracColor[0]);
				    RemovePlayerAttachedObject(playerid,5);
				    RemovePlayerAttachedObject(playerid,7);
				    RemovePlayerAttachedObject(playerid,6);
				    Player[playerid][uIsPlayerJob][2] = 0;
				    MeAction(playerid,"переоделся(-ась)",1);
		        }
		    }
		}
		
		
		
		
		case d_enterfrac + 4:
		{
		    if(!response) return true;
		    switch(listitem)
		    {
		        case 0:
		        {
		            if(Player[playerid][uIsPlayerJob][1] == 1) return SendClientMessage(playerid, C_GRAY, ""gbError"Вы уже находитесь на дежурстве!");
		            showPlayerDialog(playerid, d_enterfrac + 5, 2, "Гардероб", "1. "cGRAY"Заступить на дежурство в рабочей одежде{ffffff}\n2. "cGRAY"Заступить на дежурство в гражданской одежде", "Далее", "Закрыть");
		        }
		        case 1:
		        {
		            if(Player[playerid][uIsPlayerJob][1] == 0) return SendClientMessage(playerid, C_GRAY, ""gbError"Вы не выходили на дежурство!");
		            GetBackSkin(playerid);
		            SendClientMessage(playerid,C_GRAY,""gbAccess"Вы закончили своё дежурство!");
		            SetPlayerColor(playerid,FracColor[0]);
				    RemovePlayerAttachedObject(playerid,5);
				    RemovePlayerAttachedObject(playerid,7);
				    RemovePlayerAttachedObject(playerid,6);
				    Player[playerid][uIsPlayerJob][1] = 0;
					UpdatePlayerJob( playerid );
				    MeAction(playerid,"переоделся(-ась)",1);
		        }
		    }
		}
		case d_enterfrac + 5: {
			if(!response) return true;
			switch( listitem ) {
				case 0: {
					if( Player[playerid][uSex] == 1 ) {
						for(new i; i < 12; i++) {
							if( !MedicalSkinList[i] ) continue;
							PlayerTextDrawSetPreviewModel(playerid, NewSkinSelect[i][playerid], MedicalSkinList[i]);
							PlayerTextDrawShow(playerid, NewSkinSelect[i][playerid]);
						}
					}
					else {
						for(new i; i < 12; i++) {
							if( !MedicalSkinListMale[i] ) continue;
							PlayerTextDrawSetPreviewModel(playerid, NewSkinSelect[i][playerid], MedicalSkinListMale[i]);
							PlayerTextDrawShow(playerid, NewSkinSelect[i][playerid]);
						}
					}
					PlayerTextDrawShow(playerid, NewSkinSelect[12][playerid]);
					SelectTextDraw( playerid, 0xd3d3d3FF);
					SetPVarInt( playerid, "PlayerMenuShow", 9 );
					setData( playerid, "GuperOnSelect", 3 );
					showPlayerDialog( playerid, 9999, 0, " ", 
						"{ffffff}Нажмите кнопку "cGREEN"ESC {ffffff}чтобы закрыть меню.", "Закрыть", "" );
				}
				case 1: { 
					new skin = GetPlayerSkin(playerid);
		            Player[playerid][uJobSkin] = skin;
		            userUpdate( playerid, "uJobSkin", Player[playerid][uJobSkin] );
		            SetPlayerSkin( playerid, Player[playerid][uJobSkin]);
		            Player[playerid][uIsPlayerJob][1] = 1;
					UpdatePlayerJob( playerid );
					SetPlayerColor( playerid, FracColor[ Player[playerid][uMember] ] );
				}
			}	
		}
//-------------------------------------------		
		case d_enterfrac + 6:
		{
		    if(!response) return true;
		    if(Player[playerid][uSex] == 1)
		    {
		        Player[playerid][uJobSkin] = MedicalSkinList[listitem];
		    }
		    else
		    {
		        Player[playerid][uJobSkin] = MedicalSkinListMale[listitem];
		    }
            
			userUpdate( playerid, "uJobSkin", Player[playerid][uJobSkin] );
            SetPlayerSkin(playerid, Player[playerid][uJobSkin]);
			
            Player[playerid][uIsPlayerJob][1] = 1;
			UpdatePlayerJob( playerid );
			
			SetPlayerColor(playerid, FracColor[Player[playerid][uMember]] );
		}
		
		case d_police - 1 :
		{
			if( !response )
				return 1;
			
			if( listitem == 0 )
			{
				if( Player[playerid][uSex] == 1 ) 
				{
					for( new i; i < sizeof police_skin_male; i++ )
					{
						PlayerTextDrawSetPreviewModel( playerid, NewSkinSelect[i][playerid], 
							police_skin_male[i] );
						PlayerTextDrawShow( playerid, NewSkinSelect[i][playerid] );
					}
				}
				else 
				{
					for( new i; i < sizeof police_skin_female; i++ )
					{
						PlayerTextDrawSetPreviewModel( playerid, NewSkinSelect[i][playerid], 
							police_skin_female[i] );
						PlayerTextDrawShow( playerid, NewSkinSelect[i][playerid] );
					}
				}
				
				PlayerTextDrawShow( playerid, NewSkinSelect[12][playerid] );
				SelectTextDraw( playerid, 0xd3d3d3FF );
				setData( playerid, "PlayerMenuShow", 9 );
				setData( playerid, "GuperOnSelect", 5 );
				showPlayerDialog( playerid, 9999, 0, " ", 
					"{ffffff}Нажмите кнопку "cGREEN"ESC {ffffff}чтобы закрыть меню.","Закрыть","");
				GivePlayerItem( playerid, 432, 1 );
			}
			
			else if( listitem == 1 )
			{
				format:gb_string( "%s", Player[playerid][uSex] == 1 ? ("переоделся"):("переоделась") );
				MeAction( playerid, gb_string, 1 );
				
				Player[playerid][uIsPlayerJob][0] = 1;
				UpdatePlayerJob( playerid );
				Player[playerid][uJobSkin] = GetPlayerSkin( playerid );
				userUpdate( playerid, "uJobSkin", Player[playerid][uJobSkin] );
    			if( getData( playerid, "PlayerColor") == 1 ) SetPlayerColor( playerid, FracColor[0] );
				else SetPlayerColor( playerid, FracColor[ Player[playerid][uMember] ] );
				
				SendClientMessage( playerid,C_GRAY,""gbAccess"Вы успешно вышли на дежурство.");
				GivePlayerItem( playerid, 432, 1 );
			}
		}
		
		case d_police: 
		{
			if( !response ) return 1;
			if( Player[playerid][uIsPlayerJob][0] ) {
			    GetBackSkin( playerid );
			    SendClientMessage( playerid,C_GRAY,""gbAccess"Вы закончили своё дежурство.");
			    SetPlayerColor( playerid, FracColor[0] );
			    RemovePlayerAttachedObject( playerid,5 );
			    RemovePlayerAttachedObject( playerid,7  );
			    RemovePlayerAttachedObject( playerid,6 );
			    Player[playerid][uIsPlayerJob][0] = 0;
				format( gb_string, sizeof gb_string, "%s", Player[playerid][uSex] == 1 ? ("переоделся"):("переоделась") );
			    MeAction( playerid, gb_string, 1 );
				
			    UpdatePlayerJob( playerid );
				RemoveStateItems( playerid );
			}
			else 
			{
				showPlayerDialog( playerid, d_police - 1, DIALOG_STYLE_LIST, " ", "\
					"cWHITE"1."cGRAY" Заступить на дежурство в рабочей одежде\n\
					"cWHITE"2."cGRAY" Заступить на дежурство в гражданской форме", 
					"Далее", "Закрыть"
				);
			}	
		}
		case d_mdc: {
		    if(!response) return 1;
			switch(listitem)
			{
			    case 0: showPlayerDialog(playerid,d_mdc + 1,1," ",""gbInfo"Введите имя человека, чтобы посмотреть информацию о нем:","Далее","Закрыть");
				case 1: showPlayerDialog(playerid,d_mdc + 2,1," ",""gbInfo"Введите номер автомобиля [3-ех значное число]:","Далее","Закрыть");
				case 2: showPlayerDialog(playerid,d_mdc + 6,1," ",""gbInfo"Введите часть названия бизнеса:","Далее","Закрыть");
			    case 3: showPlayerDialog(playerid,d_mdc + 3,1," ",""gbInfo"Введите номер дома:","Далее","Закрыть");
			    case 4: showPlayerDialog(playerid,d_mdc + 4,1," ",""gbInfo"Введите номер телефона:","Далее","Закрыть");
			    case 5: SendClientMessage(playerid, -1, ""gbError"Временно не доступно");
			    case 6: CallLocalFunction( "cmd_members", "i", playerid );
			    case 7: showPlayerDialog(playerid,d_mdc + 5,1," ",""gbInfo"Введите номер автомобиля, который хотите объявить в розыск [3-ех значное число]:","Далее","Закрыть");
			    case 8:
			    {
			        format(string, sizeof(string), "Номер Авто\tМарка\t\tВладелец\n");
			    	for(new i; i != MAX_CARS_BUY; i ++) 
					{
						if( !IsValidVehicle( i ) ) 
							continue;
							
				    	if( !IsBuyingCar( i ) ) 
							continue;
							
						if( Car::[i][cWanted] <= 0 ) 
							continue;
							
						format(string, sizeof(string), "{FFFFFF}%s%s\t\t%s\t\t%s\n",string, Car::[i][cNumber], CarNames[Car::[i][cModel] - 400], Car::[i][cOwner]);
					}
					showPlayerDialog(playerid, 9999, DIALOG_STYLE_TABLIST_HEADERS, "Разыскиваемые автомобили", string, "Закрыть", "");
					//showPlayerDialog(playerid,9999,0,"Разыскиваемые автомобили",string,"Закрыть","");
			    }
			    case 9: showPlayerDialog(playerid,d_mdc + 7,1," ",""gbInfo"Введите номер лицензии, чтобы посмотреть информацию о ней:","Далее","Закрыть");
			}
		}
		case d_mdc + 7:
		{
		    if(!response) return 1;
	     	new id = strval(inputtext);
  			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_mdc + 7,1," ",""gbInfo"Введите номер лицензии, чтобы посмотреть информацию о ней:","Далее","Закрыть");
  			format(query, sizeof(query),"SELECT * FROM `gb_users` WHERE `uID` = '%d' LIMIT 1", id);
			mysql_tquery(1, query, "OnPlayerCheckLicense", "d", playerid);
		}
		case d_mdc + 6: {
		    if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_mdc + 6,1," ",""gbInfo"Введите часть названия бизнеса:","Далее","Закрыть");
			if(strlen(inputtext) > 50) return SendClientMessage(playerid,C_GRAY,""gbError"Максимальная длина 50 символов!");
			new nName[32];
			for(new i; i != MAX_BUSINESS; i ++) {
			    if(strfind(Bizz::[i][bName], inputtext, true) != -1) {
			        switch(Bizz::[i][bSettings][7])
					{
					    case 0: nName = "Закусочную";
					    case 1: nName = "Бар";
					    case 2: nName = "Ресторан";
					    case 3: nName = "Магазин одежды";
					    case 4: nName = "Магазин электроники";
					    case 5: nName = "Автосалон";
					    case 6: nName = "Магазин оружия";
					    case 7: nName = "Магазин мебели";
					    case 8: nName = "Клуб";
					    case 9: nName = "Заправку";
					    case 10: nName = "Все для отдыха";
					    case 11: nName = "Аренда транспорта";
					    case 12: nName = "Спортзал";
					}
			        format(string, sizeof(string), ""gbInfo"Информация: \n\
		            {FFFFFF}Название: %s\n\
					Владелец: %s\n\
					Тип бизнеса: %s\n\
					Статус: %s", Bizz::[i][bName], Bizz::[i][bOwner], nName, Bizz::[i][bSettings][4] ? (""cRED"Закрыт{FFFFFF}") : (""cGREEN"Открыт{FFFFFF}"));
		            showPlayerDialog(playerid,9999,0," ",string,"Закрыть","");
			        break;
			    }
			}
		}
		case d_mdc + 5:
		{
		    if(!response) return 1;
		    new id = strval(inputtext);
  			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_mdc + 5,1," ",""gbInfo"Введите номер автомобиля, который хотите объявить в розыск:","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_mdc + 5,1," ",""gbInfo"Введите номер автомобиля, который хотите объявить в розыск:","Далее","Закрыть");
	        for(new i; i != MAX_CARS_BUY; i ++)
			{
			    if( !IsBuyingCar( i ) )  
					continue;
		        
				if(Car::[i][cID] == id) 
				{
					if(Car::[i][cWanted] == 1)
					{
					    SetCarInt(Car::[i][cID], "cWanted", 0);
					    Car::[i][cWanted] = 0;
					    SendClientMessage(playerid, -1, ""gbAccess"Машина снята с розыска!");
					}
					else
					{
					    SetCarInt(Car::[i][cID], "cWanted", 1);
					    Car::[i][cWanted] = 1;
					    SendClientMessage(playerid, -1, ""gbAccess"Машина объявлена в розыск!");
					}
					break;
		        }
			}
		}
		case d_mdc + 4: {
		    if(!response) return 1;
		    new Float: p[3];
		    new id = strval(inputtext);
  			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_mdc + 4,1," ",""gbInfo"Введите номер телефона:","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_mdc + 4,1," ",""gbInfo"Введите номер телефона:","Далее","Закрыть");
		    foreach(new i : Player)
			{
				if(GetPVarInt(i,"uLogin") == 0) continue;
				if(Player[i][uNumber] == id)
				{
					if(Inv[i][invSlot][55] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"У данного человека нет мобильного телефона!");
					GetPlayerPos(i, p[0], p[1], p[2]);
					SetPlayerCheckpoint(playerid,p[0],p[1],p[2],5.0);
					SetPVarInt(playerid,"playerUseGPS",1);
					SendClientMessage(playerid, -1, ""gbAccess"Данный человек был успешно найден!");
					break;
				}
			}

		}
		case d_mdc + 3: {
		    if(!response) return 1;
//		    new id = strval(inputtext);
  			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_mdc + 3,1," ",""gbInfo"Введите номер дома:","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_mdc + 3,1," ",""gbInfo"Введите номер дома:","Далее","Закрыть");
		    for( new h; h < sizeof HouseInfo; h++ ) {
				if( HouseInfo[h][hID] == strval( inputtext ) ) {
					if( !HouseInfo[h][hInterior] ) format( query, sizeof query, "Стандартный" );
					else format( query, sizeof query, "%s", house_int[ HouseInfo[h][hInterior] - 1 ][ht_name] );
					format( gb_string, sizeof gb_string, 
						""gbInfo"Информация: \n\
						{FFFFFF}Владелец: %s\n\
						Интерьер дома: %s\n", HouseInfo[h][hOwner], query );
					showPlayerDialog( playerid, 9999, DIALOG_STYLE_MSGBOX, "Информация о доме", gb_string, "Закрыть", "" );
					break;
				}
			}
		}
		case d_mdc + 2: {
		    if(!response) return 1;
	     	new id = strval(inputtext);
  			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_mdc + 2,1," ",""gbInfo"Введите номер автомобиля:","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_mdc + 2,1," ",""gbInfo"Введите номер автомобиля:","Далее","Закрыть");
		    //if(sscanf(inputtext, "d", params[0])) {
	        for(new i; i != MAX_CARS_BUY; i ++)
			{
			    if( !IsBuyingCar( i ) ) 
					continue;
					
		        if(Car::[i][cID] == id) {
		            format(string, sizeof(string), ""gbInfo"Информация: \n\
		            {FFFFFF}Владелец: %s\n\
					Марка автомобиля: %s\n\
					Находится ли автомобиль в розыске: %s\n", Car::[i][cOwner], CarNames[Car::[i][cModel] - 400], Car::[i][cWanted] ? ("Да") : ("Нет"));
		            showPlayerDialog(playerid,9999,0," ",string,"Закрыть","");
		            break;
				}
			}
		    //}
		}
		case d_mdc + 1:
		{
		    if(!response) return 1;
			new player;
   			player = INVALID_PLAYER_ID;
   			sscanf(inputtext, "u", player);

            if(IsPlayerConnected(player))
            {
          		new name[2][24],nation[64],fraction[24],wanted[24];
				explode(name,Player[player][uName],"_");
				if(!strlen(name[1])) strcat(name[1],"Неизвестно");
				switch(Player[player][uNation]) {
					case 1: strcat(nation,"Американец");
					case 2: strcat(nation,"Латиноамериканец");
					case 3: strcat(nation,"Русский");
					case 4: strcat(nation,"Француз");
					case 5: strcat(nation,"Итальянец");
					case 6: strcat(nation,"Испанец");
					case 7: strcat(nation,"Немец");
					case 8: strcat(nation,"Португалец");
					case 9: strcat(nation,"Австралиец");
					case 10: strcat(nation,"Колумбиец");
					case 11: strcat(nation,"Мексиканец");
					case 12: strcat(nation,"Китаец");
					case 13: strcat(nation,"Японец");
					case 14: strcat(nation,"Бразилец");
					case 15: strcat(nation,"Кореец");
					case 16: strcat(nation,"Въетнамец");
					case 17: strcat(nation,"Чех");
					case 18: strcat(nation,"Британец");
					case 19: strcat(nation,"Голландец");
					case 20: strcat(nation,"Поляк");

				}
				if(Player[player][uRank] != 0) format(fraction,sizeof(fraction),"%s",FRank[Player[player][uMember]][Player[player][uRank] - 1]);
				else format(fraction,sizeof(fraction),"Нет");

				if(Player[player][uSuspect] != 0) format(wanted,sizeof(wanted),"%d",Player[player][uSuspect]);
				else format(wanted,sizeof(wanted),"Нет");
				new licensestrue[25];
				if(Player[player][uLicenses][3] != 1)
				{
				    licensestrue = "Нет";

				}
				else format(licensestrue, sizeof(licensestrue), "Есть № %d", Player[player][uID]);
				format(string,sizeof(string),"\
				{ffffff}| Данные о человеке:\n\n\
				Имя: %s\n\
				Фамилия: %s\n\
				Телефон: %d\n\
				Национальность: %s\n\
				Возраст: %d\n\
				Фракция: %s\n\
				Должность: %s\n\
				Розыск: %s\n\n\
				{ffffff}| Лицензии:\n\n\
				Лицензия на наземное ТС: %s\n\
				Лицензия на водное ТС: %s\n\
				Лицензия на воздушное ТС: %s\n\
				Лицензия на оружие: %s\n\
				",name[0],name[1], Player[player][uNumber],nation,Player[player][uAge], F::[Player[player][uMember]][fName], fraction, wanted,
				Player[player][uLicenses][0] ? ("Есть") : ("Нет"),
				Player[player][uLicenses][1] ? ("Есть") : ("Нет"),
				Player[player][uLicenses][2] ? ("Есть") : ("Нет"),
				licensestrue);
				showPlayerDialog(playerid,9999,0," ",string,"Закрыть","");
            }
          	else return SendClientMessage(playerid, -1, ""gbError"Данный игрок не в сети");
		}
		case d_police + 4:
		{
		    if(!response) 
				return 1;
				
		    if( Player[playerid][uMoney] < 300) 
				return SendClientMessage( playerid,C_GRAY, !NO_MONEY );
		    
			new i = GetPVarInt(playerid, "SelectOrignFor");
		    
		    switch(GetPVarInt(playerid, "SelectOrign"))
			{
			    case 0: format(str, sizeof(str), "LS");
			    case 1: format(str, sizeof(str), "RC");
			}
		    switch( Car::[i][cModel] )
			{
			    case 510, 509, 481:
			    {
			        SendClientMessage(playerid, C_GRAY, ""gbError"Данное транспортное средство нельзя зарегистрировать.");
			        return 1;
			    }
			    default:
			    {
			        format( string, sizeof(string), "[%s%d%s]", str, Car::[i][cID], Getinic( Player[playerid][uName] )) ;
					strmid( Car::[i][cNumber], string, 0, strlen(string), 255 );
					
					if( IsValidDynamic3DTextLabel( Car::[i][cNumberLabel] ) )
					{
						UpdateDynamic3DTextLabelText( Car::[i][cNumberLabel], 0xFFFFFF60, string );
					}
					
					SetCarStr( Car::[i][cID], "cNumber", Car::[i][cNumber]);
					SetVehicleNumberPlate( i, Car::[i][cNumber] );
			    }
			}
			Player[playerid][uMoney] -= 300;
			mysql_format(1, string, sizeof(string),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, string, "", "");
			SendClientMessage(playerid, -1, ""gbAccess"Ваше транспортное средство успешно зарегистрировано.");
			DeletePVar(playerid, "SelectOrignFor");
			DeletePVar(playerid, "SelectOrign");
		}
		case d_police + 3: {
		    if(!response) return 1;
		    SetPVarInt(playerid, "SelectOrign", listitem);
		    showPlayerDialog(playerid,d_police + 4,0," ","{ffffff}Оплата гос пошлины составляет "cGREEN"$300{FFFFFF}\n\n"gbInfo"Вы уверенны, что хотите оплатить ?","Да","Нет");
		}
		case d_police + 2:
		{
		    if(!response) return 1;
		    new id = strval(inputtext);
  			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_police + 2,1," ","{ffffff}Введите в окошко номер своего транспорта:\n\n"cRED"| Номер транспорта может состоять только из цифр.\n| Если транспорт принадлежит не вам, оформелние номера будет недоступно.","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_police + 2,1," ","{ffffff}Введите в окошко номер своего транспорта:\n\n"cRED"| Номер транспорта может состоять только из цифр.\n| Если транспорт принадлежит не вам, оформелние номера будет недоступно.","Далее","Закрыть");
            new bool: cuff = false;
			for(new i; i != MAX_CARS_BUY; i ++) 
			{
			    if( !IsBuyingCar( i ) ) 
					continue;
					
		        if( Car::[i][cID] == id ) 
				{
		            if( IsOwnerCar( i, playerid ) )
		            {
		                SetPVarInt( playerid, "SelectOrignFor", i);
		                cuff = true;
		                break;
		            }
		        }
			}
			if(!cuff) return SendClientMessage(playerid,C_GRAY,""gbError"Вы указали неверный номер машины или машина не принадлежит Вам!");
			else showPlayerDialog(playerid,d_police + 3,2,"Место проживания","- Лос Сантос (LS)\n- Округ Рэд (RC)","Далее","Закрыть");
		}
		case d_police + 8: {
		    if(!response) return 1;
		    if(Player[playerid][uMoney] < Player[playerid][uTicketPay]) return SendClientMessage(playerid,C_GRAY,""gbError"У вас недостаточно средств для покупки лицензии!");
            if(!Player[playerid][uTicket]) return SendClientMessage(playerid,C_GRAY,""gbError"У вас нет неоплаченых штрафов!");

			Player[playerid][uMoney] -= Player[playerid][uTicketPay];
			Player[playerid][uTicket] = 0;
			nowUpdateInfo(playerid, "d" , "gb_users" , "uName" , "uTicket" , Player[playerid][uTicket]);
			nowUpdateInfo(playerid, "d" , "gb_users" , "uName" , "uTicketPay" , Player[playerid][uTicketPay]);

			S::[0][sMeria][0] += Player[playerid][uTicketPay];
			format(query,sizeof(query),"UPDATE gb_others SET sMeria0 = %d",S::[0][sMeria][0]);
			mysql_tquery(1, query, "", "");
		    SendClientMessage(playerid,C_GRAY,""gbAccess"Вы успешно оплатили свой штраф!");
		}
		case d_police + 6: {
 			if(!response) return 1;
 			showPlayerDialog(playerid,d_police + 7,1," ",""gbInfo"Введите количество дней на сколько конфисковать лицензию.","Далее","Закрыть");
			SetPVarInt(playerid, "chooseListItem", listitem);
		}
		case d_police + 7: {
		    if(!response) return DeletePVar(playerid, "ChooseHero");
			new listitemm = GetPVarInt(playerid, "chooseListItem");
  			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_police + 7,1," ",""gbInfo"Введите количество дней на сколько конфисковать лицензию.","Далее","Закрыть");
			if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_police + 7,1," ",""gbInfo"Введите количество дней на сколько конфисковать лицензию.","Далее","Закрыть");
			if(listitemm <= 2 && strval(inputtext) < 1 || strval(inputtext) > 3) return showPlayerDialog(playerid,d_police + 7,1," ",""gbInfo"Введите количество дней на сколько конфисковать лицензию.\n\n"gbError"Количество дней от 1 до 3-ех","Далее","Закрыть");
			else if(listitemm >= 3 && strval(inputtext) < 3 || strval(inputtext) > 7) return showPlayerDialog(playerid,d_police + 7,1," ",""gbInfo"Введите количество дней на сколько конфисковать лицензию.\n\n"gbError"Количество дней от 3 до 7-и","Далее","Закрыть");
			new i = GetPVarInt(playerid, "ChooseHero");
			DeletePVar(playerid, "ChooseHero");
			DeletePVar(playerid, "chooseListItem");

			//if(Player[playerid][uLicensesTake] > getdate()) return SendClientMessage(playerid, -1, ""gbError"Недавно у вас конфисковали лицензию, время еще не прошло");
			new atext[32];
			switch(listitemm)
			{
			    case 0: atext = "транспорт";
			    case 1: atext = "водный т/c";
			    case 2: atext = "воздушное т/c";
			    case 3: atext = "оружие";
			}


			Player[i][uLicensesTake][listitemm] = getdate() + strval(inputtext);
            Player[i][uLicenses][listitemm] = 0;
            format( gb_string, sizeof gb_string, "%d|%d|%d|%d",
				Player[i][uLicenses][0],Player[i][uLicenses][1],Player[i][uLicenses][2],Player[i][uLicenses][3]);
            format( query, sizeof query, "UPDATE gb_users SET uLicenses = '%s' WHERE BINARY uName = '%s'",
				gb_string, Player[i][uName] );
			mysql_query( mysql, query );

			format( gb_string,sizeof gb_string,"%d|%d|%d|%d",
				Player[i][uLicensesTake][0], Player[i][uLicensesTake][1], Player[i][uLicensesTake][2],
				Player[i][uLicensesTake][3] );
            format(query,sizeof(query),"UPDATE gb_users SET uLicensesTake = '%s' WHERE BINARY uName = '%s'", 
				gb_string, Player[i][uName] );
			mysql_query( mysql, query );

			format( gb_string, sizeof gb_string, ""gbInfo"Офицер %s забрал у вас лицензию на %s, на %d дней", Player[playerid][uName], atext, strval(inputtext));
			SendClientMessage( i, -1, gb_string );
			format( gb_string, sizeof gb_string, ""gbAccess"Вы забрали лицензию у %s на %d дней.", Player[i][uName], strval(inputtext));
			SendClientMessage( playerid, -1, gb_string );

		}
		case d_police + 1:
		{
		    if(!response) return 1;
		    new price = GetPVarInt(playerid, "SellLicPrice");
		    Player[playerid][uMoney] -= price;
		    Player[playerid][uLicenses][3] = 1;
		    new dates[50], year,month,days;
			
			format( gb_string, sizeof gb_string,"%d|%d|%d|%d",
				Player[playerid][uLicenses][0],Player[playerid][uLicenses][1],Player[playerid][uLicenses][2],Player[playerid][uLicenses][3]);
	        format( query, sizeof query, "UPDATE gb_users SET uLicenses = '%s' WHERE BINARY uName = '%s'",
				gb_string, Player[playerid][uName] );
			mysql_query( mysql, query );
			
			getdate(year, month, days);
			format( dates, 16, "%02d.%02d.%04d", days, month, year);
	        format( query, sizeof query,"UPDATE gb_users SET uLicGiveDate = '%s' WHERE BINARY uName = '%s'",
				dates, Player[playerid][uName] );
			mysql_query( mysql, query );
			
			S::[0][sMeria][0] += price;
			format( query, sizeof query,"UPDATE gb_others SET sMeria0 = %d", S::[0][sMeria][0] );
			mysql_query( mysql, query );

		    SendClientMessage(playerid,C_GRAY,""gbAccess"Поздравляем вас с покупкой лицензии на оружие!");
			
			new 
				id = GetPVarInt( playerid, "SellLicPriceId" );
			
			format:gb_string( "%s продал лицензию %s за %d", Player[id][uName], Player[playerid][uName], price );
			logs( 14, gb_string, Player[id][uID], Player[playerid][uID] );
			
			DeletePVar( playerid, "SellLicPriceId" );
		}
		case d_firedp:
		{
		    if(!response) return 1;
			else
			{
			    if(Player[playerid][uSex] == 1)
				{
				    for(new i; i < 12; i++)
					{
						if(SkinsFrac[Player[playerid][uMember]][i] == 0) continue;
					  	PlayerTextDrawSetPreviewModel(playerid, NewSkinSelect[i][playerid], SkinsFrac[Player[playerid][uMember]][i]);
						PlayerTextDrawShow(playerid, NewSkinSelect[i][playerid]);
					}
					PlayerTextDrawShow(playerid, NewSkinSelect[12][playerid]);
					SelectTextDraw(playerid, 0xd3d3d3FF);
					SetPVarInt(playerid, "PlayerMenuShow",9);
					SetPVarInt(playerid, "GuperOnSelect", 1);
					showPlayerDialog(playerid,9999,0," ","{ffffff}Нажмите кнопку "cGREEN"ESC {ffffff}чтобы закрыть меню.","Закрыть","");
				}
				else
				{
				    SetPlayerSkin(playerid,191);
				    Player[playerid][uIsPlayerJob][2] = 1;
				    SetPlayerColor(playerid,FracColor[Player[playerid][uMember]]);
				}
			}
		}
		case d_medical:
		{
			if(!response) return 1;
			if(Player[playerid][uIsPlayerJob][1] == 1)
			{
			    GetBackSkin(playerid);
				SetPlayerColor(playerid,FracColor[0]);
				Player[playerid][uIsPlayerJob][1] = 0;
				UpdatePlayerJob( playerid );
				
				gb_string[0] = EOS;
				format:gb_string( "%s", Player[playerid][uSex] == 2 ? ("переоделась") : ("переоделся") );
				MeAction( playerid, gb_string, 1 );
				
				RemoveStateItems( playerid );
			}
			else
			{
			    if(Player[playerid][uSex] == 1)
				{
				    for(new i; i < 12; i++)
					{
						if(SkinsFrac[Player[playerid][uMember]][i] == 0) continue;
					  	PlayerTextDrawSetPreviewModel(playerid, NewSkinSelect[i][playerid], SkinsFrac[Player[playerid][uMember]][i]);
						PlayerTextDrawShow(playerid, NewSkinSelect[i][playerid]);
					}
					PlayerTextDrawShow(playerid, NewSkinSelect[12][playerid]);
					SelectTextDraw(playerid, 0xd3d3d3FF);
					SetPVarInt(playerid, "PlayerMenuShow",9);
					SetPVarInt(playerid, "GuperOnSelect", 1);
					Player[playerid][uIsPlayerJob][1] = 1;
					UpdatePlayerJob( playerid );
					showPlayerDialog(playerid,9999,0," ","{ffffff}Нажмите кнопку "cGREEN"ESC {ffffff}чтобы закрыть меню.","Закрыть","");
				}
				else
				{
					SetPlayerSkin(playerid, 308);
					SetPlayerColor(playerid,FracColor[Player[playerid][uMember]]);
					Player[playerid][uIsPlayerJob][1] = 1;
					UpdatePlayerJob( playerid );
				}
			}
		}
		
		case d_licenses: {
			if(!response) return 1;
			if(Player[playerid][uLicenses][listitem] != 0) return SendClientMessage(playerid,C_GRAY,""gbError"У вас уже есть данная лицензия!");
			SetPVarInt(playerid,"playerSelectLic",listitem);
			switch(listitem) {
				case 0: {
				    if(Player[playerid][uLicensesTake][0] != 0 && Player[playerid][uLicensesTake][0] > getdate()) return SendClientMessage(playerid, -1, ""gbError"Ваша лицензия временно конфискована. Приобрести новую нельзя!");
					if(Player[playerid][uMoney] < 600) return SendClientMessage(playerid,C_GRAY,""gbError"У вас недостаточно денег для покупки лицензии!");
					showPlayerDialog(playerid,d_licenses + 1,0," ","{ffffff}Вы точно хотите купить эту лицензию за "cGREEN"$600{ffffff}?","Да","Нет");
				}
				case 1: {
				    if(Player[playerid][uLicensesTake][1] > getdate()) return SendClientMessage(playerid, -1, ""gbError"Ваша лицензия временно конфискована. Приобрести новую нельзя!");
					if(Player[playerid][uMoney] < 2000) return SendClientMessage(playerid,C_GRAY,""gbError"У вас недостаточно денег для покупки лицензии!");
					showPlayerDialog(playerid,d_licenses + 1,0," ","{ffffff}Вы точно хотите купить эту лицензию за "cGREEN"$2000{ffffff}?","Да","Нет");
				}
				case 2: {
				    if(Player[playerid][uLicensesTake][2] > getdate()) return SendClientMessage(playerid, -1, ""gbError"Ваша лицензия временно конфискована. Приобрести новую нельзя!");
					if(Player[playerid][uMoney] < 4000) return SendClientMessage(playerid,C_GRAY,""gbError"У вас недостаточно денег для покупки лицензии!");
					showPlayerDialog(playerid,d_licenses + 1,0," ","{ffffff}Вы точно хотите купить эту лицензию за "cGREEN"$4000{ffffff}?","Да","Нет");
				}
			}
		}
		case d_licenses + 1: {
			if(!response) return 1;

			switch(GetPVarInt(playerid,"playerSelectLic")) {
				case 0: Player[playerid][uMoney] -= 600;
				case 1: Player[playerid][uMoney] -= 2000;
				case 2: Player[playerid][uMoney] -= 4000;
			}
			format( query, sizeof query,"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",
				Player[playerid][uMoney], Player[playerid][uName]	);
			mysql_query( mysql, query );
			
			Player[playerid][uLicenses][GetPVarInt(playerid,"playerSelectLic")] = 1;
			format( gb_string, sizeof gb_string,"%d|%d|%d|%d",
				Player[playerid][uLicenses][0],Player[playerid][uLicenses][1],Player[playerid][uLicenses][2],
				Player[playerid][uLicenses][3]);
            format(query,sizeof(query),"UPDATE gb_users SET uLicenses = '%s' WHERE BINARY uName = '%s'",
				gb_string, Player[playerid][uName]);
			mysql_query( mysql, query );
			SendMes( playerid, C_GRAY, ""gbAccess"Поздравляем вас с покупкой новой лицензии!" );
		}
		
		

		case d_meria:
		{
		    if(!response) return 1;
		    switch(listitem) {
		        case 0: {
		            string = "";
		            format(str,sizeof(str),"{ffffff}Сумма в казне штата - "cGREEN"$%d\n\n",S::[0][sMeria][0]),strcat(string,str);
		            format(str,sizeof(str),"{ffffff}Налог за дом ( 1 день ) - "cGREEN"$%d\n",S::[0][sHouses]),strcat(string,str);
		            format(str,sizeof(str),"{ffffff}Налог за бизнес ( 1 день ) - "cGREEN"$%d\n\n",S::[0][sBusiness]),strcat(string,str);
		            format(str,sizeof(str),"{ffffff}Стоимость проезда в автобусе - "cGREEN"$%d\n\n",S::[0][sMeria][1]),strcat(string,str);
		            format(str,sizeof(str),"{ffffff}%s - "cGREEN"$%d\n",F::[1][fName],S::[0][sMeria][2]),strcat(string,str);
		            format(str,sizeof(str),"{ffffff}%s - "cGREEN"$%d\n",F::[2][fName],S::[0][sMeria][3]),strcat(string,str);
		            format(str,sizeof(str),"{ffffff}%s - "cGREEN"$%d\n",F::[3][fName],S::[0][sMeria][4]),strcat(string,str);
		            format(str,sizeof(str),"{ffffff}%s - "cGREEN"$%d\n",F::[4][fName],S::[0][sMeria][5]),strcat(string,str);
		            format(str,sizeof(str),"{ffffff}%s - "cGREEN"$%d\n",F::[5][fName],S::[0][sMeria][6]),strcat(string,str);
		            format(str,sizeof(str),"{ffffff}%s - "cGREEN"$%d\n",F::[6][fName],S::[0][sMeria][7]),strcat(string,str);
		            format(str,sizeof(str),"{ffffff}%s - "cGREEN"$%d\n",F::[7][fName],S::[0][sMeria][8]),strcat(string,str);
		            showPlayerDialog(playerid,9999,0,"Информация",string,"Закрыть","");
				}
				case 1: showPlayerDialog(playerid,d_meria + 1,2,"Настройка налогов","1. "cGRAY"Налог за дом ( 1 день )\n{ffffff}2. "cGRAY"Налог за бизнес ( 1 день )","Далее","Закрыть");
				case 2: {
				    string = "";
				    format(str,sizeof(str),"1. "cGRAY"%s - "cGREEN"$%d\n",F::[1][fName],S::[0][sMeria][2]),strcat(string,str);
				    format(str,sizeof(str),"2. "cGRAY"%s - "cGREEN"$%d\n",F::[2][fName],S::[0][sMeria][3]),strcat(string,str);
				    format(str,sizeof(str),"3. "cGRAY"%s - "cGREEN"$%d\n",F::[3][fName],S::[0][sMeria][4]),strcat(string,str);
				    format(str,sizeof(str),"4. "cGRAY"%s - "cGREEN"$%d\n",F::[4][fName],S::[0][sMeria][5]),strcat(string,str);
				    format(str,sizeof(str),"5. "cGRAY"%s - "cGREEN"$%d\n",F::[5][fName],S::[0][sMeria][6]),strcat(string,str);
				    format(str,sizeof(str),"6. "cGRAY"%s - "cGREEN"$%d\n",F::[6][fName],S::[0][sMeria][7]),strcat(string,str);
				    format(str,sizeof(str),"7. "cGRAY"%s - "cGREEN"$%d\n",F::[7][fName],S::[0][sMeria][8]),strcat(string,str);
				    format(str,sizeof(str),"8. "cGRAY"%s - "cGREEN"$%d\n",F::[8][fName],S::[0][sMeria][9]),strcat(string,str);
				    showPlayerDialog(playerid,d_meria + 7,2,"Настройка зарплат",string,"Далее","Закрыть");
				}
				case 3: showPlayerDialog(playerid,d_meria + 5,2,"Цены за проезд","1. "cGRAY"Цена проезда в автобусе","Далее","Закрыть");
				case 4:
				{
				    /*format(string, sizeof(string), "Тип бизнеса\tНалог\n\nЗакусочная\t%d\nБар\t%d\nРесторан\nМагазин одежды\t%d\nМагазин электроники\t%d\nАвтосалон\t%d\nМагаин оружия\t%d\n\
					Магазин мебели\t%d\nКлуб\t%d\nАЗС\t%d\nВсе для отдыха\t%d\nАренда транспорта\t%d\nСпортзалы\t%d", );
					showPlayerDialog(playerid,d_meria + 15,DIALOG_STYLE_TABLIST_HEADERS,"Налог на прибыль",string,"Далее","Закрыть");*/
				}
				//showPlayerDialog(playerid, 1, , "Налог на прибыль", "", "Далее", "Закрыть");
			}
		}
		case d_meria + 1: {
		    if(!response) return 1;
			switch(listitem) {
			    case 0: showPlayerDialog(playerid,d_meria + 2,1,"Налог за дом ( 1 день )","{ffffff}Введите цену за 1 день оплаты налогов дома:\n\n"cGREEN"| Минимальный налог $100, максимальный $300","Далее","Закрыть");
				case 1:
				{
				    string = "";
				    format(str,sizeof(str),"1. "cGRAY"Закусочная - "cGREEN"%d%\n",S::[0][sNalog][0]),strcat(string,str);
				    format(str,sizeof(str),"2. "cGRAY"Бар - "cGREEN"%d%\n",S::[0][sNalog][1]),strcat(string,str);
				    format(str,sizeof(str),"3. "cGRAY"Ресторан - "cGREEN"%d%\n",S::[0][sNalog][2]),strcat(string,str);
				    format(str,sizeof(str),"4. "cGRAY"Магазин одежды - "cGREEN"%d%\n",S::[0][sNalog][3]),strcat(string,str);
				    format(str,sizeof(str),"5. "cGRAY"Магазин электроники - "cGREEN"%d%\n",S::[0][sNalog][4]),strcat(string,str);
				    format(str,sizeof(str),"6. "cGRAY"Автосалон - "cGREEN"%d%\n",S::[0][sNalog][5]),strcat(string,str);
				    format(str,sizeof(str),"7. "cGRAY"Магазин оружия - "cGREEN"%d%\n",S::[0][sNalog][6]),strcat(string,str);
				    format(str,sizeof(str),"8. "cGRAY"Магазин мебели - "cGREEN"%d%\n",S::[0][sNalog][7]),strcat(string,str);
				    format(str,sizeof(str),"9. "cGRAY"Клуб - "cGREEN"%d%\n",S::[0][sNalog][8]),strcat(string,str);
				    format(str,sizeof(str),"10. "cGRAY"Заправка - "cGREEN"%d%\n",S::[0][sNalog][9]),strcat(string,str);
				    format(str,sizeof(str),"11. "cGRAY"Все для отдыха - "cGREEN"%d%\n",S::[0][sNalog][10]),strcat(string,str);
				    format(str,sizeof(str),"12. "cGRAY"Аренда транспорта - "cGREEN"%d%\n",S::[0][sNalog][11]),strcat(string,str);
				    format(str,sizeof(str),"13. "cGRAY"Спортзал - "cGREEN"%d%\n",S::[0][sNalog][12]),strcat(string,str);
				    showPlayerDialog(playerid,d_meria + 3,2,"Настройка налогов",string,"Далее","Закрыть");
				}
			}
		}
		case d_meria + 2: {
		    if(!response) return 1;
		    if(!strlen(inputtext)) return showPlayerDialog(playerid,d_meria + 2,1,"Налог за бизнес ( 1 день )","{ffffff}Введите цену за 1 день оплаты налогов бизнеса:\n\n"cGREEN"| Минимальный налог $200, максимальный $500","Далее","Закрыть");
		    if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_meria + 2,1,"Налог за бизнес ( 1 день )","{ffffff}Введите цену за 1 день оплаты налогов дома:\n\n"cGREEN"| Минимальный налог $100, максимальный $300","Далее","Закрыть");
		    if(strval(inputtext) < 100 || strval(inputtext) > 300) return showPlayerDialog(playerid,d_meria + 2,1,"Налог за дом ( 1 день )","{ffffff}Введите цену за 1 день оплаты налогов дома:\n\n"cGREEN"| Минимальный налог $100, максимальный $300","Далее","Закрыть");
		    S::[0][sHouses] = strval(inputtext);
		    format(query,sizeof(query),"UPDATE gb_others SET sHouses = %d",S::[0][sHouses]);
			mysql_tquery(1, query, "", "");
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы установили новый налог 1 день оплаты дома!");
		}
		case d_meria + 3: {
		    if(!response) return 1;
		    new nName[30];
			SetPVarInt(playerid,"playerSelectNalog",listitem);
			switch(listitem)
			{
			    case 0: nName = "Закусочную";
			    case 1: nName = "Бар";
			    case 2: nName = "Ресторан";
			    case 3: nName = "Магазин одежды";
			    case 4: nName = "Магазин электроники";
			    case 5: nName = "Автосалон";
			    case 6: nName = "Магазин оружия";
			    case 7: nName = "Магазин мебели";
			    case 8: nName = "Клуб";
			    case 9: nName = "Заправку";
			    case 10: nName = "Все для отдыха";
			    case 11: nName = "Аренда транспорта";
				case 12: nName = "Спортзал";
			}
			format(string, sizeof(string), "{ffffff}Введите новый налог на "cBLUE"%s\n\n"gbAccess"Минимальный процент 2, а максимальный 20.", nName);
			showPlayerDialog(playerid,d_meria + 14,1," ",string,"Далее","Закрыть");
		}
		case d_meria + 14: {
		    if(!response) return 1;
		    new nName[30];
			new id = GetPVarInt(playerid, "playerSelectNalog");
			switch(id)
			{
			    case 0: nName = "Закусочную";
			    case 1: nName = "Бар";
			    case 2: nName = "Ресторан";
			    case 3: nName = "Магазин одежды";
			    case 4: nName = "Магазин электроники";
			    case 5: nName = "Автосалон";
			    case 6: nName = "Магазин оружия";
			    case 7: nName = "Магазин мебели";
			    case 8: nName = "Клуб";
			    case 9: nName = "Заправку";
			    case 10: nName = "Все для отдыха";
			    case 11: nName = "Аренда транспорта";
			    case 12: nName = "Спортзал";
			}
			format(string, sizeof(string), "{ffffff}Введите новый налог на "cBLUE"%s\n\n"gbAccess"Минимальный процент 2, а максимальный 20.", nName);

		    if(!strlen(inputtext)) return showPlayerDialog(playerid,d_meria + 14,1," ",string,"Далее","Закрыть");
		    if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_meria + 14,1," ",string,"Далее","Закрыть");
		    if(strval(inputtext) < 2 || strval(inputtext) > 20) return showPlayerDialog(playerid,d_meria + 14,1," ",string,"Далее","Закрыть");
			S::[0][sNalog][id] = strval(inputtext);
			format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d",S::[0][sNalog][0],S::[0][sNalog][1],S::[0][sNalog][2],
 			S::[0][sNalog][3],S::[0][sNalog][4],S::[0][sNalog][5],S::[0][sNalog][6],S::[0][sNalog][7],S::[0][sNalog][8],S::[0][sNalog][9],S::[0][sNalog][10],S::[0][sNalog][11],S::[0][sNalog][12]);
   			format(query,sizeof(query),"UPDATE gb_others SET Nalog = '%s'",string);
			mysql_tquery(1, query, "", "");
			//-------------------[]-----------------------------
			string = "";
		  	format(str,sizeof(str),"1. "cGRAY"Закусочная - "cGREEN"%d%\n",S::[0][sNalog][0]),strcat(string,str);
	    	format(str,sizeof(str),"2. "cGRAY"Бар - "cGREEN"%d%\n",S::[0][sNalog][1]),strcat(string,str);
	    	format(str,sizeof(str),"3. "cGRAY"Ресторан - "cGREEN"%d%\n",S::[0][sNalog][2]),strcat(string,str);
	    	format(str,sizeof(str),"4. "cGRAY"Магазин одежды - "cGREEN"$%d%\n",S::[0][sNalog][3]),strcat(string,str);
	    	format(str,sizeof(str),"5. "cGRAY"Магазин электроники - "cGREEN"%d%\n",S::[0][sNalog][4]),strcat(string,str);
	    	format(str,sizeof(str),"6. "cGRAY"Автосалон - "cGREEN"%d%\n",S::[0][sNalog][5]),strcat(string,str);
	    	format(str,sizeof(str),"7. "cGRAY"Магазин оружия - "cGREEN"%d%\n",S::[0][sNalog][6]),strcat(string,str);
	    	format(str,sizeof(str),"8. "cGRAY"Магазин мебели - "cGREEN"%d%\n",S::[0][sNalog][7]),strcat(string,str);
	    	format(str,sizeof(str),"9. "cGRAY"Клуб - "cGREEN"%d%\n",S::[0][sNalog][8]),strcat(string,str);
   	 		format(str,sizeof(str),"10. "cGRAY"Заправка - "cGREEN"%d%\n",S::[0][sNalog][9]),strcat(string,str);
   	 		format(str,sizeof(str),"11. "cGRAY"Все для отдыха - "cGREEN"%d%\n",S::[0][sNalog][10]),strcat(string,str);
   	 		format(str,sizeof(str),"12. "cGRAY"Аренда транспорта - "cGREEN"%d%\n",S::[0][sNalog][11]),strcat(string,str);
   	 		format(str,sizeof(str),"13. "cGRAY"Спортзал - "cGREEN"%d%\n",S::[0][sNalog][12]),strcat(string,str);
	    	showPlayerDialog(playerid,d_meria + 3,2,"Настройка налогов",string,"Далее","Закрыть");


		}
		case d_meria + 5: {
		    if(!response) return 1;
		    switch(listitem) {
		        case 0: showPlayerDialog(playerid,d_meria + 6,1,"Цена за проезд в автобусе","{ffffff}Введите новую цену за проезд в автобусе:\n\n"cRED"| Минимальная цена $1, а максимальная $20","Далее","Закрыть");
		    }
		}

		case d_meria + 6: {
		    if(!response) return 1;
			if(!strlen(inputtext)) return showPlayerDialog(playerid,d_meria + 6,1,"Цена за проезд в автобусе","{ffffff}Введите новую цену за проезд в автобусе:\n\n"cRED"| Минимальная цена $1, а максимальная $20","Далее","Закрыть");
		    if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_meria + 6,1,"Цена за проезд в автобусе","{ffffff}Введите новую цену за проезд в автобусе:\n\n"cRED"| Минимальная цена $1, а максимальная $20","Далее","Закрыть");
		    if(strval(inputtext) < 1 || strval(inputtext) > 20) return showPlayerDialog(playerid,d_meria + 6,1,"Цена за проезд в автобусе","{ffffff}Введите новую цену за проезд в автобусе:\n\n"cRED"| Минимальная цена $1, а максимальная $20","Далее","Закрыть");
			S::[0][sMeria][1] = strval(inputtext);
			format(query,sizeof(query),"UPDATE gb_others SET sMeria1 = %d",S::[0][sMeria][1]);
			mysql_tquery(1, query, "", "");
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы установили новую цену за проезд в автобусе!");
		}
		case d_meria + 7: {
		    if(!response) return 1;
			SetPVarInt(playerid,"playerSelectMeria",listitem);
			showPlayerDialog(playerid,d_meria + 8,1,F::[listitem + 1][fName],"{ffffff}Введите новую зарплату в этой организации за ранг:\n\n"cRED"| Минимальная зарплата $100, а максимальная $500","Далее","Закрыть");
		}
		case d_meria + 8: {
		    new id = GetPVarInt(playerid,"playerSelectMeria") + 2;
		    DeletePVar(playerid,"playerSelectMeria");
		    if(!response) return 1;
		    if(!strlen(inputtext)) return showPlayerDialog(playerid,d_meria + 8,1,F::[GetPVarInt(playerid,"playerSelectMeria") + 1][fName],"{ffffff}Введите новую зарплату в этой организации за ранг:\n\n"cRED"| Минимальная зарплата $100, а максимальная $500","Далее","Закрыть");
		    if(!isNumeric(inputtext)) return showPlayerDialog(playerid,d_meria + 8,1,F::[GetPVarInt(playerid,"playerSelectMeria") + 1][fName],"{ffffff}Введите новую зарплату в этой организации за ранг:\n\n"cRED"| Минимальная зарплата $100, а максимальная $500","Далее","Закрыть");
		    if(strval(inputtext) < 100 || strval(inputtext) > 700) return showPlayerDialog(playerid,d_meria + 8,1,F::[GetPVarInt(playerid,"playerSelectMeria") + 1][fName],"{ffffff}Введите новую зарплату в этой организации за ранг:\n\n"cRED"| Минимальная зарплата $100, а максимальная $500","Далее","Закрыть");
			S::[0][sMeria][id] = strval(inputtext);
			format(query,sizeof(query),"UPDATE gb_others SET sMeria%d = %d",id,S::[0][sMeria][id]);
			mysql_tquery(1, query, "", "");
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы установили новую зарплату данной организации!");
		}
		case d_meria + 9: {
		    if(!response) return 1;
            GivePlayerItem(playerid,452,1);
            SendClientMessage(playerid,C_GRAY,""gbAccess"Поздравляем, Вы получили документы.");
            MeAction(playerid,"получил(-а) документы",1);
		}
		case d_target: {
		    if(!response) return 1;
			switch(listitem) {
			    case 0: {
			        CallLocalFunction( "cmd_pass", "ii", playerid, GetPVarInt(playerid,"playerTarget") );
			        format(string,sizeof(string),"показал(-а) паспорт %s'y",Player[GetPVarInt(playerid,"playerTarget")][uName]);
					MeAction(playerid,string,1);
			        DeletePVar(playerid,"playerTarget");
			    }
			    case 1: {
				    if(Player[playerid][uRegDate] + (172800) >= gettime()) return SendClientMessage(playerid,C_GRAY,""gbError"Для передачи денег вы должны отыграть 2 дня.");
					showPlayerDialog(playerid,d_target + 1,1," ","{ffffff}Введите сумму которую хотите передать:","Далее","Закрыть");
				}
				case 2: {
				    SetPVarInt(GetPVarInt(playerid,"playerTarget"), "PlayerHandshake", playerid);
					format(string, sizeof(string), ""gbInfo"Вы предложили игроку "cBLUE"%s"cWHITE" пожать вам руку.", Player[GetPVarInt(playerid,"playerTarget")][uName]);
					SendClientMessage(playerid, -1, string);
					format(string, sizeof(string), ""gbInfo"Игрок "cBLUE"%s"cWHITE" предложил вам пожать ему руку.", Player[playerid][uName]);
					SendClientMessage(GetPVarInt(playerid,"playerTarget"), -1, string);
					SendClientMessage(GetPVarInt(playerid,"playerTarget"), -1, ""gbInfo"Нажмите {33AA33}Y"cWHITE", чтобы согласиться или {FF6347}N"cWHITE", чтобы отказаться." );
				}
				case 3: {
				   	SetPVarInt(GetPVarInt(playerid,"playerTarget"), "PlayerFrisk", playerid);
					format(string, sizeof(string), ""gbInfo"Вы предложили игроку %s обыскать его", Player[GetPVarInt(playerid,"playerTarget")][uName]);
					SendClientMessage(playerid, -1, string);
					format(string, sizeof(string), ""gbInfo"Игрок %s хочет обыскать вас", Player[playerid][uName]);
					SendClientMessage(GetPVarInt(playerid,"playerTarget"), -1, string);
					SendClientMessage(GetPVarInt(playerid,"playerTarget"), -1, ""gbInfo"Нажмите {33AA33}Y"cWHITE", чтобы согласиться или {FF6347}N"cWHITE", чтобы отказаться." );

				}
			}
		}
		case d_target + 1: 
		{
		    if(!response) return 1;
		    if(Player[playerid][uMoney] < strval(inputtext)) return SendClientMessage(playerid,C_GRAY,""gbError"Недостаточно денег для передачи такой суммы!");
		    if(strval(inputtext) < 1 || strval(inputtext) > 1000000) return SendClientMessage(playerid,C_GRAY,""gbError"Минимальная сумма передачи - $1 | Максимальная - $100.000");
			if(GetDistanceBetweenPlayers(playerid, GetPVarInt(playerid,"playerTarget") ) > 3.0 
				|| GetPlayerVirtualWorld(playerid) != GetPlayerVirtualWorld( GetPVarInt(playerid,"playerTarget") )) 
				return SendClientMessage(playerid,C_GRAY,""gbError"Данного игрока нет рядом с вами!");
				
			Player[playerid][uMoney] -= strval(inputtext);
			Player[GetPVarInt(playerid,"playerTarget")][uMoney] += strval(inputtext);

			format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, query, "", "");
			format(query,sizeof(query),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[GetPVarInt(playerid,"playerTarget")][uMoney],Player[GetPVarInt(playerid,"playerTarget")][uName]);
			mysql_tquery(1, query, "", "");

			format(string,sizeof(string),""gbAccess"Вы передали %s - "cGREEN"$%d",Player[GetPVarInt(playerid,"playerTarget")][uName],strval(inputtext));
			SendClientMessage(playerid,C_GRAY,string);
			format(string,sizeof(string),""gbAccess"%s передал(-а) вам - "cGREEN"$%d",Player[playerid][uName],strval(inputtext));
			SendClientMessage(GetPVarInt(playerid,"playerTarget"),C_GRAY,string);

			format(string,sizeof(string),"передал(-а) деньги %s'y",Player[GetPVarInt(playerid,"playerTarget")][uName]);
			MeAction(playerid,string,1);
			
			format:gb_string( "[A] %s[%d][%s] передал деньги %s[%d][%s] - $%d", 
				Player[playerid][uName], 
				playerid, 
				Player[playerid][uIP], 
				Player[GetPVarInt( playerid,"playerTarget" )][uName], 
				GetPVarInt( playerid,"playerTarget"), 
				Player[ GetPVarInt(playerid,"playerTarget" )][uIP],
				strval( inputtext )
			);
			
			SendAdminLog( playerid, gb_string );
			
			ApplyAnimation(playerid,"DEALER", "shop_pay",4.0, 0, 1, 1, 0, 0, 1);

			DeletePVar(playerid,"playerTarget");
		}
	}
	
	return 1;
}

public OnPlayerEnterCheckpoint(playerid) {
	clear_massive();
	DisablePlayerCheckpoint(playerid);
	if(GetPVarInt(playerid,"playerUseGPS") == 1) {
	    SendClientMessage(playerid,C_GRAY,""gbAccess"Вы достигли места назначения!");
	    SetPVarInt(playerid,"playerUseGPS",0);
	}

	if(GetPVarInt(playerid, "CallInfoGPS") == 1)
	{
	    new id = GetPVarInt(playerid, "CallInfoIndex");
 	    CallInfo[id][cStatus] = false;
	    DeletePVar(playerid,"CallInfoGPS");
	    DisablePlayerCheckpoint(playerid);
	}
	if(GetPVarInt(playerid,"WoodCheckpointTop")) {
	    if(D::[playerid][dWoodsDuty] == 0) {
	        DeletePVar(playerid,"WoodCheckpointTop");
	        DisablePlayerCheckpoint(playerid);
	    }
	    if(IsPlayerInRangeOfPoint(playerid,3.0,-462.9798,-88.4665,59.9006)) {
	        ClearAnimations(playerid);
	        RemovePlayerAttachedObject(playerid,9);
	        DisablePlayerCheckpoint(playerid);
	        DeletePVar(playerid,"WoodCheckpointTop");
	        SetPlayerSpecialAction(playerid, SPECIAL_ACTION_NONE);
	        SetPlayerAttachedObject(playerid,9,341,6);
	        new obj = CreateDynamicObject(1463,-462.97189, -87.00266, 60.04498,0.00000, 0.00000, -90.00000);
	        SetGVarInt("WoodConv",1,obj);
	        MoveDynamicObject(obj,-462.97189, -77.84270, 60.04500,1,0.00000, 0.00000, -90.00000);
	        SetPVarInt(playerid,"PlayerUseBox",4);
	        MeAction(playerid,"положил(-а) древесину на конвеер",1);
         	if(JobValueNow(playerid, 2, 34, -1) != 0) { }
			else {
			    SendClientMessage(playerid, -1, ""gbAccess"Ваша зарплата перечислена на чековую книжку, обналичить ее можно в банке");
			    showPlayerDialog(playerid, 9999, 0, " ", "{ffffff}Ваш рабочий день закончен!\n\n"cGREEN"| Ваша зарплата перечислена на чековую книжку.\n"gbError"Снять деньги с чековой книжки можно в банке", "Закрыть", "");
    			D::[playerid][dWoodsDuty] = 0;
				DeletePVar(playerid,"PlayerUseBox");
				DeletePVar(playerid,"PlayerStanok");
    			GetBackSkin(playerid);
				RemovePlayerAttachedObject(playerid,9);
				SetPlayerSpecialAction(playerid, SPECIAL_ACTION_NONE);
			}
	    }
	}
	if(GetPVarInt(playerid,"PlayerDriverCheckpoint")) {
	    new v = PlayerTrailer[playerid];
	    switch(GetPVarInt(playerid,"PlayerSelectTrailerTwo")) {
	        case 1: {
	            if(IsPlayerInRangeOfPoint(playerid,5.0,-18.9291,-273.3552,5.4297)) {
					if(V::[v][vMebel] >= MAX_MEBEL_IN_VEHICLE) return SendClientMessage(playerid,C_GRAY,""gbError"В прицепе нет места для загрузки мебели в него.");

					if(MebelZavod <= 0) {
					    SetPVarInt(playerid,"PlayerDriverCheckpoint",_:SetPlayerCheckpoint(playerid,1061.2046,-322.2485,73.9851,5.0));
					    SendClientMessage(playerid,C_GRAY,""gbInfo"На заводе мебели больше нет мебели, верните прицеп на склад!");
					}
					else if(MebelZavod > 0) {
					    if(MebelZavod < MAX_MEBEL_IN_VEHICLE) {
					        V::[v][vMebel] = MebelZavod;
					        MebelZavod = 0;
					    }
					    else {
					        V::[v][vMebel] = MAX_MEBEL_IN_VEHICLE;
                            MebelZavod -= MAX_MEBEL_IN_VEHICLE;
					    }
					    format(gb_string,sizeof(gb_string),"Мебель\n{ffffff}%d/%d ед.",V::[v][vMebel],MAX_MEBEL_IN_VEHICLE);
      					UpdateDynamic3DTextLabelText(V::[v][vTextTrailer],C_BLUE,gb_string);
	            		format(gb_string,sizeof(gb_string),"Завод мебели\n\n{ffffff}Мебель: %d ед.\nДревесины: %d ед.",MebelZavod,WoodsZavod);
						UpdateDynamic3DTextLabelText(InfoFermText[7],C_BLUE,gb_string);
						SetPVarInt(playerid,"PlayerDriverCheckpoint",_:SetPlayerCheckpoint(playerid,1061.2046,-322.2485,73.9851,5.0));
						SendClientMessage(playerid,C_GRAY,""gbInfo"Вам в прицеп загрузили мебель, отвезите её на общий склад.");
					}

					togglePlayerControllable(playerid,false);
					SetPVarInt(playerid,"playerFreezingTime",MAX_TIME_UNFREEZE_J);
	            }
	            if(IsPlayerInRangeOfPoint(playerid,5.0,1061.2046,-322.2485,73.9851)) 
				{
	                S::[0][sProducts] += V::[v][vMebel];
	                V::[v][vMebel] = 0;
					
					if(IsValidDynamic3DTextLabel(V::[v][vTextTrailer]))
						DestroyDynamic3DTextLabel(V::[v][vTextTrailer]);
						
	                DestroyVehicle(v);
	                
	                SetPVarInt(playerid,"dettachTrailer",0);
	                PlayerTrailer[playerid] = -1;
					if(Player[playerid][uDalnSkill] != 150) Player[playerid][uDalnSkill] ++;
					if(JobValueNow(playerid, 10, 300,Player[playerid][uJob]) != 0) { }
					else
					{
					    D::[playerid][dDalnDuty] = false;
		                if(D::[playerid][dDalnKey] != -1) SetVehicleToRespawn(D::[playerid][dDalnKey]);
						DisablePlayerCheckpoint(playerid);
					}
					format(gb_string,sizeof(gb_string),"UPDATE gb_users SET uDalnSkill = '%d' WHERE BINARY uName = '%s'",Player[playerid][uDalnSkill],Player[playerid][uName]);
					mysql_tquery(1, gb_string, "", "");
	            }
	        }
	        case 2: {
	        	if(IsPlayerInRangeOfPoint(playerid,5.0,248.2978,1420.6721,10.5727)) {
	        	    if(V::[v][vToplivo] >= MAX_FUEL_IN_VEHICLE) return showPlayerDialog(playerid,d_daln + 2,2,"Выбор маршрута","1. "cGRAY"Отвозить топливо по бизнесам","Далее","Закрыть");
	        	    if(ToplivoZavod == 0) return SendClientMessage(playerid,C_GRAY,""gbError"На заводе закончилось топливо.");

	        	    if(ToplivoZavod <= 0) {
	        	        SetPVarInt(playerid,"PlayerDriverCheckpoint",_:SetPlayerCheckpoint(playerid,1061.2046,-322.2485,73.9851,5.0));
	        	        SendClientMessage(playerid,C_GRAY,""gbInfo"На заводе закончилось топливо, верните прицеп на склад!");
	        	    }
	        	    else if(ToplivoZavod > 0) {
	        	        if(ToplivoZavod < MAX_FUEL_IN_VEHICLE) {
	        	            V::[v][vToplivo] = ToplivoZavod;
	        	            ToplivoZavod = 0;
	        	        }
	        	        else {
	        	            V::[v][vToplivo] = MAX_FUEL_IN_VEHICLE;
	        	            ToplivoZavod -= MAX_FUEL_IN_VEHICLE;
	        	        }
	        	        format(gb_string,sizeof(gb_string),"Топливо\n{ffffff}%d/%d л.",V::[v][vToplivo],MAX_FUEL_IN_VEHICLE);
			            UpdateDynamic3DTextLabelText(V::[v][vTextTrailer],C_BLUE,gb_string);
			            format(gb_string,sizeof(gb_string),"Нефтеперерабатывающий завод\n\n{ffffff}Топливо: {ffffff}%d л.",ToplivoZavod);
			            UpdateDynamic3DTextLabelText(InfoFermText[8],C_BLUE,gb_string);
	        	        showPlayerDialog(playerid,d_daln + 2,2,"Выбор маршрута","1. "cGRAY"Отвозить топливо по бизнесам","Далее","Закрыть");
	        	    }

					togglePlayerControllable(playerid,false);
					SetPVarInt(playerid,"playerFreezingTime",MAX_TIME_UNFREEZE_J);
	            }
				if(IsPlayerInRangeOfPoint(playerid,5.0,1061.2046,-322.2485,73.9851)) 
				{
					if (IsValidDynamic3DTextLabel(V::[v][vTextTrailer]))
				    	DestroyDynamic3DTextLabel(V::[v][vTextTrailer]);
						
				    DestroyVehicle(v);
				    	
				    if(Player[playerid][uDalnSkill] != 150) Player[playerid][uDalnSkill] ++;
        			
        			if(JobValueNow(playerid, 20, 500,Player[playerid][uJob]) != 0) { }
					else
					{
					    D::[playerid][dDalnDuty] = false;
		                if(D::[playerid][dDalnKey] != -1) SetVehicleToRespawn(D::[playerid][dDalnKey]);
						DisablePlayerCheckpoint(playerid);
					}
        			
        			SetPVarInt(playerid,"dettachTrailer",0);
				    PlayerTrailer[playerid] = -1;
				    format(gb_string,sizeof(gb_string),"UPDATE gb_users SET uDalnSkill = '%d' WHERE BINARY uName = '%s'",Player[playerid][uDalnSkill],Player[playerid][uName]);
					mysql_tquery(1, gb_string, "", "");
				}
	        }
	        case 4: {
	            if(IsPlayerInRangeOfPoint(playerid,5.0,-496.0325,-82.4771,61.2981)) {
	                if(S::[0][wsWoodsSklad] == 0) {
						if(V::[v][vWoods] == 0) {
	                		SetPVarInt(playerid,"PlayerDriverCheckpoint",_:SetPlayerCheckpoint(playerid,1061.2046,-322.2485,73.9851,5.0));
							return SendClientMessage(playerid,C_GRAY,""gbInfo"На лесопилке закончилась древесина, верните прицеп обратно.");
						}
						else if(V::[v][vWoods] != 0) {
						    SetPVarInt(playerid,"PlayerDriverCheckpoint",_:SetPlayerCheckpoint(playerid,-18.9291,-273.3552,5.4297,5.0));
							return SendClientMessage(playerid,C_GRAY,""gbInfo"На лесопилке закончилась древесина, отвезите всё что у вас есть на завод мебели.");
						}
					}
					if(V::[v][vWoods] >= MAX_WOODS_IN_VEHICLE) return SendClientMessage(playerid,C_GRAY,""gbError"В прицепе недостаточно места для загрузки урожая.");
					if(S::[0][wsWoodsSklad] <= 0) {
					    SetPVarInt(playerid,"PlayerDriverCheckpoint",_:SetPlayerCheckpoint(playerid,1061.2046,-322.2485,73.9851,5.0));
					    SendClientMessage(playerid,C_GRAY,""gbInfo"На лесопилке больше нет древесины, отвезите прицеп на склад!");
					}
					else if(S::[0][wsWoodsSklad] > 0) {
					    if(S::[0][wsWoodsSklad] < MAX_WOODS_IN_VEHICLE) {
					        V::[v][vWoods] = S::[0][wsWoodsSklad];
					        S::[0][wsWoodsSklad] = 0;
					    }
					    else {
					        V::[v][vWoods] = MAX_WOODS_IN_VEHICLE;
                            S::[0][wsWoodsSklad] -= MAX_WOODS_IN_VEHICLE;
					    }
					}
					format(gb_string,sizeof(gb_string),"Древесина\n{ffffff}%d/%d кг.",V::[v][vWoods],MAX_WOODS_IN_VEHICLE);
					UpdateDynamic3DTextLabelText(V::[v][vTextTrailer],C_BLUE,gb_string);
					format(gb_string,sizeof(gb_string),"Обработанная древесина\n{ffffff}%d кг.",S::[0][wsWoodsSklad]);
		    		UpdateDynamic3DTextLabelText(S::[0][wsWoodsTS][0],C_BLUE,gb_string);
		    		UpdateDynamic3DTextLabelText(S::[0][wsWoodsTS][1],C_BLUE,gb_string);
					togglePlayerControllable(playerid,false);
					SetPVarInt(playerid,"playerFreezingTime",MAX_TIME_UNFREEZE_J);
					SetPVarInt(playerid,"PlayerDriverCheckpoint",_:SetPlayerCheckpoint(playerid,-18.9291,-273.3552,5.4297,5.0));
					SendClientMessage(playerid,C_GRAY,""gbInfo"Вам в прицеп загрузили древесину, отвезите её на завод мебели.");
	            }
	            if(IsPlayerInRangeOfPoint(playerid,5.0,-18.9291,-273.3552,5.4297)) {
	                WoodsZavod += V::[v][vWoods];
	                V::[v][vWoods] = 0;
	                SetPVarInt(playerid,"PlayerDriverCheckpoint",_:SetPlayerCheckpoint(playerid,1061.2046,-322.2485,73.9851,5.0));
	                format(gb_string,sizeof(gb_string),"Древесина\n{ffffff}%d/%d кг.",V::[v][vWoods],MAX_WOODS_IN_VEHICLE);
					UpdateDynamic3DTextLabelText(V::[v][vTextTrailer],C_BLUE,gb_string);
					format(gb_string,sizeof(gb_string),"Завод мебели\n\n{ffffff}Мебель: %d ед.\nДревесины: %d ед.",MebelZavod,WoodsZavod);
					UpdateDynamic3DTextLabelText(InfoFermText[7],C_BLUE,gb_string);
					SendClientMessage(playerid,C_GRAY,""gbInfo"Вы отвезли древесину на завод, верните прицеп обратно.");
					togglePlayerControllable(playerid,false);
					SetPVarInt(playerid,"playerFreezingTime",MAX_TIME_UNFREEZE_J);
	            }
	            if(IsPlayerInRangeOfPoint(playerid,5.0,1061.2046,-322.2485,73.9851)) 
				{
					if(IsValidDynamic3DTextLabel(V::[v][vTextTrailer]))
						DestroyDynamic3DTextLabel(V::[v][vTextTrailer]);
				
	                DestroyVehicle(v);
	             
	                
	                SetPVarInt(playerid,"dettachTrailer",0);
	                PlayerTrailer[playerid] = -1;
	                if(Player[playerid][uDalnSkill] != 150) Player[playerid][uDalnSkill] ++;
	                
	                if(JobValueNow(playerid, 10, 300,Player[playerid][uJob]) != 0) { }
					else
					{
					    D::[playerid][dDalnDuty] = false;
		                if(D::[playerid][dDalnKey] != -1) SetVehicleToRespawn(D::[playerid][dDalnKey]);
						DisablePlayerCheckpoint(playerid);
					}
	                
	                format(gb_string,sizeof(gb_string),"UPDATE gb_users SET uDalnSkill = '%d' WHERE BINARY uName = '%s'",Player[playerid][uDalnSkill],Player[playerid][uName]);
					mysql_tquery(1, gb_string, "", "");
	            }
	        }
	    }
	}
	if(GetPVarInt(playerid,"CheckpointBack")) {
		if(IsPlayerInRangeOfPoint(playerid,5.0,1099.9902,-1242.7791,15.3823)) {
        	DisablePlayerCheckpoint(playerid);
        	new car = GetPlayerVehicleID(playerid);
        	SetVehicleToRespawn(car);
        	SetPVarInt(playerid,"CountBackTaxi",0);
			DeletePVar(playerid,"CheckpointBack");
			D::[playerid][dTaxiDuty] = false;
			SendClientMessage(playerid, -1, ""gbAccess"Ваша зарплата перечислена на чековую книжку, обналичить ее можно в банке");
			showPlayerDialog(playerid,9999,0," ","{ffffff}Ваш рабочий день закончен!\n\n"cGREEN"| Ваша зарплата перечислена на чековую книжку.\n"gbError"Снять деньги с чековой книжки можно в банке","Закрыть","");
		}
	}
	if(GetPVarInt(playerid,"CheckpointBackDaln")) {
		if(IsPlayerInRangeOfPoint(playerid,5.0,2209.2693,-2220.6868,14.1527)) {
        	DisablePlayerCheckpoint(playerid);
        	new car = GetPlayerVehicleID(playerid);
        	SetVehicleToRespawn(car);
        	if(PlayerTrailer[playerid] != -1) {
	        	V::[PlayerTrailer[playerid]][vWoods] = 0;
				V::[PlayerTrailer[playerid]][vMebel] = 0;
				V::[PlayerTrailer[playerid]][vToplivo] = 0;
				
				if (IsValidDynamic3DTextLabel(V::[PlayerTrailer[playerid]][vTextTrailer]))
			    	DestroyDynamic3DTextLabel(V::[PlayerTrailer[playerid]][vTextTrailer]);
				
			    DestroyVehicle(PlayerTrailer[playerid]);
			    
		        PlayerTrailer[playerid] = -1;
		        SetPVarInt(playerid,"dettachTrailer",0);
	        }
        	SetPVarInt(playerid,"CountBackDaln",0);
			DeletePVar(playerid,"CheckpointBackDaln");
		}
	}
	if(GetPVarInt(playerid,"ProductsCheckpoint")) {
		new id = GetPVarInt(playerid,"PlayerSelectedProducts") - 1;
		if(IsPlayerInRangeOfPoint(playerid,5.0,Bizz::[Product::[id][bID]][bEnter][0],Bizz::[Product::[id][bID]][bEnter][1],Bizz::[Product::[id][bID]][bEnter][2]) && (dalncars[0] <= GetPlayerVehicleID(playerid) <= dalncars[1])) {
			if(Product::[id][bCount] <= 0) return SendClientMessage(playerid,C_GRAY,""gbError"Этот заказ уже был выполнен. Для того, чтобы взять другой, используйте - "cBLUE"/job{ffffff}.");
			if(V::[GetPlayerVehicleID(playerid)][vProducts] == 0) {
				if(GetPVarInt(playerid,"PlayerSelectedProducts") != 0) Product::[GetPVarInt(playerid,"PlayerSelectedProducts") - 1][bStatus] = false;
				DeletePVar(playerid,"ProductsCheckpoint");
				return DisablePlayerCheckpoint(playerid);
			}
			new i = Product::[id][bID];

			if(V::[GetPlayerVehicleID(playerid)][vProducts] < Product::[id][bCount]) {
				if(Bizz::[i][bSettings][6] < V::[GetPlayerVehicleID(playerid)][vProducts]) return SendClientMessage(playerid,C_GRAY,""gbError"В данном бизнесе недостаточно денег для оплаты заказа!");
				Bizz::[i][bSettings][3] += V::[GetPlayerVehicleID(playerid)][vProducts];
				Bizz::[i][bSellHour] = 0;
				SetBizzStr(Bizz::[i][bID],"bSellHour",Bizz::[i][bSellHour]);
				Product::[id][bCount] -= V::[GetPlayerVehicleID(playerid)][vProducts];
				if(V::[GetPlayerVehicleID(playerid)][vProducts] >= 450) 
				{
		            if(JobValueNow(playerid, 10, 300, Player[playerid][uJob]) != 0) { }
					else
					{
                        D::[playerid][dJobMarsh] = 0;
						D::[playerid][dDalnDuty] = false;
		    			if(D::[playerid][dDalnKey] != -1) SetVehicleToRespawn(D::[playerid][dDalnKey]);
						MeAction(playerid,"закончил(-а) рабочий день",1);
						DisablePlayerCheckpoint(playerid);
					}
				}
				else SendClientMessage(playerid,C_GRAY,""gbError"У вас с собой слишком мало продуктов для выдачи денег Вам!");
				Bizz::[i][bSettings][6] -= V::[GetPlayerVehicleID(playerid)][vProducts];
                V::[GetPlayerVehicleID(playerid)][vProducts] = 0;
			}
			else if(V::[GetPlayerVehicleID(playerid)][vProducts] >= Product::[id][bCount]) {
				if(Bizz::[i][bSettings][6] < Product::[id][bCount]) return SendClientMessage(playerid,C_GRAY,""gbError"В данном бизнесе недостаточно денег для оплаты заказа!");
				Bizz::[i][bSettings][3] += Product::[id][bCount];
				Bizz::[i][bSellHour] = 0;
				//SetBizzStr(Bizz::[i][bID],"bSellHour",Bizz::[i][bSellHour]);
				SetBizzStr(Bizz::[i][bID],"bSellHour",Bizz::[i][bSellHour]);
				if(V::[GetPlayerVehicleID(playerid)][vProducts] >= 450)
				{
				    if(JobValueNow(playerid, 10, 300, Player[playerid][uJob]) != 0) { }
					else
					{
                        D::[playerid][dJobMarsh] = 0;
						D::[playerid][dDalnDuty] = false;
		    			if(D::[playerid][dDalnKey] != -1) SetVehicleToRespawn(D::[playerid][dDalnKey]);
						MeAction(playerid,"закончил(-а) рабочий день",1);
						DisablePlayerCheckpoint(playerid);
					}
				}
				else SendClientMessage(playerid,C_GRAY,""gbError"У вас с собой слишком мало продуктов для выдачи денег Вам!");
				V::[GetPlayerVehicleID(playerid)][vProducts] -= Product::[id][bCount];
				Bizz::[i][bSettings][6] -= Product::[id][bCount];
				Product::[id][bID] = 0;
		        Product::[id][bCount] = 0;
		        Bizz::[i][bProds] = false;
			}
            Product::[id][pStatus] = false;
            
			SetPVarInt(playerid, "LoadNow", 0);

			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы выполнили заказ на развозку товаров!");

			if(GetPVarInt(playerid,"PlayerSelectedProducts") != 0) Product::[GetPVarInt(playerid,"PlayerSelectedProducts") - 1][bStatus] = false;
			DeletePVar(playerid,"PlayerSelectedProducts");

			if(V::[GetPlayerVehicleID(playerid)][vProducts] != 0) {
				format(gb_string,sizeof(gb_string),"Товары:\n{ffffff}%d/%d ед.",V::[GetPlayerVehicleID(playerid)][vProducts],MAX_PRODUCTS_INCAR);
				UpdateDynamic3DTextLabelText(V::[GetPlayerVehicleID(playerid)][vProductsText],C_BLUE,gb_string);
			}
			else
			{
			    if (IsValidDynamic3DTextLabel(V::[GetPlayerVehicleID(playerid)][vProductsText]))
					DestroyDynamic3DTextLabel(V::[GetPlayerVehicleID(playerid)][vProductsText]);
			}

			format(gb_string,sizeof(gb_string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[i][bSettings][0],Bizz::[i][bSettings][1],Bizz::[i][bSettings][2],
			Bizz::[i][bSettings][3],Bizz::[i][bSettings][4],Bizz::[i][bSettings][5],Bizz::[i][bSettings][6],Bizz::[i][bSettings][7]);
			SetBizzStr(Bizz::[i][bID],"bSettings",gb_string);

			DeletePVar(playerid,"ProductsCheckpoint");
			togglePlayerControllable(playerid,false);
			SetPVarInt(playerid,"playerFreezingTime",MAX_TIME_UNFREEZE_J);

			DisablePlayerCheckpoint(playerid);
			return 1;
		}
	}
	if(GetPVarInt(playerid,"FuelsCheckpoint")) {
		new id = GetPVarInt(playerid,"PlayerSelectedFuels") - 1;
		if(IsPlayerInRangeOfPoint(playerid,10.0,Bizz::[Fuel::[id][bID]][bEnter][0],Bizz::[Fuel::[id][bID]][bEnter][1],Bizz::[Fuel::[id][bID]][bEnter][2]) && PlayerTrailer[playerid] != -1 && (dalncars[0] <= GetPlayerVehicleID(playerid) <= dalncars[1])) {
            if(Fuel::[id][bCount] <= 0) {
                showPlayerDialog(playerid,d_daln + 2,2,"Выбор маршрута","1. "cGRAY"Отвозить топливо по бизнесам","Далее","Закрыть");
				DeletePVar(playerid,"FuelsCheckpoint");
				return SendClientMessage(playerid,C_GRAY,""gbError"Этот заказ уже был выполнен, возьмите другой.");
			}
			if(GetVehicleTrailer(GetPlayerVehicleID(playerid)) != PlayerTrailer[playerid]) {
				if(GetPVarInt(playerid,"PlayerSelectedFuels") != 0) Fuel::[GetPVarInt(playerid,"PlayerSelectedFuels") - 1][bStatus] = false;
				DeletePVar(playerid,"FuelsCheckpoint");
				DisablePlayerCheckpoint(playerid);
				return SendClientMessage(playerid,C_GRAY,""gbError"У вашего тягача должна быть цистерна с топливом!");
			}
			if(V::[PlayerTrailer[playerid]][vToplivo] == 0 && GetVehicleTrailer(GetPlayerVehicleID(playerid)) == PlayerTrailer[playerid]) {
				if(GetPVarInt(playerid,"PlayerSelectedFuels") != 0) Fuel::[GetPVarInt(playerid,"PlayerSelectedFuels") - 1][bStatus] = false;
				SetPVarInt(playerid,"PlayerDriverCheckpoint",_:SetPlayerCheckpoint(playerid,1061.2046,-322.2485,73.9851,5.0));
				DeletePVar(playerid,"FuelsCheckpoint");
				return SendClientMessage(playerid,C_GRAY,""gbInfo"В вашей цистерне закончилось топливо, верните цистерну обратно!");
			}

			new i = Fuel::[id][bID];

			if(V::[PlayerTrailer[playerid]][vToplivo] < Fuel::[id][bCount]) {
				if(Bizz::[i][bSettings][6] < V::[PlayerTrailer[playerid]][vToplivo]) {
					showPlayerDialog(playerid,d_daln + 2,2,"Выбор маршрута","1. "cGRAY"Отвозить топливо по бизнесам","Далее","Закрыть");
					DeletePVar(playerid,"FuelsCheckpoint");
					return SendClientMessage(playerid,C_GRAY,""gbError"В данном бизнесе недостаточно денег для оплаты заказа!");
				}
				Bizz::[i][bSettings][3] += V::[PlayerTrailer[playerid]][vToplivo];
				Bizz::[i][bSellHour] = 0;
				SetBizzStr(Bizz::[i][bID],"bSellHour",Bizz::[i][bSellHour]);
				Fuel::[id][bCount] -= V::[PlayerTrailer[playerid]][vToplivo];
				
				JobValueNow(playerid, 20, 500, Player[playerid][uJob]);
				//GiveJobMoney(playerid,Player[playerid][uJob],V::[PlayerTrailer[playerid]][vToplivo]);
				Bizz::[i][bSettings][6] -= V::[PlayerTrailer[playerid]][vToplivo];
				V::[PlayerTrailer[playerid]][vToplivo] = 0;
			}
			else if(V::[PlayerTrailer[playerid]][vToplivo] >= Fuel::[id][bCount]) {
				if(Bizz::[i][bSettings][6] < Product::[id][bCount]) {
					showPlayerDialog(playerid,d_daln + 2,2,"Выбор маршрута","1. "cGRAY"Отвозить топливо по бизнесам","Далее","Закрыть");
					DeletePVar(playerid,"FuelsCheckpoint");
					return SendClientMessage(playerid,C_GRAY,""gbError"В данном бизнесе недостаточно денег для оплаты заказа!");
				}
				Bizz::[i][bSettings][3] += Fuel::[id][bCount];
				Bizz::[i][bSellHour] = 0;
				SetBizzStr(Bizz::[i][bID],"bSellHour",Bizz::[i][bSellHour]);
                JobValueNow(playerid, 20, 500, Player[playerid][uJob]);
				//GiveJobMoney(playerid,Player[playerid][uJob],Fuel::[id][bCount]);
				V::[PlayerTrailer[playerid]][vToplivo] -= Fuel::[id][bCount];
				Bizz::[i][bSettings][6] -= Fuel::[id][bCount];
				Fuel::[id][bID] = 0;
		        Fuel::[id][bCount] = 0;
			}

			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы выполнили заказ на развозку топлива!");
			if(GetPVarInt(playerid,"PlayerSelectedFuels") != 0) Fuel::[GetPVarInt(playerid,"PlayerSelectedFuels") - 1][bStatus] = false;
			DeletePVar(playerid,"PlayerSelectedFuels");

			format(gb_string,sizeof(gb_string),"Топливо\n{ffffff}%d/%d л.",V::[PlayerTrailer[playerid]][vToplivo],MAX_FUEL_IN_VEHICLE);
			UpdateDynamic3DTextLabelText(V::[PlayerTrailer[playerid]][vTextTrailer],C_BLUE,gb_string);

			format(gb_string,sizeof(gb_string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[i][bSettings][0],Bizz::[i][bSettings][1],Bizz::[i][bSettings][2],
			Bizz::[i][bSettings][3],Bizz::[i][bSettings][4],Bizz::[i][bSettings][5],Bizz::[i][bSettings][6],Bizz::[i][bSettings][7]);
			SetBizzStr(Bizz::[i][bID],"bSettings",gb_string);

			DisablePlayerCheckpoint(playerid);

			togglePlayerControllable(playerid,false);
			SetPVarInt(playerid,"playerFreezingTime",MAX_TIME_UNFREEZE_J);

			if(V::[PlayerTrailer[playerid]][vToplivo] == 0) {
				SetPVarInt(playerid,"PlayerDriverCheckpoint",_:SetPlayerCheckpoint(playerid,1061.2046,-322.2485,73.9851,5.0));
				SendClientMessage(playerid,C_GRAY,""gbInfo"В вашей цистерне закончилось топливо, верните цистерну обратно!");
				DeletePVar(playerid,"FuelsCheckpoint");
			}
			else {
				DeletePVar(playerid,"FuelsCheckpoint");
				showPlayerDialog(playerid,d_daln + 2,2,"Выбор маршрута","1. "cGRAY"Отвозить топливо по бизнесам","Далее","Закрыть");
			}
		}
	}
	return 1;
}

public OnDynamicObjectMoved(objectid)
{
	new string[128];
    if(GetGVarType("WoodConv2",objectid) == GLOBAL_VARTYPE_INT) {
    	DeleteGVar("WoodConv2",objectid);
    	DestroyDynamicObject(objectid);
    	S::[0][wsWoods] += 25;
    	format(string,sizeof(string),"Древесина\n{ffffff}%d кг.",S::[0][wsWoods]);
    	UpdateDynamic3DTextLabelText(S::[0][wsWoodsT],C_BLUE,string);
	}
	if(GetGVarType("WoodStanok2",objectid) == GLOBAL_VARTYPE_INT) {
	    DeleteGVar("WoodStanok2",objectid);
	    DestroyDynamicObject(objectid);
	}
	if(GetGVarType("WoodStanok3",objectid) == GLOBAL_VARTYPE_INT) {
	    DeleteGVar("WoodStanok3",objectid);
	    DestroyDynamicObject(objectid);
	}
	if(GetGVarType("WoodGoSklad",objectid) == GLOBAL_VARTYPE_INT) {
	    DeleteGVar("WoodGoSklad",objectid);
	    DestroyDynamicObject(objectid);
	    S::[0][wsWoodsSklad] += 10;
	    format(string,sizeof(string),"Обработанная древесина\n{ffffff}%d кг.",S::[0][wsWoodsSklad]);
	    UpdateDynamic3DTextLabelText(S::[0][wsWoodsTS][0],C_BLUE,string);
	    UpdateDynamic3DTextLabelText(S::[0][wsWoodsTS][1],C_BLUE,string);
	}
	if(GetGVarType("WoodGoSklad2",objectid) == GLOBAL_VARTYPE_INT) {
	    DeleteGVar("WoodGoSklad2",objectid);
	    DestroyDynamicObject(objectid);
	}
	if(GetGVarType("WoodConv",objectid) == GLOBAL_VARTYPE_INT) {
    	DeleteGVar("WoodConv",objectid);
    	DestroyDynamicObject(objectid);
    	new obj = CreateDynamicObject(1463,-456.91119, -94.95390, 774.12469,0.00000, 0.00000, 0.00000);
	    SetGVarInt("WoodConv2",1,obj);
	    MoveDynamicObject(obj,-464.57120, -94.95390, 774.12469,1,0.00000, 0.00000, 0.00000);
    }
	if(GetGVarType("WoodStanok",objectid) == GLOBAL_VARTYPE_INT) {
	    DeleteGVar("WoodStanok",objectid);
	    DestroyDynamicObject(objectid);
	    
	    new obj = CreateDynamicObject(2468,-468.29230, -86.36710, 773.94043,0.00,0.00,90.00);
	    new obj2 = CreateDynamicObject(2468, -468.35901, -86.75980, 773.94043,0.00,0.00,-90.00);
	    MoveDynamicObject(obj,-468.29230, -90.60710, 773.94043,1,0.00,0.00,90.00);
	    MoveDynamicObject(obj2,-468.35898, -90.97980, 773.94043,1,0.00,0.00,-90.00);
	    
	    SetGVarInt("WoodStanok2",1,obj);
	    SetGVarInt("WoodStanok3",1,obj2);
	}
	return 1;
}

public OnPlayerEnterRaceCheckpoint(playerid) 
{
	return 1;
}

public OnVehicleSpawn(vehicleid) 
{
    if( vehiclecallsign[vehicleid] == 1 )
	{
  		if( IsValidDynamic3DTextLabel( vehicle3Dtext[vehicleid] ) )
	    {
			DestroyDynamic3DTextLabel( vehicle3Dtext[vehicleid] );
			vehicle3Dtext[vehicleid] = Text3D: INVALID_3DTEXT_ID;
		   	vehiclecallsign[vehicleid] = 0;
		}
	}
	if(V::[vehicleid][vRentCar][0] == 1 && D::[V::[vehicleid][vRentCar][1]][dRentVehicleID] == vehicleid)
	{
		V::[vehicleid][vRentCar][0] = 0;
		D::[V::[vehicleid][vRentCar][1]][dRentVehicleID] = -1;
		D::[V::[vehicleid][vRentCar][1]][dRentVehicleTime] = 0;
		V::[vehicleid][vRentCar][1] = 0;
		V::[vehicleid][vHealth] = 1000.0;
		V::[vehicleid][vFuel] = MaxVehicleFuel[GetVehicleModel(vehicleid) - 400];
	}
    for(new i; i != 18; i ++) V::[vehicleid][vInvSlot][i] = 0,V::[vehicleid][vInvSlotKol][i] = 0;
    V::[vehicleid][vHealth] = 1000.0;
	V::[vehicleid][vWoods] = 0;
	V::[vehicleid][vMebel] = 0;
	V::[vehicleid][vToplivo] = 0;
	GetVehicleParamsEx(vehicleid,eng,light,other1,other2,other3,other4,other5);
	if(vehicleid >= ataxils[0] && vehicleid <= ataxils[1]) {
		SetPVarInt(V::[vehicleid][vTaxiDriver],"CountBackTaxi",0);
		DeletePVar(V::[vehicleid][vTaxiDriver],"CheckpointBack");
		SendClientMessage(V::[vehicleid][vTaxiDriver], -1, ""gbAccess"Ваша зарплата перечислена на чековую книжку, обналичить ее можно в банке");
		showPlayerDialog(V::[vehicleid][vTaxiDriver],9999,0," ","{ffffff}Ваш рабочий день закончен!\n\n"cGREEN"| Ваша зарплата перечислена на чековую книжку.\n"gbError"Снять деньги с чековой книжки можно в банке","Закрыть","");
		D::[V::[vehicleid][vTaxiDriver]][dTaxiKey] = -1;
    	D::[V::[vehicleid][vTaxiDriver]][dTaxiDuty] = false;
    	GiveTaxiMoney(V::[vehicleid][vTaxiDriver]);
		V::[vehicleid][vTaxiDriver] = -1;
		if(V::[vehicleid][vTaxiText] != -1) {
        	DestroyDynamicObject(V::[vehicleid][vTaxiText]);
        	V::[vehicleid][vTaxiText] = -1;
		}
		V::[vehicleid][vFuel] = MaxVehicleFuel[GetVehicleModel(vehicleid) - 400];
		SetVehicleParamsEx(vehicleid,false,0,other1,1,other3,other4,other5);
	}
	if(vehicleid >= buscars[0] && vehicleid <= buscars[1]) {
	    SendClientMessage(V::[vehicleid][vBusDriver], -1, ""gbAccess"Ваша зарплата перечислена на чековую книжку, обналичить ее можно в банке");
		showPlayerDialog(V::[vehicleid][vBusDriver],9999,0," ","{ffffff}Ваш рабочий день закончен!\n\n"cGREEN"| Ваша зарплата перечислена на чековую книжку.\n"gbError"Снять деньги с чековой книжки можно в банке","Закрыть","");
		D::[V::[vehicleid][vBusDriver]][dBusKey] = -1;
    	D::[V::[vehicleid][vBusDriver]][dBusDuty] = false;
    	SetPVarInt(V::[vehicleid][vBusDriver],"CountBackToBus",0);
    	SetPVarInt(V::[vehicleid][vBusDriver],"BusToGo",-1);
    	V::[vehicleid][vBusDriver] = -1;
    	SetVehicleParamsEx(vehicleid,false,0,other1,1,other3,other4,other5);
    	V::[vehicleid][vFuel] = MaxVehicleFuel[GetVehicleModel(vehicleid) - 400];
		if(V::[vehicleid][vBusText]) 
		{
			if (IsValidDynamic3DTextLabel(V::[vehicleid][vBusText]))
			{
				DestroyDynamic3DTextLabel(V::[vehicleid][vBusText]);
				V::[vehicleid][vBusText] = Text3D: INVALID_3DTEXT_ID;
			}
		}
	}
	if(vehicleid >= dalncars[0] && vehicleid <= dalncars[1]) {
    	SetPVarInt(V::[vehicleid][vDalnDriver],"CountBackDaln",0);
    	if(PlayerTrailer[V::[vehicleid][vDalnDriver]] != -1) {
    		V::[PlayerTrailer[V::[vehicleid][vDalnDriver]]][vWoods] = 0;
			V::[PlayerTrailer[V::[vehicleid][vDalnDriver]]][vMebel] = 0;
			V::[PlayerTrailer[V::[vehicleid][vDalnDriver]]][vToplivo] = 0;
			
			if (IsValidDynamic3DTextLabel(V::[PlayerTrailer[V::[vehicleid][vDalnDriver]]][vTextTrailer]))
			{
				DestroyDynamic3DTextLabel(V::[PlayerTrailer[V::[vehicleid][vDalnDriver]]][vTextTrailer]);
				V::[PlayerTrailer[V::[vehicleid][vDalnDriver]]][vTextTrailer] = Text3D: INVALID_3DTEXT_ID;
			}
			
    		DestroyVehicle(PlayerTrailer[V::[vehicleid][vDalnDriver]]);
    		
    		PlayerTrailer[V::[vehicleid][vDalnDriver]] = -1;
			DisablePlayerCheckpoint(V::[vehicleid][vDalnDriver]);
			SetPVarInt(V::[vehicleid][vDalnDriver],"dettachTrailer",0);
		}
		if(V::[vehicleid][vProducts] != 0) {
		    V::[vehicleid][vProducts] = 0;
		    Product::[V::[vehicleid][vProductsID]][pStatus] = false;
		    V::[vehicleid][vProductsID] = 0;
		    if (IsValidDynamic3DTextLabel(V::[vehicleid][vProductsText]))
			{
		    	DestroyDynamic3DTextLabel(V::[vehicleid][vProductsText]);
				V::[vehicleid][vProductsText] = Text3D: INVALID_3DTEXT_ID;
			}
		}
		DeletePVar(V::[vehicleid][vDalnDriver],"CheckpointBackDaln");
		SendClientMessage(V::[vehicleid][vDalnDriver], -1, ""gbAccess"Ваша зарплата перечислена на чековую книжку, обналичить ее можно в банке");
		showPlayerDialog(V::[vehicleid][vDalnDriver],9999,0," ","{ffffff}Ваш рабочий день закончен!\n\n"cGREEN"| Ваша зарплата перечислена на чековую книжку.\n"gbError"Снять деньги с чековой книжки можно в банке","Закрыть","");
		D::[V::[vehicleid][vDalnDriver]][dDalnKey] = -1;
    	D::[V::[vehicleid][vDalnDriver]][dDalnDuty] = false;
    	for(new s;s<10;s++)
		{
			if(gTruckLoadTurn[0][s] == V::[vehicleid][vDalnDriver]) gTruckLoadTurn[0][s] = INVALID_PLAYER_ID;
		}

    	V::[vehicleid][vDalnDriver] = -1;
    	V::[vehicleid][vFuel] = MaxVehicleFuel[GetVehicleModel(vehicleid) - 400];
    	SetVehicleParamsEx(vehicleid, false, 0, other1,1,other3,other4,other5);
    	SetVehicleVirtualWorld(vehicleid, 0);

	}
	if(vehicleid >= sheriffandpolice[0] && vehicleid <= sheriffandpolice[1]) {
	    V::[vehicleid][vHealth] = 1000.0;
		V::[vehicleid][vFuel] = MaxVehicleFuel[GetVehicleModel(vehicleid) - 400];
	}
	if(vehicleid >= lspdcars[0] && vehicleid <= lspdcars[1]) {
		V::[vehicleid][vHealth] = 1000.0;
		V::[vehicleid][vFuel] = MaxVehicleFuel[GetVehicleModel(vehicleid) - 400];
		if( vehicle_spawn[ vehicleid ][ vs_int ] ) {
			LinkVehicleToInterior( vehicleid, vehicle_spawn[ vehicleid ][ vs_int ] ),
			SetVehicleVirtualWorld( vehicleid, vehicle_spawn[ vehicleid ][ vs_world ] );
		}
		switch(GetVehicleModel(vehicleid)) {
			case 528:
			{
				V::[vehicleid][vInvSlot][0] = 433,V::[vehicleid][vInvSlot][1] = 433,V::[vehicleid][vInvSlot][2] = 434,V::[vehicleid][vInvSlot][3] = 434,V::[vehicleid][vInvSlot][4] = 431,V::[vehicleid][vInvSlot][5] = 431;
				V::[vehicleid][vInvSlotKol][0] = 1,V::[vehicleid][vInvSlotKol][1] = 1,V::[vehicleid][vInvSlotKol][2] = 2,V::[vehicleid][vInvSlotKol][3] = 2,V::[vehicleid][vInvSlotKol][4] = 100,V::[vehicleid][vInvSlotKol][5] = 100;
			}
			case 601:
			{
				V::[vehicleid][vInvSlot][0] = 433,V::[vehicleid][vInvSlot][1] = 433,V::[vehicleid][vInvSlot][2] = 433,V::[vehicleid][vInvSlot][3] = 433,V::[vehicleid][vInvSlot][4] = 434,V::[vehicleid][vInvSlot][5] = 434,V::[vehicleid][vInvSlot][6] = 434,
				V::[vehicleid][vInvSlot][7] = 434,V::[vehicleid][vInvSlot][8] = 439,V::[vehicleid][vInvSlot][9] = 440;
				V::[vehicleid][vInvSlotKol][0] = 1,V::[vehicleid][vInvSlotKol][1] = 1,V::[vehicleid][vInvSlotKol][2] = 1,V::[vehicleid][vInvSlotKol][3] = 1,V::[vehicleid][vInvSlotKol][4] = 2,V::[vehicleid][vInvSlotKol][5] = 2,V::[vehicleid][vInvSlotKol][6] = 2,
				V::[vehicleid][vInvSlotKol][7] = 2,V::[vehicleid][vInvSlotKol][8] = 1,V::[vehicleid][vInvSlotKol][9] = 1;
			}
			case 427:
			{
				V::[vehicleid][vInvSlot][0] = 433,V::[vehicleid][vInvSlot][1] = 433,V::[vehicleid][vInvSlot][2] = 433,V::[vehicleid][vInvSlot][3] = 433,V::[vehicleid][vInvSlot][4] = 431,V::[vehicleid][vInvSlot][5] = 431,V::[vehicleid][vInvSlot][6] = 431,V::[vehicleid][vInvSlot][7] = 431,
				V::[vehicleid][vInvSlot][8] = 434,V::[vehicleid][vInvSlot][9] = 434,V::[vehicleid][vInvSlot][10] = 434,V::[vehicleid][vInvSlot][11] = 434,V::[vehicleid][vInvSlot][12] = 439,V::[vehicleid][vInvSlot][13] = 440,V::[vehicleid][vInvSlot][14] = 437;
				V::[vehicleid][vInvSlotKol][0] = 1,V::[vehicleid][vInvSlotKol][1] = 1,V::[vehicleid][vInvSlotKol][2] = 1,V::[vehicleid][vInvSlotKol][3] = 1,V::[vehicleid][vInvSlotKol][4] = 100,V::[vehicleid][vInvSlotKol][5] = 100,V::[vehicleid][vInvSlotKol][6] = 100,V::[vehicleid][vInvSlotKol][7] = 100,
				V::[vehicleid][vInvSlotKol][8] = 2,V::[vehicleid][vInvSlotKol][9] = 2,V::[vehicleid][vInvSlotKol][10] = 2,V::[vehicleid][vInvSlotKol][11] = 2,V::[vehicleid][vInvSlotKol][12] = 1,V::[vehicleid][vInvSlotKol][13] = 1,V::[vehicleid][vInvSlotKol][14] = 1;
			}
			case 490:
			{
			    V::[vehicleid][vInvSlot][0] = 437,V::[vehicleid][vInvSlot][1] = 435,V::[vehicleid][vInvSlot][2] = 434,V::[vehicleid][vInvSlot][3] = 434,V::[vehicleid][vInvSlot][4] = 431,V::[vehicleid][vInvSlot][5] = 431;
			    V::[vehicleid][vInvSlotKol][0] = 1,V::[vehicleid][vInvSlotKol][1] = 1,V::[vehicleid][vInvSlotKol][2] = 2,V::[vehicleid][vInvSlotKol][3] = 2,V::[vehicleid][vInvSlotKol][4] = 100,V::[vehicleid][vInvSlotKol][5] = 100;
			}
			default:
			{
				V::[vehicleid][vInvSlot][0] = 433,V::[vehicleid][vInvSlot][1] = 433,V::[vehicleid][vInvSlot][2] = 434,V::[vehicleid][vInvSlot][3] = 435,V::[vehicleid][vInvSlot][4] = 436,V::[vehicleid][vInvSlot][5] = 437;
				V::[vehicleid][vInvSlotKol][0] = 1,V::[vehicleid][vInvSlotKol][1] = 1,V::[vehicleid][vInvSlotKol][2] = 1,V::[vehicleid][vInvSlotKol][3] = 1,V::[vehicleid][vInvSlotKol][4] = 1,V::[vehicleid][vInvSlotKol][5] = 1;
			}
		}
	}
	if(vehicleid >= fd_cars[0] && vehicleid <= fd_cars[1])
	{
	    V::[vehicleid][vHealth] = 1000.0;
		V::[vehicleid][vFuel] = MaxVehicleFuel[GetVehicleModel(vehicleid) - 400];
		new i = vehicleid;
		switch(GetVehicleModel(i))
		{
		    case 579:
		    {
		        V::[i][vInvSlot][0] = 340,V::[i][vInvSlot][1] = 340,V::[i][vInvSlot][2] = 457,
				V::[i][vInvSlot][3] = 435,V::[i][vInvSlot][4] = 438,V::[i][vInvSlot][5] = 439,
		  		V::[i][vInvSlot][6] = 440, V::[i][vInvSlot][7] = 441, V::[i][vInvSlot][8] = 442;

		  		V::[i][vInvSlotKol][0] = 4000,V::[i][vInvSlotKol][1] = 4000,V::[i][vInvSlotKol][2] = 1,
				V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 1,V::[i][vInvSlotKol][5] = 1,
		  		V::[i][vInvSlotKol][6] = 1, V::[i][vInvSlotKol][7] = 1, V::[i][vInvSlotKol][8] = 1;
		    }
			case 490:
			{
			    V::[i][vInvSlot][0] = 340,V::[i][vInvSlot][1] = 340,V::[i][vInvSlot][2] = 440,
				V::[i][vInvSlot][3] = 457,V::[i][vInvSlot][4] = 457,V::[i][vInvSlot][5] = 457,
		  		V::[i][vInvSlot][6] = 435, V::[i][vInvSlot][7] = 435, V::[i][vInvSlot][8] = 435;

		  		V::[i][vInvSlotKol][0] = 3000,V::[i][vInvSlotKol][1] = 1,V::[i][vInvSlotKol][2] = 1,
				V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 1,V::[i][vInvSlotKol][5] = 1,
		  		V::[i][vInvSlotKol][6] = 1, V::[i][vInvSlotKol][7] = 1, V::[i][vInvSlotKol][8] = 1;
			}

			case 426:
			{
			    V::[i][vInvSlot][0] = 340,V::[i][vInvSlot][1] = 457,V::[i][vInvSlot][2] = 435,
				V::[i][vInvSlot][3] = 438,V::[i][vInvSlot][4] = 439,V::[i][vInvSlot][5] = 440,
		  		V::[i][vInvSlot][6] = 441, V::[i][vInvSlot][7] = 442, V::[i][vInvSlot][8] = 439;

		  		V::[i][vInvSlotKol][0] = 4000,V::[i][vInvSlotKol][1] = 1,V::[i][vInvSlotKol][2] = 1,
				V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 1,V::[i][vInvSlotKol][5] = 1,
		  		V::[i][vInvSlotKol][6] = 1, V::[i][vInvSlotKol][7] = 1, V::[i][vInvSlotKol][8] = 1;
			}
			case 428:
			{
			    V::[i][vInvSlot][0] = 340,V::[i][vInvSlot][1] = 457,V::[i][vInvSlot][2] = 435,
				V::[i][vInvSlot][3] = 438,V::[i][vInvSlot][4] = 438,V::[i][vInvSlot][5] = 439,
		  		V::[i][vInvSlot][6] = 439, V::[i][vInvSlot][7] = 440, V::[i][vInvSlot][8] = 440;

		  		V::[i][vInvSlotKol][0] = 4000,V::[i][vInvSlotKol][1] = 1,V::[i][vInvSlotKol][2] = 1,
				V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 1,V::[i][vInvSlotKol][5] = 1,
		  		V::[i][vInvSlotKol][6] = 1, V::[i][vInvSlotKol][7] = 1, V::[i][vInvSlotKol][8] = 1;
			}

			case 495:
			{
			    V::[i][vInvSlot][0] = 340,V::[i][vInvSlot][1] = 340,V::[i][vInvSlot][2] = 457,
				V::[i][vInvSlot][3] = 435,V::[i][vInvSlot][4] = 438,V::[i][vInvSlot][5] = 439,
		  		V::[i][vInvSlot][6] = 440, V::[i][vInvSlot][7] = 440, V::[i][vInvSlot][8] = 442;

		  		V::[i][vInvSlotKol][0] = 4000,V::[i][vInvSlotKol][1] = 4000,V::[i][vInvSlotKol][2] = 1,
				V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 1,V::[i][vInvSlotKol][5] = 1,
		  		V::[i][vInvSlotKol][6] = 1, V::[i][vInvSlotKol][7] = 1, V::[i][vInvSlotKol][8] = 1;
			}
			case 573:
			{
			    V::[i][vInvSlot][0] = 340,V::[i][vInvSlot][1] = 340,V::[i][vInvSlot][2] = 457,
				V::[i][vInvSlot][3] = 435,V::[i][vInvSlot][4] = 438,V::[i][vInvSlot][5] = 439,
		  		V::[i][vInvSlot][6] = 440, V::[i][vInvSlot][7] = 441, V::[i][vInvSlot][8] = 442;

		  		V::[i][vInvSlotKol][0] = 4000,V::[i][vInvSlotKol][1] = 4000,V::[i][vInvSlotKol][2] = 1,
				V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 1,V::[i][vInvSlotKol][5] = 1,
		  		V::[i][vInvSlotKol][6] = 1, V::[i][vInvSlotKol][7] = 1, V::[i][vInvSlotKol][8] = 1;
			}
			case 544:
			{
			    V::[i][vInvSlot][0] = 340,V::[i][vInvSlot][1] = 340,V::[i][vInvSlot][2] = 440,
				V::[i][vInvSlot][3] = 457,V::[i][vInvSlot][4] = 457,V::[i][vInvSlot][5] = 457,
		  		V::[i][vInvSlot][6] = 435, V::[i][vInvSlot][7] = 435, V::[i][vInvSlot][8] = 435;

		  		V::[i][vInvSlotKol][0] = 4000,V::[i][vInvSlotKol][1] = 4000,V::[i][vInvSlotKol][2] = 1,
				V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 1,V::[i][vInvSlotKol][5] = 1,
		  		V::[i][vInvSlotKol][6] = 1, V::[i][vInvSlotKol][7] = 1, V::[i][vInvSlotKol][8] = 1;
			}
			case 416:
			{
				V::[i][vInvSlot][0] = 451,V::[i][vInvSlot][1] = 451,V::[i][vInvSlot][2] = 451,
				V::[i][vInvSlot][3] = 435,V::[i][vInvSlot][4] = 435,V::[i][vInvSlot][5] = 435,
				V::[i][vInvSlot][6] = 450,V::[i][vInvSlot][7] = 442;

				V::[i][vInvSlotKol][0] = 1,V::[i][vInvSlotKol][1] = 1,V::[i][vInvSlotKol][2] = 1,
				V::[i][vInvSlotKol][3] = 1,V::[i][vInvSlotKol][4] = 1,V::[i][vInvSlotKol][5] = 1,
				V::[i][vInvSlotKol][6] = 1,V::[i][vInvSlotKol][7] = 1;
			}
		}
	}
	if(vehicleid >= sherifcar[0] && vehicleid <= sherifcar[1] || vehicleid >= sasd_car[0] && vehicleid <= sasd_car[1]) {
		V::[vehicleid][vHealth] = 1000.0;
		V::[vehicleid][vFuel] = MaxVehicleFuel[GetVehicleModel(vehicleid) - 400];
		switch(GetVehicleModel(vehicleid)) {
			case 599: {
				V::[vehicleid][vInvSlot][0] = 439,V::[vehicleid][vInvSlot][1] = 441,V::[vehicleid][vInvSlot][2] = 434,V::[vehicleid][vInvSlot][3] = 435,V::[vehicleid][vInvSlot][4] = 436,V::[vehicleid][vInvSlot][5] = 437;
				V::[vehicleid][vInvSlotKol][0] = 1,V::[vehicleid][vInvSlotKol][1] = 1,V::[vehicleid][vInvSlotKol][2] = 1,V::[vehicleid][vInvSlotKol][3] = 1,V::[vehicleid][vInvSlotKol][4] = 1,V::[vehicleid][vInvSlotKol][5] = 1;
			}
			default: {
				V::[vehicleid][vInvSlot][0] = 433,V::[vehicleid][vInvSlot][1] = 433,V::[vehicleid][vInvSlot][2] = 434,V::[vehicleid][vInvSlot][3] = 435,V::[vehicleid][vInvSlot][4] = 436,V::[vehicleid][vInvSlot][5] = 437;
				V::[vehicleid][vInvSlotKol][0] = 1,V::[vehicleid][vInvSlotKol][1] = 1,V::[vehicleid][vInvSlotKol][2] = 1,V::[vehicleid][vInvSlotKol][3] = 1,V::[vehicleid][vInvSlotKol][4] = 1,V::[vehicleid][vInvSlotKol][5] = 1;
			}
		}
	}
	if(vehicleid >= medicalcar[0] && vehicleid <= medicalcar[1])
	{
		V::[vehicleid][vHealth] = 1000.0;
		V::[vehicleid][vFuel] = MaxVehicleFuel[GetVehicleModel(vehicleid) - 400];
		switch(GetVehicleModel(vehicleid))
		{
			case 416, 426, 482:
			{
				V::[vehicleid][vInvSlot][0] = 451,V::[vehicleid][vInvSlot][1] = 451,V::[vehicleid][vInvSlot][2] = 451,
				V::[vehicleid][vInvSlot][3] = 435,V::[vehicleid][vInvSlot][4] = 435,V::[vehicleid][vInvSlot][5] = 435,
				V::[vehicleid][vInvSlot][6] = 450,V::[vehicleid][vInvSlot][7] = 442;

				V::[vehicleid][vInvSlotKol][0] = 1,V::[vehicleid][vInvSlotKol][1] = 1,V::[vehicleid][vInvSlotKol][2] = 1,
				V::[vehicleid][vInvSlotKol][3] = 1,V::[vehicleid][vInvSlotKol][4] = 1,V::[vehicleid][vInvSlotKol][5] = 1,
				V::[vehicleid][vInvSlotKol][6] = 1,V::[vehicleid][vInvSlotKol][7] = 1;
			}
		}
	}
	
	if(vehicleid >= smicars[0] && vehicleid <= smicars[1]) {
		V::[vehicleid][vHealth] = 1000.0;
		V::[vehicleid][vFuel] = MaxVehicleFuel[GetVehicleModel(vehicleid) - 400];
		switch(GetVehicleModel(vehicleid)) {
			case 551: {
				V::[vehicleid][vInvSlot][0] = 341,V::[vehicleid][vInvSlot][1] = 341,V::[vehicleid][vInvSlot][2] = 341,V::[vehicleid][vInvSlot][3] = 341,V::[vehicleid][vInvSlot][4] = 434,V::[vehicleid][vInvSlot][5] = 435,V::[vehicleid][vInvSlot][6] = 437;
				V::[vehicleid][vInvSlotKol][0] = 100,V::[vehicleid][vInvSlotKol][1] = 100,V::[vehicleid][vInvSlotKol][2] = 100,V::[vehicleid][vInvSlotKol][3] = 100,V::[vehicleid][vInvSlotKol][4] = 2,V::[vehicleid][vInvSlotKol][5] = 1,V::[vehicleid][vInvSlotKol][6] = 1;
			}
			case 582: {
				V::[vehicleid][vInvSlot][0] = 341,V::[vehicleid][vInvSlot][1] = 341,V::[vehicleid][vInvSlot][2] = 434,V::[vehicleid][vInvSlot][3] = 435,V::[vehicleid][vInvSlot][4] = 437;
				V::[vehicleid][vInvSlotKol][0] = 100,V::[vehicleid][vInvSlotKol][1] = 100,V::[vehicleid][vInvSlotKol][2] = 2,V::[vehicleid][vInvSlotKol][3] = 1,V::[vehicleid][vInvSlotKol][4] = 1;
			}
		}
	}
	if(vehicleid >= meria[0] && vehicleid <= meria[1]) {
	    V::[vehicleid][vHealth] = 1000.0;
		V::[vehicleid][vFuel] = MaxVehicleFuel[GetVehicleModel(vehicleid) - 400];
	}
	if(vehicleid >= comm[0] && vehicleid <= comm[1])
	{
	    V::[vehicleid][vHealth] = 1000.0;
		V::[vehicleid][vFuel] = MaxVehicleFuel[GetVehicleModel(vehicleid) - 400];
	}
	SetVehicleParamsEx(vehicleid,eng,0,other1,other2,other3,other4,other5);

	return 1;
}

public OnPlayerDisconnect(playerid,reason)
{
    if( IsPlayerNPC( playerid ) ) 
		return 1;
		
    if( !GetPVarInt( playerid,"uLogin" ) ) 
		return 1;
	
    for(new i = 0; i < 17; i++)
	{
		PlayerTextDrawDestroy(playerid, AloginTextDraw[playerid][i]);
	}
	
    new Float:p[3];
	if(D::[playerid][dRentVehicleID]) SetVehicleToRespawn(D::[playerid][dRentVehicleID]), D::[playerid][dRentVehicleID] = -1;
	if( getData( playerid, "gym_id" ) ) {
	    GymData[ getData( playerid, "gym_id" ) - 1 ][gymStatus] = INVALID_PLAYER_ID;
	    delData( playerid, "gym_id" );
	}
	    
	if(GetPVarInt(playerid,"PutBoombox") >= 1) {
	  	foreach(new j: Player)
	  	{
	 		if(!GetPVarInt(j, "uLogin")) continue;
			if(IsPlayerInDynamicArea(j, GetPVarInt(playerid, "BBArea"))) StopAudioStreamForPlayer(j);
		}
		SetPVarInt(playerid, "PutBoombox", 0);
		DeletePVar(playerid, "BBArea");
		DeletePVar(playerid, "BBX"); DeletePVar(playerid, "BBY"); DeletePVar(playerid, "BBZ");
		DeletePVar(playerid, "BBStation");
		DeletePVar(playerid, "PutBoombox");
		DestroyDynamicObject(_objectInfo[GetPVarInt(playerid,"PutBoomboxID") - 1][objObject]);
	   	GivePlayerItem(playerid, _objectInfo[GetPVarInt(playerid,"PutBoomboxID") - 1][objDrop][0], _objectInfo[GetPVarInt(playerid,"PutBoomboxID") - 1][objDrop][1]);
	   	
	   	if (IsValidDynamic3DTextLabel(_objectInfo[GetPVarInt(playerid,"PutBoomboxID") - 1][objText]))
		{
	   		DestroyDynamic3DTextLabel(_objectInfo[GetPVarInt(playerid,"PutBoomboxID") - 1][objText]);
			_objectInfo[GetPVarInt(playerid,"PutBoomboxID") - 1][objText] = Text3D: INVALID_3DTEXT_ID;
		}
		
	   	DeletePVar(playerid, "PutBoomboxID");
		BoxUse[GetPVarInt(playerid,"PutBoomboxID")] = 0;
	}
    for(new i = 0; i < 20; i ++)
	{
	   	if(CallInfoList[i][cPlayerID] != playerid) continue;
 		CallInfoList[i][cPlayerID] = -1;
   		CallInfoList[i][cStatus] = false;
	  	break;
	}
	if(GetPVarInt(playerid, "ObjectFireStatus") >= 1)
	{
	    DestroyDynamicObject(GetPVarInt(playerid, "ObjectFireOne"));
	    DestroyDynamicObject(GetPVarInt(playerid, "ObjectFireTwo"));
	    DeletePVar(playerid, "ObjectFireOne");
	    DeletePVar(playerid, "ObjectFireTwo");
	    DeletePVar(playerid, "ObjectFireStatus");

	    DeletePVar(playerid, "ObjectFireX");
	    DeletePVar(playerid, "ObjectFireY");
	    DeletePVar(playerid, "ObjectFireZ");
	}
   
    HidePlayerProgressBar(playerid, universalbar[playerid]);
    DestroyPlayerProgressBar(playerid, universalbar[playerid]);
	if( Player[playerid][uSuspect] != 0 && GetPVarInt(playerid,"playerCuffed") != 0 || GetPVarInt(playerid,"follow") != INVALID_PLAYER_ID) {
        Player[playerid][uJail] = 2;
        Player[playerid][uJailTime] = Player[playerid][uSuspect] * 600;
        Player[playerid][uSuspect] = 0;
	}
    if(D::[playerid][dTaxiKey] != -1 && V::[D::[playerid][dTaxiKey]][vTaxiDriver] == playerid) {
        if(D::[playerid][dTaxiDuty] == true && D::[playerid][dArendTaxi] == 0 || D::[playerid][dArendTaxi] == -1) Player[playerid][uTaxiNoZp] = gettime();
		SetVehicleToRespawn(D::[playerid][dTaxiKey]);
    }
    if(D::[playerid][dDalnKey] != -1 && V::[D::[playerid][dDalnKey]][vDalnDriver] == playerid) {
        if(D::[playerid][dDalnDuty] == true && D::[playerid][dArendDaln] == 0 || D::[playerid][dArendDaln] == -1) Player[playerid][uDalnNoZp] = gettime();
		SetVehicleToRespawn(D::[playerid][dDalnKey]);
		for(new i;i<10;i++)
		{
			if(gTruckLoadTurn[0][i] == playerid) gTruckLoadTurn[0][i] = INVALID_PLAYER_ID;
		}
    }
    if(D::[playerid][dWoodsDuty] != 0) {
        RemovePlayerAttachedObject(playerid,9);
        D::[playerid][dWoodsDuty] = 0;
	    SetPVarInt(playerid,"TimerCountWoods",0);
        if(GetPVarInt(playerid,"WoodDrop")) {
        	new j = GetPVarInt(playerid,"WoodDrop");
            if(WD::[j][woodIsDrop] == false) {
        		WD::[j][woodIsDrop] = true;
         		WD::[j][woodUse] = false;
         		MoveDynamicObject(WD::[j][woodObject],WoodsDrop[j][0],WoodsDrop[j][1],WoodsDrop[j][2] - 0.05, 0.05, WoodsDrop[j][3],WoodsDrop[j][4],WoodsDrop[j][5]);
         	}
        }
    }
    if(PlayerTrailer[playerid] != -1) {
        V::[PlayerTrailer[playerid]][vWoods] = 0;
		V::[PlayerTrailer[playerid]][vMebel] = 0;
		V::[PlayerTrailer[playerid]][vToplivo] = 0;
	
		if (IsValidDynamic3DTextLabel(V::[PlayerTrailer[playerid]][vTextTrailer]))
		{
			DestroyDynamic3DTextLabel(V::[PlayerTrailer[playerid]][vTextTrailer]);
			V::[PlayerTrailer[playerid]][vTextTrailer] = Text3D: INVALID_3DTEXT_ID;
		}
		
    	DestroyVehicle(PlayerTrailer[playerid]);
			
		PlayerTrailer[playerid] = -1;
		SetPVarInt(playerid,"dettachTrailer",0);


	}
	
	if(Border::[playerid][bStatus] == true) {
		DestroyDynamicObject(Border::[playerid][bObjects]);
		Border::[playerid][bP][0] = 0.0;
		Border::[playerid][bP][1] = 0.0;
		Border::[playerid][bP][2] = 0.0;
		Border::[playerid][bStatus] = false;
		Border::[playerid][bMember] = 0;
	}
	if(GetPVarInt(playerid,"EffectGone")) KillTimer(GetPVarInt(playerid,"EffectGone"));
    if(GetPVarInt(playerid,"TimerStanok")) KillTimer(GetPVarInt(playerid,"TimerStanok"));
    if(GetPVarInt(playerid,"WoodsPlayer")) KillTimer(GetPVarInt(playerid,"WoodsPlayer"));

    if(GetPVarInt(playerid,"CountBackTaxi") != 0) SetPVarInt(playerid,"CountBackTaxi",0);
    if(GetPVarInt(playerid,"CountBackToBus") != 0) SetPVarInt(playerid,"CountBackToBus",0);
    if(GetPVarInt(playerid,"TimerCountWoods") != 0) SetPVarInt(playerid,"TimerCountWoods",0);
	if(GetPVarInt(playerid,"CountBackDaln") != 0) SetPVarInt(playerid,"CountBackDaln",0);

	if(GetPVarInt(playerid,"BizzBuyingCamera")) Bizz::[GetPVarInt(playerid,"BizzBuyingCamera")][bCamera] = false;
	if(GetPVarInt(playerid,"follow") != INVALID_PLAYER_ID) SetPVarInt(GetPVarInt(playerid,"follow"),"follow",INVALID_PLAYER_ID);
	if(GetPVarInt(playerid,"PlayerCameraHouse") == 1) {
		Player[playerid][uP][0] = GetPVarFloat(playerid,"HouseBuyX");
		Player[playerid][uP][1] = GetPVarFloat(playerid,"HouseBuyY");
		Player[playerid][uP][2] = GetPVarFloat(playerid,"HouseBuyZ");
		Player[playerid][uInt][0] = 1;
		Player[playerid][uInt][1] = 0;
		togglePlayerControllable(playerid,false);
	}
	if(GetPVarInt(playerid,"PlayerSelectedProducts") != 0) Product::[GetPVarInt(playerid,"PlayerSelectedProducts") - 1][bStatus] = false;
	if(GetPVarInt(playerid,"AdvertID") != -1) AD::[GetPVarInt(playerid,"AdvertID")][adUsed] = false;

	if(newsLeaderEther == playerid) {
		newsLeaderEther = INVALID_PLAYER_ID;
		EtherStatus = false;
	}
	if(newsClientEther == playerid) newsClientEther = INVALID_PLAYER_ID;

    if(IsPlayerInAnyVehicle(playerid)) GetVehiclePos(GetPlayerVehicleID(playerid),p[0],p[1],p[2]);
    else GetPlayerPos(playerid,p[0],p[1],p[2]);

    if(p[0] != 0.0) 
	{
	    mysql_format:vb_string( "UPDATE gb_users SET uP1 = '%f',uP2 = '%f',uP3 = '%f',uInt = '%d',uWorld = '%d' WHERE uID = %d",
			p[0],
			p[1],
			p[2],
			GetPlayerInterior( playerid ),
			GetPlayerVirtualWorld( playerid ),
			Player[playerid][uID]
		);
	    mysql_tquery( mysql, vb_string, "", "" );
    }

	mysql_format:vb_string( "UPDATE gb_users SET uSuspect = '%d',uNumber = '%d', uStatus = '0',\
	uMute = '%d',uHunger = '%d',uMoney = '%d',uJobDouble = '%d|%d|%d|%d|%d|%d|%d',uJailSettings = '%d|%d|%d|%d|%d', uDMJail = '%d', uBMute = '%d', uPayTime = '%d' WHERE BINARY uName = '%s'",
	Player[playerid][uSuspect], Player[playerid][uNumber], Player[playerid][uMute], Player[playerid][uHunger],
	Player[playerid][uMoney],Player[playerid][uJobDouble][0],Player[playerid][uJobDouble][1],Player[playerid][uJobDouble][2],Player[playerid][uJobDouble][3],Player[playerid][uJobDouble][4],
	Player[playerid][uJobDouble][5],Player[playerid][uJobDouble][6],Player[playerid][uJailSettings][0],Player[playerid][uJailSettings][1],Player[playerid][uJailSettings][2],
	Player[playerid][uJailSettings][3],Player[playerid][uJailSettings][4],Player[playerid][uDMJail],Player[playerid][uBMute], Player[playerid][uPayTime], Player[playerid][uName]);
	mysql_tquery( mysql, vb_string, "", "" );
	SaveInventory( playerid );

	nowUpdateInfo(playerid , "d" , "gb_users" , "uName" , "uJobValue" , Player[playerid][uJobValue]);
 	nowUpdateInfo(playerid , "d" , "gb_users" , "uName" , "ValueSt" , Player[playerid][uValueSt]);

	if(GetPVarInt(playerid, "BKONFORPLAYER") == 1)
	{
		BackupClear(playerid, 0);
		SetPVarInt(playerid, "BKONFORPLAYER", 0);
	}
	nowUpdateInfo(playerid, "d" , "gb_users" , "uName" , "uMoney" , Player[playerid][uMoney]);

	mysql_format:vb_string( "INSERT INTO `gb_sessions` (`uName`, `pIP`, `pSessionStart`, `pSessionEnd`) VALUES ('%s', '%s', '%d', '%d')", Player[playerid][uName], Player[playerid][uIP], GetPVarInt(playerid, "SessionStart"), gettime());
    mysql_tquery( mysql, vb_string, "", "");
	
	return 1;
}

public OnPlayerEditDynamicObject(playerid, objectid, response, Float:x, Float:y, Float:z, Float:rx, Float:ry, Float:rz) {
	clear_massive();
	if( objectid && getData( playerid, "dr_model" ) ) {
		if( response == EDIT_RESPONSE_FINAL || response == EDIT_RESPONSE_CANCEL ) {
			new i = getData( playerid, "dr_id" ), omodel = getData( playerid, "dr_model" );
			DestroyDynamicObject( getData( playerid, "dr_object" ) );
			//MoveDynamicObject( objectid, x, y, z, 10.0, rx, ry, rz );
			
			_objectInfo[i][objText] = CreateDynamic3DTextLabel( _itemsInfo[getData( playerid, "dr_name" )][invName], 0xFFFFFF50, x, y, z, 2.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, -1, GetPlayerVirtualWorld(playerid));
			_objectInfo[i][objObject] = CreateDynamicObject( omodel, x, y, z, rx, ry, rz, GetPlayerVirtualWorld(playerid) );
   			MeAction(playerid,"выкинул(-а) что-то на землю",1);
   			_objectInfo[i][objPos][0] = x;
		   	_objectInfo[i][objPos][1] = y;
	    	_objectInfo[i][objPos][2] = z + 1;
	    	DeletePVar( playerid, "dr_id" ), DeletePVar( playerid, "dr_model" ), DeletePVar( playerid, "dr_name" );
	    	printf("[TEST] %s выкинул %d", Player[playerid][uName], omodel );
		}
	}
	if(response == EDIT_RESPONSE_FINAL) {
	    if( GetPVarInt(playerid, "IsPlayerCreateObject") == 1 ) {
            if(!IsValidDynamicObject(objectid)) return SendClientMessage(playerid, C_GRAY, "Ошибка в системе. Обратитесь к администратору! [#0001]");
            MoveDynamicObject(objectid, x, y, z, 10.0, rx, ry, rz);
            new idi = GetPVarInt(playerid, "IDMassive_Object"), string[16];
            ObjList[idi][oModel] = GetPVarInt(playerid, "ObJectCreateID");
            ObjList[idi][Obj_X] = x;
            ObjList[idi][Obj_Y] = y;
            ObjList[idi][Obj_Z] = z;
            ObjList[idi][ObjRx] = rx;
            ObjList[idi][ObjRy] = ry;
            ObjList[idi][ObjRz] = rz;
            format( string, sizeof string, "[%d]", ObjList[idi][oID] );
            ObjList[idi][o3DText] = CreateDynamic3DTextLabel( string, 0xE6E6E6AA, x, y, z + 0.5, 3.0 );
	        SetPVarInt(playerid, "IsPlayerCreateObject", 0);
            cObjectS++;
        }
    }
    if(response == EDIT_RESPONSE_CANCEL)
    {
        if(GetPVarInt(playerid, "IsPlayerCreateObject") == 1)
        {
            new idi = GetPVarInt(playerid, "IDMassive_Object");
            DestroyDynamicObject(ObjList[idi][oObject]);
            ObjList[idi][oObject] = 0;
            ObjList[idi][Obj_X] = 0;
            ObjList[idi][Obj_Y] = 0;
            ObjList[idi][Obj_Z] = 0;
            ObjList[idi][ObjRx] = 0;
            ObjList[idi][ObjRy] = 0;
            ObjList[idi][ObjRz] = 0;
            ObjList[idi][oModel] = 0;
            SetPVarInt(playerid, "IsPlayerCreateObject", 0);
        }
    }
	return 0;
}



public OnPlayerCommandText(playerid, cmdtext[]) {
	return 0;//
}

public OnPlayerStreamIn(playerid, forplayerid) {
	if(Player[playerid][uSettings][3] == 1) ShowPlayerNameTagForPlayer(playerid,forplayerid,0);
	return 1;
}

public OnPlayerExitVehicle(playerid,vehicleid) 
{

    if(RadioVeh[vehicleid] != -1) StopAudioStreamForPlayer(playerid);
    if(vehicleid >= ataxils[0] && vehicleid <= ataxils[1]) {
		if(V::[vehicleid][vTaxiDriver] == playerid && D::[playerid][dTaxiKey] == vehicleid) {
			SetPVarInt(playerid,"CountBackTaxi",MAX_COUNT_BACK_TAXI);
			DisablePlayerCheckpoint(playerid);
			if(GetPVarInt(playerid,"SelectTaxiMarsh") == 1) DeletePVar(playerid,"SelectTaxiMarsh");
		}
	}
	if(vehicleid >= buscars[0] && vehicleid <= buscars[1]) {
	    if(Player[playerid][uJob] == 2 && D::[playerid][dBusDuty] == true) {
	        if(V::[vehicleid][vBusDriver] == playerid && D::[playerid][dBusKey] == vehicleid) {
	        	if(GetPVarInt(playerid,"BusToGo") != -1) {
					SetPVarInt(playerid,"CountBackToBus",MAX_COUNT_BACK_BUS);
					DisablePlayerRaceCheckpoint(playerid);
	        	}
			}
	    }
	}
	if(vehicleid >= dalncars[0] && vehicleid <= dalncars[1]) {
		if(V::[vehicleid][vDalnDriver] == playerid && D::[playerid][dDalnKey] == vehicleid) SetPVarInt(playerid,"CountBackDaln",MAX_COUNT_BACK_DALN);
	}
	StopAudioStreamForPlayer(playerid);
	return 1;
}

public OnPlayerStateChange(playerid, newstate, oldstate) 
{
	// TODO

    new car = GetPlayerVehicleID(playerid),string[256];
   	if(newstate == PLAYER_STATE_DRIVER || newstate == PLAYER_STATE_PASSENGER)
   	{
		if(RadioVeh[GetPlayerVehicleID(playerid)] != -1)
		{
			StopAudioStreamForPlayer(playerid); //АВТОШОУ
			if( RadioVeh [GetPlayerVehicleID(playerid)] == sizeof Radio ) {
			    PlayAudioStreamForPlayer(playerid, RadioVehStation[GetPlayerVehicleID(playerid)] );
			}
			else {
				PlayAudioStreamForPlayer(playerid, Radio [ RadioVeh [GetPlayerVehicleID(playerid)] ] [ 1 ] );
			}
		}
	}
    switch(newstate) {
		case PLAYER_STATE_DRIVER: {


		    SetPVarInt(playerid,"VehID",GetPlayerVehicleID(playerid));
		    if(!IsVelo(car)) {
            	UpdateVehicleHud(playerid);
				if(Player[playerid][uSettings][0] == 1) {
				    for(new i; i != 3; i++) TextDrawShowForPlayer(playerid, SpeedFon[i]);
					for(new i; i != 8; i++) PlayerTextDrawShow(playerid,Speed[i][playerid]);
					UpdateFuelBar(playerid,GetPlayerVehicleID(playerid));
				}
				else {
				    for(new i; i != 3; i++) TextDrawHideForPlayer(playerid, SpeedFon[i]);
					for(new i; i != 8; i++) PlayerTextDrawHide(playerid,Speed[i][playerid]);
				}
			}

			PlayerTextDrawSetString(playerid,Speed[6][playerid],"");
      		SendClientMessage( playerid ,-1, ""gbInfo"Завести двигатель - "cBLUE"CTRL"cWHITE" | Ограничитель скорости - "cBLUE"2"cWHITE"." );
      		if(car >= ataxils[0] && car <= ataxils[1]) {
				if(V::[car][vTaxiDriver] == playerid && D::[playerid][dTaxiKey] == car && D::[playerid][dTaxiDuty] == true && D::[playerid][dArendTaxi] != -1 || D::[playerid][dArendTaxi] != 0) SetPVarInt(playerid,"CountBackTaxi",0);
				else {
				    GetVehicleParamsEx(car,eng,light,other1,other2,other3,other4,other5);
				    SetVehicleParamsEx(car,false,light,other1,other2,other3,other4,other5);
				    return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
				}
			}
			else if(car >= dalncars[0] && car <= dalncars[1]) {
			    if(V::[car][vDalnDriver] == playerid && D::[playerid][dDalnKey] == car && D::[playerid][dDalnDuty] == true) {
			    	if(!IsTrailerAttachedToVehicle(car) && GetVehicleModel(car) == 403 || GetVehicleModel(car) == 514 || GetVehicleModel(car) == 515) {
						SendClientMessage(playerid,C_GRAY,""gbInfo"Отправляйтесь на склад и возьмите прицеп. ( "cBLUE"/gps{ffffff} )");
					}
					if(GetVehicleModel(car) == 498 || GetVehicleModel(car) == 456 || GetVehicleModel(car) == 499 || GetVehicleModel(car) == 414 && V::[car][vProducts] == 0) {
						SendClientMessage(playerid,C_GRAY,""gbInfo"Отправляйтесь на склад и возьмите товар. ( "cBLUE"/gps{ffffff} )");
					}
			    }
				if(V::[car][vDalnDriver] == playerid && D::[playerid][dDalnKey] == car && D::[playerid][dDalnDuty] == true && D::[playerid][dArendTaxi] != -1 || D::[playerid][dArendTaxi] != 0) SetPVarInt(playerid,"CountBackDaln",0);
				else {
				    GetVehicleParamsEx(car,eng,light,other1,other2,other3,other4,other5);
				    SetVehicleParamsEx(car,false,light,other1,other2,other3,other4,other5);
				    return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
				}
			}
			else if(car >= lspdcars[0] && car <= lspdcars[1]) {
				if(Player[playerid][uMember] != 2 || Player[playerid][uIsPlayerJob][0] == 0) {
					GetVehicleParamsEx(car,eng,light,other1,other2,other3,other4,other5);
				    SetVehicleParamsEx(car,false,light,other1,other2,other3,other4,other5);
				}
			}
			else if(car >= sherifcar[0] && car <= sherifcar[1]) {
				if(Player[playerid][uMember] != 1 || Player[playerid][uIsPlayerJob][0] == 0) {
					GetVehicleParamsEx(car,eng,light,other1,other2,other3,other4,other5);
				    SetVehicleParamsEx(car,false,light,other1,other2,other3,other4,other5);
				}
			}
			else if(car >= sasd_car[0] && car <= sasd_car[1] ) {
				if( Player[playerid][uMember] != 8 || Player[playerid][uIsPlayerJob][0] == 0 ) {
					GetVehicleParamsEx(car,eng,light,other1,other2,other3,other4,other5);
				    SetVehicleParamsEx(car,false,light,other1,other2,other3,other4,other5);
				}
			}
			else if(car >= medicalcar[0] && car <= medicalcar[1]) {
				if(Player[playerid][uMember] != 3 || Player[playerid][uIsPlayerJob][1] == 0) {
					GetVehicleParamsEx(car,eng,light,other1,other2,other3,other4,other5);
				    SetVehicleParamsEx(car,false,light,other1,other2,other3,other4,other5);
				}
			}
			else if(car >= smicars[0] && car <= smicars[1]) {
				if(Player[playerid][uMember] != 4) {
					GetVehicleParamsEx(car,eng,light,other1,other2,other3,other4,other5);
				    SetVehicleParamsEx(car,false,light,other1,other2,other3,other4,other5);
				}
			}
			else if(car >= fd_cars[0] && car <= fd_cars[1]) {
				if(Player[playerid][uMember] != 5 || Player[playerid][uIsPlayerJob][2] == 0) {
					GetVehicleParamsEx(car,eng,light,other1,other2,other3,other4,other5);
				    SetVehicleParamsEx(car,false,light,other1,other2,other3,other4,other5);
				}
			}
			else if(car >= meria[0] && car <= meria[1]) {
				if(Player[playerid][uMember] != 6) {
					GetVehicleParamsEx(car,eng,light,other1,other2,other3,other4,other5);
				    SetVehicleParamsEx(car,false,light,other1,other2,other3,other4,other5);
				}
			}
			else if(car >= comm[0] && car <= comm[1]) {
				if(Player[playerid][uMember] != 7) {
					GetVehicleParamsEx(car,eng,light,other1,other2,other3,other4,other5);
				    SetVehicleParamsEx(car,false,light,other1,other2,other3,other4,other5);
				}
			}
			
			
			else if(car >= carsalon[0][0] && car <= carsalon[1][0]) 
			{
			    switch(V::[car][vRentCar][0])
			    {
			        case 0:
			        {
                        if(Player[playerid][uLicenses][0] == 0)
                        {
                            removePlayerFromVehicle(playerid);
						 	SendClientMessage(playerid,C_GRAY,""gbError"У вас нет водительских удостоверений!");
						 	return 1;
						}
						if(D::[playerid][dRentVehicleID] > 0 && D::[playerid][dRentVehicleTime] != 0)
						{
						    removePlayerFromVehicle(playerid);
					 		SendClientMessage(playerid, -1, ""gbError"Вы уже арендуете транспорт");
					 		return 1;
						}
			            SetPVarInt(playerid, "rent_veh", car);
			            SetPVarInt(playerid, "rent_bizz", 84);
			            SetPVarInt(playerid, "rent_price", Bizz::[84][bSettings][5]*ProdVehicleLal(GetPlayerVehicleID(playerid)));
						format(string, sizeof(string), "{ffffff}Вы можете арендовать это транспортное средство на время.\n\n"gbInfo"Стоимость аренды для данного ТС: "cGREEN"$%i/минута\n\n"gbInfo"Введите, на сколько минут Вы хотите арендовать данное ТС:", Bizz::[84][bSettings][5]*ProdVehicleLal(GetPlayerVehicleID(playerid)));
						showPlayerDialog(playerid, d_bizz + 34, DIALOG_STYLE_INPUT, "Аренда транспорта", string, "Далее", "Отмена");
			        }
			        case 1:
			        {
			            if(D::[playerid][dRentVehicleID] == car) { }
			            else
			            {
			                SendClientMessage(playerid, -1, ""gbError"Данный транспорт уже кто-то арендует.");
			 				removePlayerFromVehicle(playerid);
			            }
					}
			    }
			}
			else if(car >= carsalon[0][1] && car <= carsalon[1][1]) {
			    switch(V::[car][vRentCar][0])
			    {
			        case 0:
			        {
			            if(Player[playerid][uLicenses][0] == 0)
                        {
                            removePlayerFromVehicle(playerid);
						 	SendClientMessage(playerid,C_GRAY,""gbError"У вас нет водительских удостоверений!");
						 	return 1;
						}
			            if(D::[playerid][dRentVehicleID] > 0 && D::[playerid][dRentVehicleTime] != 0)
						{
						    removePlayerFromVehicle(playerid);
					 		SendClientMessage(playerid, -1, ""gbError"Вы уже арендуете транспорт");
					 		return 1;
						}
			            SetPVarInt(playerid, "rent_veh", car);
			            SetPVarInt(playerid, "rent_bizz", 83);
			            SetPVarInt(playerid, "rent_price", Bizz::[83][bSettings][5]*ProdVehicleLal(GetPlayerVehicleID(playerid)));
						format(string, sizeof(string), "{ffffff}Вы можете арендовать это транспортное средство на время.\n\n"gbInfo"Стоимость аренды для данного ТС: "cGREEN"$%i/минута\n\n"gbInfo"Введите, на сколько минут Вы хотите арендовать данное ТС:", Bizz::[83][bSettings][5]*ProdVehicleLal(GetPlayerVehicleID(playerid)));
						showPlayerDialog(playerid, d_bizz + 34, DIALOG_STYLE_INPUT, "Аренда транспорта", string, "Далее", "Отмена");
			        }
			        case 1:
			        {
			            if(D::[playerid][dRentVehicleID] == car) { }
			            else
			            {
			                SendClientMessage(playerid, -1, ""gbError"Данный транспорт уже кто-то арендует.");
			 				removePlayerFromVehicle(playerid);
			            }
					}
			    }
			}
			else if(car >= carsalon[0][2] && car <= carsalon[1][2]) {
			    switch(V::[car][vRentCar][0])
			    {
			        case 0:
			        {
			            if(Player[playerid][uLicenses][2] == 0)
                        {
                            removePlayerFromVehicle(playerid);
						 	SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет лицензии на воздушный транспорт!");
						 	return 1;
						}
			            if(D::[playerid][dRentVehicleID] > 0 && D::[playerid][dRentVehicleTime] != 0)
						{
						    removePlayerFromVehicle(playerid);
					 		SendClientMessage(playerid, -1, ""gbError"Вы уже арендуете транспорт");
					 		return 1;
						}
			            SetPVarInt(playerid, "rent_veh", car);
			            SetPVarInt(playerid, "rent_bizz", 85);
			            SetPVarInt(playerid, "rent_price", Bizz::[85][bSettings][5]*ProdVehicleLal(GetPlayerVehicleID(playerid)));
						format(string, sizeof(string), "{ffffff}Вы можете арендовать это транспортное средство на время.\n\nСтоимость аренды для данного ТС: "cGREEN"$%i/минут\n\nВведите, на сколько минут Вы хотите арендовать данное ТС:", Bizz::[85][bSettings][5]*ProdVehicleLal(GetPlayerVehicleID(playerid)));
						showPlayerDialog(playerid, d_bizz + 34, DIALOG_STYLE_INPUT, "Аренда транспорта", string, "Далее", "Отмена");
			        }
			        case 1:
			        {
			            if(D::[playerid][dRentVehicleID] == car) { }
			            else
			            {
			                SendClientMessage(playerid, -1, ""gbError"Данный транспорт уже кто-то арендует.");
			 				removePlayerFromVehicle(playerid);
			            }
					}
			    }
			}
			else if(car >= carsalon[0][3] && car <= carsalon[1][3]) {
			    switch(V::[car][vRentCar][0])
			    {
			        case 0:
			        {
			            if(Player[playerid][uLicenses][1] == 0)
                        {
                            removePlayerFromVehicle(playerid);
						 	SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет лицензии на лодки!");
						 	return 1;
						}
			            if(D::[playerid][dRentVehicleID] > 0 && D::[playerid][dRentVehicleTime] != 0)
						{
						    removePlayerFromVehicle(playerid);
					 		SendClientMessage(playerid, -1, ""gbError"Вы уже арендуете транспорт");
					 		return 1;
						}
						SetPVarInt(playerid, "rent_veh", car);
						SetPVarInt(playerid, "rent_bizz", 82);
			            SetPVarInt(playerid, "rent_price", Bizz::[82][bSettings][5]*ProdVehicleLal(GetPlayerVehicleID(playerid)));
						format(string, sizeof(string), "{ffffff}Вы можете арендовать это транспортное средство на время.\n\n"gbInfo"Стоимость аренды для данного ТС: "cGREEN"$%i/минута\n\n"gbInfo"Введите, на сколько минут Вы хотите арендовать данное ТС:", Bizz::[82][bSettings][5]*ProdVehicleLal(GetPlayerVehicleID(playerid)));
						showPlayerDialog(playerid, d_bizz + 34, DIALOG_STYLE_INPUT, "Аренда транспорта", string, "Далее", "Отмена");
						
						player_rent_timer[playerid] = SetTimerEx( "OnPlayerRentTimeOut", 30000, false, "d", playerid );
					}
			        case 1:
			        {
			            if(D::[playerid][dRentVehicleID] == car) { }
			            else
			            {
			                SendClientMessage(playerid, -1, ""gbError"Данный транспорт уже кто-то арендует.");
			 				removePlayerFromVehicle(playerid);
			            }
					}
			    }
			}
		}
		case PLAYER_STATE_ONFOOT: {
		    for(new i; i != 3; i++) TextDrawHideForPlayer(playerid, SpeedFon[i]);
			for(new i; i != 8; i++) PlayerTextDrawHide(playerid,Speed[i][playerid]);
		}
		case PLAYER_STATE_PASSENGER: {
			if(car >= ataxils[0] && car <= ataxils[1]) {
				if(V::[car][vTaxiDriver] != -1 && IsPlayerInAnyVehicle(V::[car][vTaxiDriver]) && GetPlayerVehicleSeat(V::[car][vTaxiDriver]) == 0) {
					if(Player[playerid][uMoney] < D::[V::[car][vTaxiDriver]][dTaxiFare]) return removePlayerFromVehicle(playerid),SendClientMessage(playerid,C_GRAY,""gbError"У вас недостаточно средств для проезда в этом такси.");
					Player[playerid][uMoney] -= D::[V::[car][vTaxiDriver]][dTaxiFare];
                    nowUpdateInfo(playerid , "d" , "gb_users" , "uName" , "uMoney" , Player[playerid][uMoney]);
					Player[V::[car][vTaxiDriver]][uMoney] += D::[V::[car][vTaxiDriver]][dTaxiFare];
					nowUpdateInfo(V::[car][vTaxiDriver] , "d" , "gb_users" , "uName" , "uMoney" , Player[V::[car][vTaxiDriver]][uMoney]);
                    showPlayerDialog(playerid,9999,0," ","{ffffff}Укажите водителю маршрут, по которому вы хотите ехать.\n\n"cGREEN"ESC - Карта - ПКМ","Закрыть","");
					if(D::[V::[car][vTaxiDriver]][dTaxiFare] == 0) return SendClientMessage(playerid,C_GRAY,""gbAccess"Вы сели в бесплатное такси.");
					format(string,sizeof(string),""gbAccess"Вы отдали водителю такси $%d за проезд.",D::[V::[car][vTaxiDriver]][dTaxiFare]);
					SendClientMessage(playerid,C_GREEN,string);
					format(string,sizeof(string),""gbInfo"Пассажир отдал Вам $%d за проезд.",D::[V::[car][vTaxiDriver]][dTaxiFare]);
					SendClientMessage(V::[car][vTaxiDriver],C_GREEN,string);
				}
			}
			if(car >= buscars[0] && car <= buscars[1]) {
			    if(V::[car][vBusDriver] != -1 && IsPlayerInAnyVehicle(V::[car][vBusDriver]) && GetPlayerVehicleSeat(V::[car][vBusDriver]) == 0) {
			        if(Player[playerid][uMoney] < S::[0][sMeria][1]) {
			        	SendClientMessage(playerid,C_GRAY,""gbError"У Вас недостаточно средств для проезда в автобусе.");
			        	return removePlayerFromVehicle(playerid);
			        }
			        Player[playerid][uMoney] -= S::[0][sMeria][1];
			        S::[0][sMeria][0] += S::[0][sMeria][1];
			        nowUpdateInfo(playerid , "d" , "gb_users" , "uName" , "uMoney" , Player[playerid][uMoney]);
			        MeAction(playerid,"заплатил(-а) за проезд",1);
			        format(string,sizeof(string),"UPDATE gb_others SET sMeria0 = %d",S::[0][sMeria][0]);
					mysql_tquery(1, string, "", "");
			    }
			}
		}
    }

    return 1;
}

public OnPlayerGiveDamage(playerid, damagedid, Float: amount, weaponid) {
	new string[128];
	if(damagedid != INVALID_PLAYER_ID) {
		switch(random(10)) {
			case 0 .. 4: {
				if(weaponid == 3 && _itemsInfo[Inv[playerid][invSlot][50]][invID] == 65) {
					if(Player[damagedid][uMember] == 8 || Player[damagedid][uMember] == 1 || Player[damagedid][uMember] == 2) return 1;
					togglePlayerControllable(damagedid,false);
					SetPVarInt(playerid,"playerFreezingTime",MAX_TIME_UNFREEZE_J);
					SendClientMessage(playerid,C_GRAY,""gbAccess"Вы сильно ударили и оглушили данного человека.");
					SendClientMessage(damagedid,C_GRAY,""gbInfo"Ваc сильно ударили и вы потеряли сознание на 10 секунд.");
					ApplyAnimation(damagedid, "CRACK", "crckdeth2", 4.0, 0, 1, 1, 1, 0, 1);
					format(string,sizeof(string),"оглушил(-а) %s",Player[damagedid][uName]);
					MeAction(playerid,string,1);
					MeAction(damagedid,"оглушен(-а)",1);
				}
			}
			case 5 .. 9: {}
		}
	}
	if (weaponid == 23 && GetPVarInt(playerid, "Tazer") >= 1 && GetPVarInt(damagedid, "Stunned") <= 0)
 	{
		if (GetPlayerState(damagedid) != PLAYER_STATE_ONFOOT)
  			return SendClientMessage(playerid, -1,""gbError"Игрок должен находиться не в авто.");
		if (GetDistanceBetweenPlayers(playerid, damagedid) > 10.0)
  			return SendClientMessage(playerid, -1,""gbError"Вы промохнулись, потому что игрок далеко.");
		SetPVarInt(damagedid, "Stunned", 60);
		togglePlayerControllable(damagedid, false);
		SendClientMessage(damagedid,C_GRAY,""gbInfo"Вы были оглушены тазером на 60 секунд.");
		format(string,sizeof(string),"оглушил(-а) %s",Player[damagedid][uName]);
		MeAction(playerid,string,1);
		MeAction(damagedid,"оглушен(-а)",1);
		ApplyAnimation(damagedid, "CRACK", "crckdeth4", 4.0, 0, 0, 0, 1, 0, 1);
   }
    return 1;
}

public OnVehicleDeath(vehicleid, killerid)
{
	return 1;
}

public OnPlayerDeath(playerid, killerid, reason)
{
	if(GetPVarInt(playerid, "ObjectFireStatus") >= 1)
	{
	    DestroyDynamicObject(GetPVarInt(playerid, "ObjectFireOne"));
	    DestroyDynamicObject(GetPVarInt(playerid, "ObjectFireTwo"));
	    DeletePVar(playerid, "ObjectFireOne");
	    DeletePVar(playerid, "ObjectFireTwo");
	    DeletePVar(playerid, "ObjectFireStatus");

	    DeletePVar(playerid, "ObjectFireX");
	    DeletePVar(playerid, "ObjectFireY");
	    DeletePVar(playerid, "ObjectFireZ");
	}
	
	switch( getData( playerid, "PlayerMenuShow" ) ) {
		case 1: {
			for( new i; i != 21; i++ ) TextDrawHideForPlayer( playerid, MenuPlayer[i] );
			for( new i; i != 3; i++ ) PlayerTextDrawHide( playerid, menuPlayer[i][playerid] );
		}
		case 2: {
			TextDrawHideForPlayer(playerid, FermFon[0]);
		    TextDrawHideForPlayer(playerid, FermFon[1]);
			PlayerTextDrawHide(playerid, FermSelectSkin[0][playerid]);
			PlayerTextDrawHide(playerid, FermSelectSkin[1][playerid]);
			PlayerTextDrawHide(playerid, FermSelectSkin[2][playerid]);
		}
		case 3: {
			for(new i; i != 9; i ++) 
			{
				if( i == 5 )
					continue;
					
				TextDrawHideForPlayer(playerid, dalnmenu[i]);
			}
			PlayerTextDrawHide(playerid,dalnmenuplayer[playerid]);
		}
		case 4: {
		    for(new i; i != 22; i++) 
			{		
				TextDrawHideForPlayer(playerid,invPlayer[i]);
            }
			for(new s; s != 61; s++) PlayerTextDrawHide(playerid,invSPlayer[playerid][s]);
            SetPVarInt(playerid,"changeSlot",-1);
	        SetPVarInt(playerid,"selectSlot",-1);
	        switch(GetPVarInt(playerid,"UseSlots"))
			{
	        	case 0,1: {
	        		for(new i; i != 18; i++) PlayerTextDrawHide(playerid,slotUse[i][playerid]);
            		for(new i; i != 3; i++) PlayerTextDrawHide(playerid,iconUse[i][playerid]);
            		
	        	}
	        	case 2,3,8,9: {// Пончики тоже
	        		for(new i; i != 16; i ++) {
	        			TextDrawHideForPlayer(playerid,buyingShopFon[i]);
	        			PlayerTextDrawHide(playerid,buyingShopItems[i][playerid]);
	        			PlayerTextDrawHide(playerid,buyingShopInfo[i][playerid]);
	        		}
	        	}
	        	case 6:
	        	{
	        	    for(new i; i != 30; i++) PlayerTextDrawHide(playerid,Warehouse[i][playerid]);
	        	    for(new i; i != 3; i++) PlayerTextDrawHide(playerid,iconUse[i][playerid]);
	        	}
	        	case 7:
	        	{
	        	    for(new i; i != 18; i++) PlayerTextDrawHide(playerid,slotUse[i][playerid]);
            		for(new i; i != 3; i++) PlayerTextDrawHide(playerid,iconUse[i][playerid]);
	        	}
	        }
            for(new i = 48; i != 56; i++) PlayerTextDrawSetSelectable(playerid,invSPlayer[playerid][i], 1);
		}
		case 9: {
			for(new i; i != 13; i++) PlayerTextDrawHide(playerid, NewSkinSelect[i][playerid]);
		}

	}
	SetPVarInt(playerid,"PlayerMenuShow",0);
	SetPVarInt(playerid,"UseSlots",-1);
    CancelSelectTextDraw(playerid);
    SetCameraBehindPlayer(playerid);

    if(GetPVarInt(playerid,"TimerStanok")) {
		KillTimer(GetPVarInt(playerid,"TimerStanok"));
		DeletePVar(playerid,"TimerStanok");
	}
	if(GetPVarInt(playerid,"EffectGone")) {
		KillTimer(GetPVarInt(playerid,"EffectGone"));
		DeletePVar(playerid,"EffectGone");
	}
    if(GetPVarInt(playerid,"WoodsPlayer")) {
		KillTimer(GetPVarInt(playerid,"WoodsPlayer"));
		DeletePVar(playerid,"WoodsPlayer");
	}

	if(GetPVarInt(playerid,"CountBackTaxi") != 0) SetPVarInt(playerid,"CountBackTaxi",0);
	if(GetPVarInt(playerid,"CountBackToBus") != 0) SetPVarInt(playerid,"CountBackToBus",0);
	if(GetPVarInt(playerid,"TimerCountWoods") != 0) SetPVarInt(playerid,"TimerCountWoods",0);
	if(GetPVarInt(playerid,"CountBackDaln") != 0) SetPVarInt(playerid,"CountBackDaln",0);

	if(GetPVarInt(playerid,"BizzBuyingCamera")) { DeletePVar(playerid,"BizzBuyingCamera"); Bizz::[GetPVarInt(playerid,"BizzBuyingCamera")][bCamera] = false; }
	if(GetPVarInt(playerid,"follow") != INVALID_PLAYER_ID) SetPVarInt(GetPVarInt(playerid,"follow"),"follow",INVALID_PLAYER_ID);
	if(GetPVarInt(playerid,"PlayerCameraHouse") == 1) {
		Player[playerid][uP][0] = GetPVarFloat(playerid,"HouseBuyX");
		Player[playerid][uP][1] = GetPVarFloat(playerid,"HouseBuyY");
		Player[playerid][uP][2] = GetPVarFloat(playerid,"HouseBuyZ");
		Player[playerid][uInt][0] = 1;
		Player[playerid][uInt][1] = 0;
		togglePlayerControllable(playerid,false);
		DeletePVar(playerid,"PlayerCameraHouse");
	}
	if(GetPVarInt(playerid,"PlayerSelectedProducts") != 0) Product::[GetPVarInt(playerid,"PlayerSelectedProducts") - 1][bStatus] = false;
	if(GetPVarInt(playerid,"AdvertID") != -1) AD::[GetPVarInt(playerid,"AdvertID")][adUsed] = false;

	if(newsLeaderEther == playerid) {
		newsLeaderEther = INVALID_PLAYER_ID;
		EtherStatus = false;
	}
	if(newsClientEther == playerid) newsClientEther = INVALID_PLAYER_ID;

	if(D::[playerid][dTaxiKey] != -1) {
		D::[playerid][dTaxiDuty] = false;
		SetPVarInt(playerid,"CountBackTaxi",0);
		DeletePVar(playerid,"CheckpointBack");
		SetVehicleToRespawn(D::[playerid][dTaxiKey]);
	}
	if(D::[playerid][dDalnKey] != -1) {
		D::[playerid][dDalnDuty] = false;
		SetPVarInt(playerid,"CountBackDaln",0);
		DeletePVar(playerid,"CheckpointBackDaln");
		SetVehicleToRespawn(D::[playerid][dDalnKey]);
	}
	if(D::[playerid][dBusKey] != -1) {
		D::[playerid][dBusDuty] = false;
		DisablePlayerRaceCheckpoint(playerid);
		SetPVarInt(playerid,"CountBackToBus",0);
		SetPVarInt(playerid,"BusToGo",-1);
		SetVehicleToRespawn(D::[playerid][dBusKey]);
	}
	foreach(new i: Player)
	{
		if(Player[i][uAdmin] >= 1) SendDeathMessageToPlayer(i, killerid, playerid, reason);
	}
	return 1;
}

public OnVehicleMod(playerid,vehicleid,componentid) {
    return 0;
}

public OnVehiclePaintjob(playerid,vehicleid, paintjobid) {
    return 0;
}

public OnVehicleDamageStatusUpdate( vehicleid, playerid ) 
{
	for(new i; i != MAX_CARS_BUY; i++) 
	{
	    if( !IsBuyingCar( i ) ) 
			continue;
			
		if( i == vehicleid ) 
		{
    		GetVehicleDamageStatus(vehicleid,  Car::[i][cDamage][0], Car::[i][cDamage][1], Car::[i][cDamage][2], Car::[i][cDamage][3]);
    		GetVehicleHealth(vehicleid, Car::[i][cFloating][2]);
			break;
		}
	}
	return 1;
}

public OnEnterExitModShop(playerid, enterexit, interiorid) {
    if(enterexit == 1) SetPVarInt(playerid,"ACPlayerTuning",1);
    else DeletePVar(playerid,"ACPlayerTuning");
    return 1;
}

public OnPlayerUpdate(playerid)
{
    new string[256];
    if(GetPVarInt(playerid,"uLogin") == 0) return Kick(playerid);

    if(GetPVarInt(playerid,"PlayerAFKUse") >= 1) SetPVarInt(playerid,"PlayerAFKUse",0);
	SetPVarInt(playerid,"PlayerAFK",0);

	if(GetPVarInt(playerid,"CreateBarForPlayer") >= 1)
	{
 		if(GetPlayerProgressBarValue(playerid, universalbar[playerid]) >= 10)
 		{
    		SetPlayerProgressBarValue(playerid, universalbar[playerid], GetPlayerProgressBarValue(playerid, universalbar[playerid])-2);
			UpdatePlayerProgressBar(playerid, universalbar[playerid]);
		}
		else
		{
		    playerFlags[playerid] ^= YN;
		    KeyYN{playerid} = 0;
			for(new i; i < 2; i++) PlayerTextDrawHide(playerid, YNText[playerid][i]);
			HidePlayerProgressBar(playerid, universalbar[playerid]);
	   		DestroyPlayerProgressBar(playerid, universalbar[playerid]);
	   		SetPVarInt(playerid, "CreateBarForPlayer", 0);

	   		RemovePlayerAttachedObject(playerid, 5);
	  		SetPVarInt(playerid, "FishingStart", 0);
			ClearAnimations(playerid);
			ApplyAnimation(playerid,"ped","IDLE_chat",4.1,1,0,0,0,1,1);
		}
	}
	if(GetPlayerMoney(playerid) != Player[playerid][uMoney]) ResetPlayerMoney(playerid), GivePlayerMoney(playerid,Player[playerid][uMoney]);
	
	if(IsPlayerInAnyVehicle(playerid))
	{
	    switch(GetPlayerWeapon(playerid))
		{
		    case 24: SetPlayerArmedWeapon(playerid,0);
		    case 25: SetPlayerArmedWeapon(playerid,0);
		    case 33: SetPlayerArmedWeapon(playerid,0);
		}
	}

	if(IsPlayerInAnyVehicle(playerid)) {
  		if(GetPlayerState(playerid) == PLAYER_STATE_DRIVER) {
  			foreach(new i : Player) {
  				if(Border::[i][bStatus] == false) continue;
  				if(IsPlayerInRangeOfPoint(playerid, 3.0, Border::[i][bP][0], Border::[i][bP][1], Border::[i][bP][2]) && Border::[i][bObject] == 2899) {
	  				new panels, doors, lights, tires;
		            GetVehicleDamageStatus(GetPlayerVehicleID(playerid), panels, doors, lights, tires);
		            if(tires == 0) {
			            UpdateVehicleDamageStatus(GetPlayerVehicleID(playerid), panels, doors, lights, 15);
			            if(SpeedVehicle(GetPlayerVehicleID(playerid)) > 40.0) {
			            	new Float:angle;
			            	GetVehicleZAngle(GetPlayerVehicleID(playerid),angle);
			            	switch(random(2)) {
			            		case 0: SetVehicleZAngle(GetPlayerVehicleID(playerid),angle + random(30));
			            		case 1: SetVehicleZAngle(GetPlayerVehicleID(playerid),angle - random(30));
			            		default: SetVehicleZAngle(GetPlayerVehicleID(playerid),angle + random(30));
			            	}
			            }
		        	}
		            break;
  				}
  			}
  		}
		if(V::[GetPlayerVehicleID(playerid)][vLimit] == true) {
		    if(GetPlayerVehicleSeat(playerid) == 0) {
				if(SpeedVehicle(GetPlayerVehicleID(playerid)) >= 60) SetVehicleSpeed(GetPlayerVehicleID(playerid),59);
			}
		}
		if(Player[playerid][uSettings][0] == 1) {
			switch(SpeedVehicle(GetPlayerVehicleID(playerid))) {
				case 0 .. 1: PlayerTextDrawSetString(playerid,Speed[6][playerid],"");
			    case 2 .. 5: PlayerTextDrawSetString(playerid,Speed[6][playerid],"I");
			    case 6 .. 10: PlayerTextDrawSetString(playerid,Speed[6][playerid],"II");
			    case 11 .. 15: PlayerTextDrawSetString(playerid,Speed[6][playerid],"III");
			    case 16 .. 20: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIII");
			    case 21 .. 25: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIII");
			    case 26 .. 30: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIII");
			    case 31 .. 35: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIII");
			    case 36 .. 40: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIII");
			    case 41 .. 50: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIII");
			    case 51 .. 60: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIII");
			    case 61 .. 70: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIIII");
			    case 71 .. 75: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIIIII");
			    case 76 .. 80: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIIIIII");
			    case 81 .. 85: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIIIIIII");
			    case 86 .. 90: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIIIIIIII");
			    case 91 .. 95: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIIIIIIIII");
			    case 96 .. 100: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIIIIIIIIII");
			    case 101 .. 105: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIIIIIIIIIII");
			    case 106 .. 110: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIIIIIIIIIIII");
			    case 111 .. 120: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIIIIIIIIIIIII");
			    case 121 .. 125: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIIIIIIIIIIIIII");
			    case 126 .. 130: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIIIIIIIIIIIIIII");
			    case 131 .. 140: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIIIIIIIIIIIIIIII");
			    case 141 .. 999: PlayerTextDrawSetString(playerid,Speed[6][playerid],"IIIIIIIIIIIIIIIIIIIIIIII");
			}
			format(string,sizeof(string),"%d mp/h",SpeedVehicle(GetPlayerVehicleID(playerid)));
			PlayerTextDrawSetString(playerid,Speed[5][playerid],string);
		}
	}
	return 1;
}

public OnObjectMoved(objectid) {
    return 1;
}

public OnPlayerKeyStateChange(playerid, newkeys, oldkeys) {
	clear_massive();
	new car = GetPlayerVehicleID(playerid),string[2048];
	if(newkeys & 128 && oldkeys & 128 && newkeys & KEY_SECONDARY_ATTACK)
	{
		if(GetPVarInt(playerid, "StartTraining") == 1 && GetPVarInt(playerid, "StartTrainingTwo") == 1)
	    {
			if(IsPlayerInRangeOfPoint(playerid, 1, 767.1263, -3.2047, 1000.7186)
			|| IsPlayerInRangeOfPoint(playerid, 1, 769.4302, -3.2047, 1000.7236)
			|| IsPlayerInRangeOfPoint(playerid, 1, 771.1208, 15.6786, 1000.6957)
			|| IsPlayerInRangeOfPoint(playerid, 1, 768.7616, 15.6708, 1000.6974))
			{
				if(Player[playerid][uStyle][0] < 1000)
				{
				    if(Player[playerid][uStyle][2] >= 750 && Player[playerid][uStyle][3] >= 900) {
						if(GetPVarInt(playerid, "ClickStyle") == 20)
						{
							Player[playerid][uStyle][0]++;
							GameTextForPlayer(playerid, "~w~Boxing Style ~g~+1", 500, 1);
							nowUpdateInfo(playerid, "d" , "gb_users" , "uName" , "StyleOne" , Player[playerid][uStyle][0]);
							SetPVarInt(playerid, "ClickStyle", 0);
						}
						else SetPVarInt(playerid, "ClickStyle", GetPVarInt(playerid, "ClickStyle") + 1);
					}
				}
			}
			else if(IsPlayerInRangeOfPoint(playerid, 1, 777.9382, -28.2814, 999.7972)
			|| IsPlayerInRangeOfPoint(playerid, 1, 777.8989, -38.8177, 999.8017)
			|| IsPlayerInRangeOfPoint(playerid, 1, 777.8768, -41.9620, 999.7386)
			|| IsPlayerInRangeOfPoint(playerid, 1, 777.9240, -24.4624, 999.7827))
			{
                if(Player[playerid][uStyle][1] < 1000)
				{
				    if(Player[playerid][uStyle][2] >= 900 && Player[playerid][uStyle][3] >= 700) {
						if(GetPVarInt(playerid, "ClickStyle") == 20)
						{
							Player[playerid][uStyle][1]++;
							GameTextForPlayer(playerid, "~w~Kung Fu Style ~g~+1", 500, 1);
							nowUpdateInfo(playerid, "d" , "gb_users" , "uName" , "StyleTwo" , Player[playerid][uStyle][1]);
							SetPVarInt(playerid, "ClickStyle", 0);
						}
						else SetPVarInt(playerid, "ClickStyle", GetPVarInt(playerid, "ClickStyle") + 1);
					}
				}
			}
			else if(IsPlayerInRangeOfPoint(playerid, 1, 773.5189,-59.1922,1000.7184)
			|| IsPlayerInRangeOfPoint(playerid, 1, 773.3441,-61.8451,1000.7184)
			|| IsPlayerInRangeOfPoint(playerid, 1, 776.0648,-64.7381,1000.7184)
			|| IsPlayerInRangeOfPoint(playerid, 1, 773.9121,-64.7556,1000.7184))
			{
                if(Player[playerid][uStyle][4] < 1000)
				{
				    if(Player[playerid][uStyle][2] >= 850 && Player[playerid][uStyle][3] >= 800) {
						if(GetPVarInt(playerid, "ClickStyle") == 20)
						{
							Player[playerid][uStyle][4]++;
							GameTextForPlayer(playerid, "~w~Kickbox ~g~+1", 500, 1);
							nowUpdateInfo(playerid, "d" , "gb_users" , "uName" , "StyleFive" , Player[playerid][uStyle][4]);
							SetPVarInt(playerid, "ClickStyle", 0);
						}
						else SetPVarInt(playerid, "ClickStyle", GetPVarInt(playerid, "ClickStyle") + 1);
					}
				}
			}
		}
		else SetPlayerFightingStyleEx(playerid);
	}


    if(HOLDING(KEY_CTRL_BACK | KEY_HANDBRAKE)) {
        new target = GetPlayerTargetPlayer(playerid);
        if(target != INVALID_PLAYER_ID) {
			if(GetDistanceBetweenPlayers(playerid,target) < 3.0) {
			    format(string,sizeof(string),"1. "cGRAY"Показать "cBLUE"%s"cGRAY" паспорт\n{ffffff}2. "cGRAY"Передать "cBLUE"%s"cGRAY" деньги\n{ffffff}3. "cGRAY"Поздароваться с "cBLUE"%s\n{ffffff}4. "cGRAY"Обыскать "cBLUE"%s",
			    Player[target][uName],Player[target][uName],Player[target][uName],Player[target][uName]);
			    showPlayerDialog(playerid,d_target,2," ",string,"Далее","Закрыть");
			    SetPVarInt(playerid,"playerTarget",target);
			}
        }
    }
	if(PRESSED(KEY_SUBMISSION) && GetPlayerState(playerid) == PLAYER_STATE_DRIVER) {
		if(!IsVelo(car) && !IsPlane(car)) {
			if(V::[car][vLimit] == false) V::[car][vLimit] = true,SendClientMessage(playerid,C_GREEN,""gbAccess"Вы включили ограничитель скорости!");
			else V::[car][vLimit] = false,SendClientMessage(playerid,C_RED,""gbAccess"Вы выключили ограничитель скорости!");
		}
		UpdateVehicleHud(playerid);
	}
	if(PRESSED(KEY_SPRINT)) {
	    EngageInGym(playerid);
	}

	if(GetPVarInt(playerid, "FishingStart") >= 1)
	{
		//Y-N
		if((playerFlags[playerid] & YN))
		{
			if(GetPlayerProgressBarValue(playerid, universalbar[playerid]) < 200)
			{
				switch(KeyYN{playerid})
				{
					case 0:
					{
						if(newkeys & KEY_NO)
						{
	       					KeyYN{playerid} = RandomEx(0, 2);
							switch(KeyYN{playerid})
							{
								case 0: PlayerTextDrawSetString(playerid, YNText[playerid][1], "PRESS ~r~N");
								case 1: PlayerTextDrawSetString(playerid, YNText[playerid][1], "PRESS ~r~Y");
							}
							PlayerTextDrawHide(playerid, YNText[playerid][1]);
							PlayerTextDrawShow(playerid, YNText[playerid][1]);
							SetPlayerProgressBarValue(playerid, universalbar[playerid], GetPlayerProgressBarValue(playerid, universalbar[playerid])+10);
				   			UpdatePlayerProgressBar(playerid, universalbar[playerid]);
				   			if(!IsPlayerInAnyVehicle(playerid)) ApplyAnimation(playerid,"SWORD","sword_block",50.0 ,0,1,0,1,1);
							return 1;
						}
						else if(newkeys & KEY_YES)
						{
							KeyYN{playerid} = RandomEx(0, 2);
							switch(KeyYN{playerid})
							{
								case 0: PlayerTextDrawSetString(playerid, YNText[playerid][1], "PRESS ~r~N");
								case 1: PlayerTextDrawSetString(playerid, YNText[playerid][1], "PRESS ~r~Y");
							}
							PlayerTextDrawHide(playerid, YNText[playerid][1]);
							PlayerTextDrawShow(playerid, YNText[playerid][1]);
	      					SetPlayerProgressBarValue(playerid, universalbar[playerid], GetPlayerProgressBarValue(playerid, universalbar[playerid])-15);
				   			UpdatePlayerProgressBar(playerid, universalbar[playerid]);
				   			if(!IsPlayerInAnyVehicle(playerid)) ApplyAnimation(playerid,"SWORD","sword_block",50.0 ,0,1,0,1,1);
							return 1;
						}
					}
					case 1:
					{
						if(newkeys & KEY_YES)
						{
	       					KeyYN{playerid} = RandomEx(0, 2);
							switch(KeyYN{playerid})
							{
								case 0: PlayerTextDrawSetString(playerid, YNText[playerid][1], "PRESS ~r~N");
								case 1: PlayerTextDrawSetString(playerid, YNText[playerid][1], "PRESS ~r~Y");
							}
							PlayerTextDrawHide(playerid, YNText[playerid][1]);
							PlayerTextDrawShow(playerid, YNText[playerid][1]);
	      					SetPlayerProgressBarValue(playerid, universalbar[playerid], GetPlayerProgressBarValue(playerid, universalbar[playerid])+10);
				   			UpdatePlayerProgressBar(playerid, universalbar[playerid]);
				   			if(!IsPlayerInAnyVehicle(playerid)) ApplyAnimation(playerid,"SWORD","sword_block",50.0 ,0,1,0,1,1);
							return 1;
						}
						else if(newkeys & KEY_NO)
						{
							KeyYN{playerid} = RandomEx(0, 2);
							switch(KeyYN{playerid})
							{
								case 0: PlayerTextDrawSetString(playerid, YNText[playerid][1], "PRESS ~r~N");
								case 1: PlayerTextDrawSetString(playerid, YNText[playerid][1], "PRESS ~r~Y");
							}
							PlayerTextDrawHide(playerid, YNText[playerid][1]);
							PlayerTextDrawShow(playerid, YNText[playerid][1]);
	      					SetPlayerProgressBarValue(playerid, universalbar[playerid], GetPlayerProgressBarValue(playerid, universalbar[playerid])-15);
				   			UpdatePlayerProgressBar(playerid, universalbar[playerid]);
				   			if(!IsPlayerInAnyVehicle(playerid)) ApplyAnimation(playerid,"SWORD","sword_block",50.0 ,0,1,0,1,1);
							return 1;
						}
					}
				}
			}
			else
			{
			    new test;
			    switch(random(5))
			    {
			        case 0: GivePlayerItem(playerid, 481, 1), test = 1;
			        case 1: GivePlayerItem(playerid, 482, 1), test = 1;
			        case 2: GivePlayerItem(playerid, 483, 1), test = 1;
			        case 3: test = 0;
			        case 4: test = 0;
			    }
			    RemovePlayerAttachedObject(playerid, 5);
			    SetPVarInt(playerid, "FishingStart", 0);
				SetPVarInt(playerid, "CreateBarForPlayer", 0);
				ClearAnimations(playerid);
				ApplyAnimation(playerid,"ped","IDLE_chat",4.1,1,0,0,0,1,1);

				if(test != 0) SendClientMessage(playerid, -1, ""gbAccess"Вы успешно поймали рыбку");
				else SendClientMessage(playerid, -1, ""gbAccess"Вы не чего не поймали");
				// Авто взломанно
				KeyYN{playerid} = 0;
				playerFlags[playerid] ^= YN;
				for(new i; i < 2; i++) PlayerTextDrawHide(playerid, YNText[playerid][i]);
				HidePlayerProgressBar(playerid, universalbar[playerid]);
		    	DestroyPlayerProgressBar(playerid, universalbar[playerid]);
				return 1;
			}
		}
	}
	//


	if(PRESSED(KEY_YES)) {
		if(newsClientEther == playerid) return SendClientMessage(playerid,C_GRAY,""gbError"Вы не можете ответить на звонок пока находитесь в эфире!");
		if(GetPVarInt(playerid,"phoneCalled") != INVALID_PLAYER_ID && GetPVarInt(playerid,"phoneCaller") != INVALID_PLAYER_ID && D::[playerid][dPhone] == false) {
			new id = GetPVarInt(playerid,"phoneCaller");
			if(GetPVarInt(id,"phoneCalled") != playerid) {
				SetPVarInt(playerid,"phoneCalled",INVALID_PLAYER_ID);
				SetPVarInt(playerid,"phoneCaller",INVALID_PLAYER_ID);
				PhoneStatus(playerid,false);
				return SendClientMessage(playerid,C_GRAY,""gbInfo"Абонент вне зоны действия сети ...");
			}
			SendClientMessage(id,C_GRAY,""gbAccess"Собеседник ответил(-а) на ваш входящий звонок, говорите ...");
			SendClientMessage(playerid,C_GRAY,""gbInfo"Вы ответили на звонок, чтобы положить трубку нажмите "cBLUE"N");
			D::[playerid][dPhone] = true;
			PhoneStatus(playerid,true);
			return 1;
		}
		if(GetPVarInt(playerid, "PlayerFrisk") != -1)
		{
		    new GivePlayerID = GetPVarInt(playerid, "PlayerFrisk");
		    SetPVarInt(GivePlayerID, "PlayerFrisk", -1);
			SetPVarInt(playerid, "PlayerFrisk", -1);

			vb_string[0] = EOS;
			format:gb_string( ""gbInfo"Наличные: "cGREEN"$%d"cWHITE".\n\n", Player[ playerid ][uMoney] );
			strcat( vb_string, gb_string );
			for(new i; i != 48; i++) {
				switch(Inv[playerid][invSlot][i])
				{
				    //case 329..338: { }
					case 0: continue;
				}
				format:gb_string( ""gbInfo"%s\t%d{ffffff}\n",_itemsInfo[Inv[playerid][invSlot][i]][invName], Inv[playerid][invSlotKol][i]);
				strcat( vb_string, gb_string );
			}
			showPlayerDialog( GivePlayerID, 9999,0, ""gbAccess"При обыске найдено:", vb_string, "Закрыть", "" );
			return 1;
		}
		if(GetPVarInt(playerid, "PlayerHandshake") != -1)
	    {
      		new GivePlayerID = GetPVarInt(playerid, "PlayerHandshake");
			SetPVarInt(GivePlayerID, "PlayerHandshake", -1);
			SetPVarInt(playerid, "PlayerHandshake", -1);
			if(!IsPlayerConnected(GivePlayerID)) return SendClientMessage(playerid, -1, ""gbError"Такого игрока нет на сервере");
			if(GetDistanceBetweenPlayers(playerid, GivePlayerID) > 3.0) return SendClientMessage(playerid, -1, ""gbError"Вы слишком далеко");
			if(IsPlayerInAnyVehicle(playerid)) return SendClientMessage(playerid, -1, ""gbError"Нельзя использовать в машине");
			TurnPlayerFaceToPlayer(playerid, GivePlayerID);
			TurnPlayerFaceToPlayer(GivePlayerID, playerid);
			ApplyAnimation(playerid, "GANGS", "hndshkfa", 4.0, 0, 0, 0, 0, 0, 0);
			ApplyAnimation(GivePlayerID, "GANGS", "hndshkfa", 4.0, 0, 0, 0, 0, 0, 0);
			format(string,sizeof(string),"поздаровался(-ась) с %s",Player[GivePlayerID][uName]);
			MeAction(playerid,string,1);
			format(string,sizeof(string),"поздаровался(-ась) с %s",Player[playerid][uName]);
			MeAction(GivePlayerID,string,1);
			return 1;
		}
	    if(GetPVarInt(playerid,"PlayerMenuShow") != 0) return 1;
	    // ИЗМЕНИТЬ if(GetPVarInt(playerid,"timerHospital") >= 2) return 1;
		if( getData( playerid, "HTx:Use" ) ) return true;
	    showPlayerDialog(playerid,d_a_menu,2," ","1. "cGRAY"Посмотреть игровое меню{ffffff}\n2. "cGRAY"Открыть свой инвентарь{ffffff}\
		\n3. "cGRAY"Достать сотовый телефон{ffffff}\n{ffffff}4. "cGRAY"Открыть GPS{ffffff}\n5. "cGRAY"Характеристики{ffffff}\
		\n6. "cGRAY"Избранные анимации{ffffff}","Далее","Закрыть");
	}
	if(PRESSED(KEY_NO)) {
		if(D::[playerid][dPhone] == true) {
			if(newsClientEther == playerid) {
				SendClientMessage(playerid,C_GRAY,""gbAccess"Вы положили трубку и покинули эфир!");
				newsClientEther = INVALID_PLAYER_ID;
				SendClientMessage(newsLeaderEther,C_GRAY,""gbInfo"Человек сидевший с вами в эфире, покинул эфир!");
				if(D::[playerid][dPhone] == true) PhoneStatus(playerid,false);
				D::[playerid][dPhone] = false;
				return 1;
			}
		}
		if(GetPVarInt(playerid,"phoneCalled") != INVALID_PLAYER_ID && GetPVarInt(playerid,"phoneCaller") != INVALID_PLAYER_ID) {
			new id;
			if(GetPVarInt(playerid,"phoneCaller") == playerid) id = GetPVarInt(playerid,"phoneCalled");
			else if(GetPVarInt(playerid,"phoneCalled") == playerid) id = GetPVarInt(playerid,"phoneCaller");
			SetPVarInt(playerid,"phoneCalled",INVALID_PLAYER_ID);
			SetPVarInt(playerid,"phoneCaller",INVALID_PLAYER_ID);
			SetPVarInt(id,"phoneCalled",INVALID_PLAYER_ID);
			SetPVarInt(id,"phoneCaller",INVALID_PLAYER_ID);
			SendClientMessage(playerid,C_GRAY,""gbAccess"Вы положили трубку или сбросили входящий вызов ...");
			SendClientMessage(id,C_GRAY,""gbInfo"Собеседник положил трубку или сбросил ваш входящий вызов ...");
			if(D::[playerid][dPhone] == true) PhoneStatus(playerid,false);
			if(D::[id][dPhone] == true) PhoneStatus(id,false);
			D::[playerid][dPhone] = false;
			D::[id][dPhone] = false;
		}
		if(GetPVarInt(playerid, "PlayerHandshake") != -1)
		{
			SetPVarInt(playerid, "PlayerHandshake", -1);
			SendClientMessage(playerid, -1, ""gbAccess"Вы отказали игроку");
		}
		if(GetPVarInt(playerid, "PlayerFrisk") != -1)
		{
			SetPVarInt(playerid, "PlayerFrisk", -1);
			SendClientMessage(playerid, -1, ""gbAccess"Вы отказали игроку");
		}
	}
	if(PRESSED(KEY_AIM)) {
		if(PlayerUseDrink[playerid] == 0) return 1;

		if(GetPVarInt(playerid,"PlayerDrinking") != 5) {
			SetPVarInt(playerid,"PlayerDrinking", GetPVarInt(playerid,"PlayerDrinking") + 1);
			switch(_itemsInfo[PlayerUseDrink[playerid]][invObject]) {
				case 1546: Player[playerid][uHunger] += 5;
				case 1951: Player[playerid][uHunger] += 10;
				case 1669, 1667: Player[playerid][uHunger] += 15;
				case 1668: Player[playerid][uHunger] += 20;
				case 1544: Player[playerid][uHunger] += 15;
				case 1543: Player[playerid][uHunger] += 15;
				case 1520: Player[playerid][uHunger] += 20;
				case 1664: Player[playerid][uHunger] += 20;
			}
			if(Player[playerid][uHunger] > 100) Player[playerid][uHunger] = 100;
			ApplyAnimation(playerid, "VENDING", "VEND_Drink2_P", 2.0,0,0,0,0,5000,1);
			if(Player[playerid][uSettings][2] == 1) Hunger(playerid,0);
			new Float:hp;
			GetPlayerHealth(playerid,hp);
			if(hp >= 100.0) setPlayerHealth(playerid,100.0);
			else setPlayerHealth(playerid,hp + 5.0);
			format(string,sizeof(string),"пьёт %s",_itemsInfo[PlayerUseDrink[playerid]][invName]);
			MeAction(playerid,string,1);
		}
		else {
	   		SetPVarInt(playerid, "PlayerDrinking", 0);
			PlayerUseDrink[playerid] = 0;
			ClearAnimations(playerid);
			RemovePlayerAttachedObject(playerid,9);
			DeletePVar(playerid,"PlayerUseBox");
		}
	}

	//SetPVarInt(playerid, "CIGGYNIGGA", 1);
	if(PRESSED(KEY_FIRE)) {
		if(IsPlayerInAnyVehicle(playerid)) {
			if(GetPlayerState(playerid) == PLAYER_STATE_DRIVER) {
				if(!IsVelo(car)) CheckLight(playerid);
			}
		}
		else if(GetPVarInt(playerid, "CIGGYNIGGA"))
		{
		    if(GetPVarInt(playerid,"PlayerDrinkingg") != 10) {
		        SetPVarInt(playerid,"PlayerDrinkingg", GetPVarInt(playerid,"PlayerDrinkingg") + 1);
		    	SetPlayerDrunkLevel(playerid, GetPlayerDrunkLevel(playerid)+1);
		    	new Float: HealthP;
		    	GetPlayerHealth(playerid, HealthP);
		    	SetPlayerHealth(playerid, HealthP+10);
			}
			else
			{
			    SetPlayerSpecialAction(playerid, SPECIAL_ACTION_NONE);
				SetPVarInt(playerid, "CIGGYNIGGA", 0);
			    SetPVarInt(playerid, "PlayerDrinkingg", 0);
				SetPlayerDrunkLevel(playerid, 0);
				SetPVarInt(playerid, "NarkEffect", 0);
			}
			return 1;
		}
	}
	if((newkeys & KEY_ACTION) && GetPlayerState(playerid) == PLAYER_STATE_DRIVER)
	{
	    if(IsVelo(car) && SpeedVehicle(GetPlayerVehicleID(playerid)) > 10)
		{
		    new Float: slx, Float: sly, Float: slz;
		    GetPlayerPos(playerid, slx, sly, slz);
	    	SetPlayerPos(playerid, slx, sly, slz+1);
	    	GameTextForPlayer(playerid, "~r~You fell", 3000, 1);
		}
		if(!IsVelo(car)) CheckEngine(playerid);
	}
	if(PRESSED(KEY_CROUCH))
	{
	    if(IsPlayerInRangeOfPoint(playerid,10.0,1322.4750,-1624.7480,14.7460))//
	    {
	        if(doorst[19] == false)
	        {
	            if(Player[playerid][uMember] != 5) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            MoveDynamicObject(door[19], 1322.4750, -1624.7480, 18.4856, 0.8);
	        	doorst[19] = true;
	        }
	        else
	        {
	            MoveDynamicObject(door[19], 1322.4750, -1624.7480, 14.7460, 0.8);
	        	doorst[19] = false;
	        }
	    }

	    if(IsPlayerInRangeOfPoint(playerid,10.0,1322.4750, -1605.3090, 14.4460))//
	    {
	        if(doorst[20] == false)
	        {
	            if(Player[playerid][uMember] != 5) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            MoveDynamicObject(door[20], 1322.4750, -1605.3090, 18.4856, 0.8);
	        	doorst[20] = true;
	        }
	        else
	        {
	            MoveDynamicObject(door[20], 1322.4750, -1605.3090, 14.4460, 0.8);
	        	doorst[20] = false;
	        }
	    }
	    if(IsPlayerInRangeOfPoint(playerid,10.0,1322.6660, -1688.3300, 14.7460))//
	    {
	        if(doorst[21] == false)
	        {
	            if(Player[playerid][uMember] != 5) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            MoveDynamicObject(door[21], 1322.6660, -1688.3300, 18.4856, 0.8);
	        	doorst[21] = true;
	        }
	        else
	        {
	            MoveDynamicObject(door[21], 1322.6660, -1688.3300, 14.7460, 0.8);
	        	doorst[21] = false;
	        }
	    }

	    if(IsPlayerInRangeOfPoint(playerid,10.0,1322.6660, -1707.5800, 14.7160))//
	    {
	        if(doorst[22] == false)
	        {
	            if(Player[playerid][uMember] != 5) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            MoveDynamicObject(door[22], 1322.6660, -1707.5800, 18.4856, 0.8);
	        	doorst[22] = true;
	        }
	        else
	        {
	            MoveDynamicObject(door[22], 1322.6660, -1707.5800, 14.7160, 0.8);
	        	doorst[22] = false;
	        }
	    }
	    
		if(IsPlayerInAnyVehicle(playerid)) {
			if(GetPlayerState(playerid) == PLAYER_STATE_DRIVER) {
				if(IsPlayerInRangeOfPoint(playerid,5.0,1078.9844,-340.3599,73.9922)) {
					if(GetPlayerVehicleID(playerid) >= dalncars[0] && GetPlayerVehicleID(playerid) <= dalncars[1]) {
						switch(GetVehicleModel(GetPlayerVehicleID(playerid))) {
							case 498,456,499,414: {
							    if(GetPVarInt(playerid, "LoadNow")) return SendClientMessage(playerid, -1, ""gbError"Вы уже загрузились, выполните этот заказ");
								format(string,sizeof(string),"{ffffff}Введите кол-во товаров которое хотите загрузить:\n\n"cRED"| Максимальное кол-во товаров в автомобиль %d\n\n\n"gbInfo"Загружайтесь по максимуму, так как пополнить товары можно один раз\nза заказ",MAX_PRODUCTS_INCAR);
								return showPlayerDialog(playerid,d_daln + 7,1," ",string,"Далее","Закрыть");
							}
						}
					}
				}
			}
		}
		for(new i; i != MAX_GATE; i ++)
		{
		    if(IsPlayerInRangeOfPoint(playerid,15.0,G::[i][gP][0],G::[i][gP][1],G::[i][gP][2])) {
		    	if(G::[i][gJob] != 0 || Player[playerid][uMember] == 8 && Player[playerid][uMember] == 2 && Player[playerid][uMember] == 5) {
		    		if(Player[playerid][uJob] == G::[i][gJob] || Player[playerid][uMember] == 2 || Player[playerid][uMember] == 5) {
						switch(G::[i][gObject]) {
		            		case 968: MoveDynamicObject(gID[i], G::[i][gPe][0],G::[i][gPe][1],G::[i][gPe][2] + 0.05, 0.05, G::[i][gPe][3],G::[i][gPe][4],G::[i][gPe][5]);
							case 19313: MoveDynamicObject(gID[i], G::[i][gPe][0],G::[i][gPe][1],G::[i][gPe][2], 1.0, G::[i][gPe][3],G::[i][gPe][4],G::[i][gPe][5]);
							case 19912: MoveDynamicObject(gID[i], G::[i][gPe][0],G::[i][gPe][1],G::[i][gPe][2], 1.0, G::[i][gPe][3],G::[i][gPe][4],G::[i][gPe][5]);
						}
		        		gTime[i] = gettime();
		        		gStatus[i] = true;
		    		}
		    	}
		    	if(G::[i][gFrac] != 0) {
		    		if(Player[playerid][uMember] == G::[i][gFrac] || Player[playerid][uMember] == 8 || Player[playerid][uMember] == 2 || Player[playerid][uMember] == 3 || Player[playerid][uMember] == 5) {
						switch(G::[i][gObject]) {
		            		case 968: MoveDynamicObject(gID[i], G::[i][gPe][0],G::[i][gPe][1],G::[i][gPe][2] + 0.05, 0.05, G::[i][gPe][3],G::[i][gPe][4],G::[i][gPe][5]);
                            case 19313: MoveDynamicObject(gID[i], G::[i][gPe][0],G::[i][gPe][1],G::[i][gPe][2], 1.0, G::[i][gPe][3],G::[i][gPe][4],G::[i][gPe][5]);
                            case 19912: MoveDynamicObject(gID[i], G::[i][gPe][0],G::[i][gPe][1],G::[i][gPe][2], 1.0, G::[i][gPe][3],G::[i][gPe][4],G::[i][gPe][5]);
						}
		        		gTime[i] = gettime();
		        		gStatus[i] = true;
		    		}
		    	}
		        break;
		    }
		}
		
	}
	if(newkeys & KEY_JUMP && newkeys & KEY_SPRINT) 
	{
	
	    if(!IsPlayerInAnyVehicle(playerid)) {
			new index = GetPlayerAnimationIndex(playerid);
			if(index == 1224 || index == 1247 || index == 1257 || index == 1249 || index == 1196 || index == 1249) {
				new keys,ud,lr;
				GetPlayerKeys(playerid,keys,ud,lr);
				if(ud != 0 || lr != 0) ClearAnimations(playerid);
			}
		}
	}
	if(newkeys & KEY_SECONDARY_ATTACK)
	{
	    new Float: pos[3];
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1550.170,-1680.994,2493.239)) //1
	    {
	        if(doorst[0] == false)
	        {
	            if(Player[playerid][uMember] != 2) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            GetObjectPos(door[0], pos[0], pos[1], pos[2]);
	            MoveObject(door[0], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 180.0);
	            //SetObjectRot(door[0], 0.0, 0.0, 180.0);
	        	doorst[0] = true;
	        }
	        else
	        {
	            GetObjectPos(door[0], pos[0], pos[1], pos[2]);
	            MoveObject(door[0], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 90.0);
	        	doorst[0] = false;
	        }
	        
	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1534.282,-1680.824,2493.239)) //2
	    {
	        if(doorst[1] == false)
	        {
	            if(Player[playerid][uMember] != 2) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
                GetObjectPos(door[1], pos[0], pos[1], pos[2]);
	            MoveObject(door[1], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 0.0);
	        	doorst[1] = true;
	        }
	        else
	        {
	            //if(Player[playerid][uMember] != 2) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            GetObjectPos(door[1], pos[0], pos[1], pos[2]);
	            MoveObject(door[1], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 90.0);
	        	doorst[1] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1555.119,-1680.995,2493.239))//3
	    {
	        if(doorst[2] == false)
	        {
	            if(Player[playerid][uMember] != 2) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            GetObjectPos(door[2], pos[0], pos[1], pos[2]);
	            MoveObject(door[2], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 180.0);
	        	doorst[2] = true;
	        }
	        else
	        {
	            GetObjectPos(door[2], pos[0], pos[1], pos[2]);
	            MoveObject(door[2], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 90.0);
	        	doorst[2] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1557.437,-1676.021,2493.239))//4
	    {
	        if(doorst[3] == false)
	        {
	            if(Player[playerid][uMember] != 2) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            GetObjectPos(door[3], pos[0], pos[1], pos[2]);
	            MoveObject(door[3], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 90.0);
	        	doorst[3] = true;
	        }
	        else
	        {
                GetObjectPos(door[3], pos[0], pos[1], pos[2]);
	            MoveObject(door[3], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 0.0);
	        	doorst[3] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1555.086,-1666.328,2493.239))//5
	    {
	        if(doorst[4] == false)
	        {
	            if(Player[playerid][uMember] != 2) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            GetObjectPos(door[4], pos[0], pos[1], pos[2]);
	            MoveObject(door[4], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 0.0);
	        	doorst[4] = true;
	        }
	        else
	        {
	            GetObjectPos(door[4], pos[0], pos[1], pos[2]);
	            MoveObject(door[4], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, -90.0);
	        	doorst[4] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1530.215,-1654.759,2493.239))//6
	    {
	        if(doorst[5] == false)
	        {
	            if(Player[playerid][uMember] != 2) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            GetObjectPos(door[5], pos[0], pos[1], pos[2]);
	            MoveObject(door[5], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 0.0);
	        	doorst[5] = true;
	        }
	        else
	        {
	            GetObjectPos(door[5], pos[0], pos[1], pos[2]);
	            MoveObject(door[5], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 90.0);
	        	doorst[5] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1534.286,-1356.790,2493.239))//7
	    {
	        if(doorst[6] == false)
	        {
	            if(Player[playerid][uMember] != 2) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            GetObjectPos(door[6], pos[0], pos[1], pos[2]);
	            MoveObject(door[6], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 90.0);
	        	doorst[6] = true;
	        }
	        else
	        {
	            GetObjectPos(door[6], pos[0], pos[1], pos[2]);
	            MoveObject(door[6], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 0.0);
	        	doorst[6] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,411.536,-1859.046,2500.080))//8
	    {
	        if(doorst[7] == false)
	        {
	            if(Player[playerid][uMember] != 2) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            GetObjectPos(door[7], pos[0], pos[1], pos[2]);
	            MoveObject(door[7], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 0.0);
	        	doorst[7] = true;
	        }
	        else
	        {
	            GetObjectPos(door[7], pos[0], pos[1], pos[2]);
	            MoveObject(door[7], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, -90.0);
	        	doorst[7] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,-138.253,-1867.425,2500.070))//9
	    {
	        if(doorst[8] == false)
	        {
	            if(Player[playerid][uMember] != 2) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            GetObjectPos(door[8], pos[0], pos[1], pos[2]);
	            MoveObject(door[8], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 90.0);
	        	doorst[8] = true;
	        }
	        else
	        {
	            GetObjectPos(door[8], pos[0], pos[1], pos[2]);
	            MoveObject(door[8], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 0.0);
	        	doorst[8] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,-137.473,-1886.733,2500.070))//10
	    {
	        if(doorst[9] == false)
	        {
	            if(Player[playerid][uMember] != 2) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            GetObjectPos(door[9], pos[0], pos[1], pos[2]);
	            MoveObject(door[9], pos[0], pos[1], pos[2], 0.05, 0.0, 00.0, 90.0);
	        	doorst[9] = true;
	        }
	        else
	        {
	            GetObjectPos(door[9], pos[0], pos[1], pos[2]);
	            MoveObject(door[9], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 0.0);
	        	doorst[9] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,-139.173,-1854.826,3000.074))//10
	    
	    {
	        if(doorst[10] == false)
	        {
	            if(Player[playerid][uMember] != 2) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            GetObjectPos(door[10], pos[0], pos[1], pos[2]);
	            MoveObject(door[10], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 90.0);
	        	doorst[10] = true;
	        }
	        else
	        {
	            GetObjectPos(door[10], pos[0], pos[1], pos[2]);
	            MoveObject(door[10], pos[0], pos[1], pos[2], 0.05, 0.0, 00.0, 90.0);
	        	doorst[10] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,900.806,-1860.280,2500.081))//11
	    {
	        if(doorst[11] == false)
	        {
	            if(Player[playerid][uMember] != 2) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            GetObjectPos(door[11], pos[0], pos[1], pos[2]);
	            MoveObject(door[11], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 90.0);
	        	doorst[11] = true;
	        }
	        else
	        {
	            GetObjectPos(door[11], pos[0], pos[1], pos[2]);
	            MoveObject(door[11], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 0.0);
	        	doorst[11] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,900.806,-1869.752,2500.081))//12
	    {
	        if(doorst[12] == false)
	        {
	            if(Player[playerid][uMember] != 2) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
	            GetObjectPos(door[12], pos[0], pos[1], pos[2]);
	            MoveObject(door[12], pos[0], pos[1], pos[2], 0.05, 0.0, 00.0, 90.0);
	        	doorst[12] = true;
	        }
	        else
	        {
	            GetObjectPos(door[12], pos[0], pos[1], pos[2]);
	            MoveObject(door[12], pos[0], pos[1], pos[2], 0.05, 0.0, 0.0, 0.0);
	        	doorst[12] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,636.381,-577.286,1993.077))//13
	    {
	        if(doorst[13] == false)
	        {
	            if(Player[playerid][uMember] != 8) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
                GetDynamicObjectPos(door[13], pos[0], pos[1], pos[2]);
	            MoveDynamicObject(door[13], pos[0]-0.00001, pos[1], pos[2], 0.05, 0.0, 0.0, 0.0);
	        	doorst[13] = true;
	        }
	        else
	        {
	            //
	            GetDynamicObjectPos(door[13], pos[0], pos[1], pos[2]);
	            MoveDynamicObject(door[13], pos[0]+0.00001, pos[1], pos[2], 0.05, 0.0, 0.0, -90.000);
	        	doorst[13] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,617.820,-578.838,1993.077))//14
	    {
	        if(doorst[14] == false)
	        {
	            if(Player[playerid][uMember] != 8) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
                GetDynamicObjectPos(door[14], pos[0], pos[1], pos[2]);
	            MoveDynamicObject(door[14], pos[0]-0.00001, pos[1], pos[2], 0.05, 0.0, 0.0, 180.0);
	        	doorst[14] = true;
	        }
	        else
	        {
	            //
	            GetDynamicObjectPos(door[14], pos[0], pos[1], pos[2]);
	            MoveDynamicObject(door[14], pos[0]+0.00001, pos[1], pos[2], 0.05, 0.0, 0.0, 90.000);
	        	doorst[14] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,617.814,-565.997,1993.077))//15
	    {
	        if(doorst[15] == false)
	        {
	            if(Player[playerid][uMember] != 8) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
                GetDynamicObjectPos(door[15], pos[0], pos[1], pos[2]);
	            MoveDynamicObject(door[15], pos[0]-0.00001, pos[1], pos[2], 0.05, 0.0, 0.0, 0.0);
	        	doorst[15] = true;
	        }
	        else
	        {
	            //
	            GetDynamicObjectPos(door[15], pos[0], pos[1], pos[2]);
	            MoveDynamicObject(door[15], pos[0]+0.00001, pos[1], pos[2], 0.05, 0.0, 0.0, 90.000);
	        	doorst[15] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,616.888,-575.179,1993.077))//16
	    {
	        if(doorst[16] == false)
	        {
	            if(Player[playerid][uMember] != 8) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
                GetDynamicObjectPos(door[16], pos[0], pos[1], pos[2]);
	            MoveDynamicObject(door[16], pos[0]-0.00001, pos[1], pos[2], 0.05, 0.0, 0.0, 90.0);
	        	doorst[16] = true;
	        }
	        else
	        {
	            //
	            GetDynamicObjectPos(door[16], pos[0], pos[1], pos[2]);
	            MoveDynamicObject(door[16], pos[0]+0.00001, pos[1], pos[2], 0.05, 0.0, 0.0, 180.000);
	        	doorst[16] = false;
	        }

	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,640.896,-578.681,2593.076))//17
	    {
	        if(doorst[17] == false)
	        {
	            if(Player[playerid][uMember] != 8) return SendClientMessage(playerid, C_GRAY, ""gbError"У Вас нет ключа от этой двери!");
                GetDynamicObjectPos(door[17], pos[0], pos[1], pos[2]);
	            MoveDynamicObject(door[17], pos[0]-0.00001, pos[1], pos[2], 0.05, 0.0, 0.0, 90.0);
	        	doorst[17] = true;
	        }
	        else
	        {
	            //
	            GetDynamicObjectPos(door[17], pos[0], pos[1], pos[2]);
	            MoveDynamicObject(door[17], pos[0]+0.00001, pos[1], pos[2], 0.05, 0.0, 0.0, -180.000);
	        	doorst[17] = false;
	        }
	    }
	}
	if(PRESSED(KEY_WALK))
	{
	    if(IsPlayerInRangeOfPoint(playerid,2.0,-130.9097,-1867.8627,2504.7559))
	    {
	        setPlayerPos(playerid, -132.5123,-1861.1058,3001.0859);
	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,-132.5123,-1861.1058,3001.0859))
	    {
	        setPlayerPos(playerid, -130.9097,-1867.8627,2504.7559);
	    }
	    //
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1554.1320,-1661.2086,2494.2458))
	    {
	        setPlayerPos(playerid, 1541.5314,-1366.0793,2494.2458);
	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1541.5314,-1366.0793,2494.2458))
	    {
	        setPlayerPos(playerid, 1554.1320,-1661.2086,2494.2458);
	    }
	    //
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1531.0587,-1348.8101,2494.2458))
	    {
	        setPlayerPos(playerid, 1318.7401,-1499.5507,2494.2458);
	    }
		if(IsPlayerInRangeOfPoint(playerid,2.0,1318.7401,-1499.5507,2494.2458))
	    {
	        setPlayerPos(playerid, 1531.0587,-1348.8101,2494.2458);
	    }
	    //
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1538.1112,-1656.2904,2494.2458))
	    {
	        setPlayerPos(playerid, 1315.7203,-1523.1245,2494.2458);
	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1315.7203,-1523.1245,2494.2458))
	    {
	        setPlayerPos(playerid, 1538.1112,-1656.2904,2494.2458);
	    }
	    //
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1526.7980,-1660.6204,2494.2458))
	    {
	        setPlayerPos(playerid, 1299.9723,-1528.5564,2494.2458);
	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1299.9723,-1528.5564,2494.2458))
	    {
	        setPlayerPos(playerid, 1526.7980,-1660.6204,2494.2458);
	    }
		//Входы, выходы у Шерифов
		if(IsPlayerInRangeOfPoint(playerid,2.0,639.2568,-587.2856,1997.7660))
	    {
	        setPlayerPos(playerid, 643.9077,-580.9860,2594.0859);
	    }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,643.9077,-580.9860,2594.0859))
	    {
	        setPlayerPos(playerid, 639.2568,-587.2856,1997.7660);
	    }
	    
	    
	    
	    
	    

	    if(IsPlayerInRangeOfPoint(playerid,1.0,764.6592,9.3981,1000.7114) || //Гетто
  		IsPlayerInRangeOfPoint(playerid,1.0,767.9103,-29.7298,1000.5859) ||//ЛС
	    IsPlayerInRangeOfPoint(playerid,1.0,766.6108,-65.0944,1000.6563)) //Округ-Рэд
		{
		    switch(Bizz::[GetPVarInt(playerid, "PlayerBizzID")][bID])
		    {
		        case 87: showPlayerDialog(playerid,d_amoniment + 5,2,"Тренер по боксу","- Я бы хотел приобрести абонемент в данный спортзал.\n- Расскажи мне что это за спортзал?\n- Расскажи мне как изучить стиль боя Бокс?","Далее","Закрыть");
		        case 88: showPlayerDialog(playerid,d_amoniment + 2,2,"Тренер по кунг-фу","- Я бы хотел приобрести абонемент в данный спортзал.\n- Расскажи мне что это за спортзал?\n- Расскажи мне как изучить стиль боя Кунг-Фу?","Далее","Закрыть");
		        case 89: showPlayerDialog(playerid,d_amoniment + 4,2,"Тренер по кик-боксу","- Я бы хотел приобрести абонемент в данный спортзал.\n- Расскажи мне что это за спортзал?\n- Расскажи мне как изучить стиль боя Кик-Бокс?","Далее","Закрыть");
		    }
		
		}
	    for(new x; x < sizeof(GymData); x ++) {
		    if(!IsPlayerInDynamicArea(playerid, GymData[x][gymAreaID])) continue;
		    if(GetPVarInt(playerid, "StartTraining") == 1 && GetPVarInt(playerid, "StartTrainingTwo") == 1) LaunchPlayerGym(playerid, x);
		    else SendClientMessage(playerid, -1, ""gbError"Чтобы заниматься на тренажере, нужно переодеться");
		    break;
		}
        if(IsPlayerInRangeOfPoint(playerid,1.0,1585.5896,-1512.2379,13.5669)
		|| IsPlayerInRangeOfPoint(playerid,1.0,1589.7001,-1509.3075,13.5750)) {
			new Fishing[3];
			for(new j; j != 48; j++)
			{
				switch(Inv[playerid][invSlot][j])
				{
					case 481:
					{
                        Fishing[0]++;
						Inv[playerid][invSlotKol][j] = 0;
						Inv[playerid][invSlot][j] = 0;
					}
					case 482:
					{
					    Fishing[1]++;
					    Inv[playerid][invSlotKol][j] = 0;
						Inv[playerid][invSlot][j] = 0;
					}
					case 483:
					{
					    Fishing[2]++;
					    Inv[playerid][invSlotKol][j] = 0;
						Inv[playerid][invSlot][j] = 0;
					}
				}
			}
			format(string, sizeof(string), "Найдено синих рыбок - "cGREEN"%d", Fishing[0]);
			SendClientMessage(playerid, -1, string);
			format(string, sizeof(string), "Найдено цветных рыбок - "cGREEN"%d", Fishing[1]);
			SendClientMessage(playerid, -1, string);
			format(string, sizeof(string), "Найдено желтых рыбок - "cGREEN"%d", Fishing[2]);
			SendClientMessage(playerid, -1, string);
			new money = (Fishing[0]*50) + (Fishing[1]*35) + (Fishing[2]*30);
			format(string, sizeof(string), ""cBLUE"Итого - "cGREEN"%d$", money);
			SendClientMessage(playerid, -1, string);
            Player[playerid][uMoney] += money;
			mysql_format(1, string, sizeof(string),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
			mysql_tquery(1, string, "", "");
        }
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1053.9259,684.9886,4924.6525)) {
	        for(new i; i != cBizz; i ++ ) {
	            if(IsPlayerInRangeOfPoint(playerid,50.0,Bizz::[i][bEnter][4],Bizz::[i][bEnter][5],Bizz::[i][bEnter][6]) && GetPlayerVirtualWorld(playerid) == Bizz::[i][bID]) {
					SetPVarInt(playerid,"PlayerBizzID",i);
					new str[128],del;
					if(Bizz::[i][bUpdate][1] == 0) del = 2;
					else del = 1;
					switch(Bizz::[i][bID]) {
					    case 35: {
					        string = "";
					        for(new s; s != 38 / del; s ++) {
					            format(str,sizeof(str),"{ffffff}%i. %s - "cGREEN"$%d\n",s + 1,CarNames[Salon1[s][0] - 400],Salon1[s][1]);
					            strcat(string,str);
					        }
					        SetPVarInt(playerid, "SALONID", 1);

                            showPlayerDialog(playerid, d_salon, 2, " ", string, "Далее", "Закрыть");

					    }
					    case 36: {
					    	string = "";
					        for(new s; s != 38 / del; s ++) {
					            format(str,sizeof(str),"{ffffff}%i. %s - "cGREEN"$%d\n",s + 1,CarNames[Salon2[s][0] - 400],Salon2[s][1]);
					            strcat(string,str);
					        }
					        SetPVarInt(playerid, "SALONID", 2);
                            showPlayerDialog(playerid, d_salon, 2, " ", string, "Далее", "Закрыть");
					    }
					    case 75: {
					        string = "";
					        for(new s; s != 12 / del; s ++) {
					            format(str,sizeof(str),"{ffffff}%i. %s - "cGREEN"$%d\n",s + 1,CarNames[Salon3[s][0] - 400],Salon3[s][1]);
					            strcat(string,str);
					        }
					        SetPVarInt(playerid, "SALONID", 3);
                            showPlayerDialog(playerid, d_salon, 2, " ", string, "Далее", "Закрыть");
					    }
					}
					break;
				}
	        }

	    }
	
		//s == 277 || s == 278 || s == 279
		
		if(IsPlayerInRangeOfPoint(playerid, 2.0, 754.4679,-40.2419,1000.5926)
		|| IsPlayerInRangeOfPoint(playerid, 2.0, 756.2339,5.8996,1000.6987)
		|| IsPlayerInRangeOfPoint(playerid, 2.0, 759.4854,-77.9573,1000.6523)) {
		    //SetPVarInt(playerid, "StartTraining", 0)
		    if(GetPVarInt(playerid, "StartTraining") == 0) return 1;
		    if(GetPVarInt(playerid, "PlayerMenuShow") != 0) return 1;
		    
		    switch(Bizz::[GetPVarInt(playerid, "PlayerBizzID")][bID])
		    {
		        case 87: if(Player[playerid][uStyleDate][0] < getdate()) return SendClientMessage(playerid, -1, ""gbError"Ваш абонемент для данного спортзала просрочен или его нет.");
		        case 88: if(Player[playerid][uStyleDate][1] < getdate()) return SendClientMessage(playerid, -1, ""gbError"Ваш абонемент для данного спортзала просрочен или его нет.");
		        case 89: if(Player[playerid][uStyleDate][2] < getdate()) return SendClientMessage(playerid, -1, ""gbError"Ваш абонемент для данного спортзала просрочен или его нет.");
		    }
		    

		    
		    
		    new s = GetPlayerSkin(playerid);
			if(s == 96 || s == 80 || s == 81 || s == 203 || s == 204 || s == 190 || s == 298)
			{
                switch(Player[playerid][uMember]) {
	    			case 1,2:
	    			{
						if(Player[playerid][uIsPlayerJob][0] == 1) GetBackSkinWork(playerid);
						else GetBackSkin(playerid);
	    			}
	    			case 3:
					{
						if(Player[playerid][uIsPlayerJob][1] == 1) GetBackSkinWork(playerid);
						else GetBackSkin(playerid);
					}
	    			case 5:
	    			{
					 	if(Player[playerid][uIsPlayerJob][2] == 1) GetBackSkinWork(playerid);
					 	else GetBackSkin(playerid);
					}
					case 4: GetBackSkin(playerid);
					default: { GetBackSkin(playerid); }
				}
				SendClientMessage(playerid,C_GRAY,""gbAccess"Вы вернули свою повседневную одежду.");
			}
			else {
				for(new i; i < 12; i++)
				{
					if(GYMSkins[0][i] == 0) continue;
				  	PlayerTextDrawSetPreviewModel(playerid, NewSkinSelect[i][playerid], GYMSkins[0][i]);
					PlayerTextDrawShow(playerid, NewSkinSelect[i][playerid]);
				}
				PlayerTextDrawShow(playerid, NewSkinSelect[12][playerid]);
				SelectTextDraw(playerid, 0xd3d3d3FF);
				SetPVarInt(playerid, "PlayerMenuShow",9);
				SetPVarInt(playerid, "GuperOnSelect", 2);
				showPlayerDialog(playerid,9999,0," ","{ffffff}Нажмите кнопку "cGREEN"ESC {ffffff}чтобы закрыть меню.","Закрыть","");
	            //------------------------------------------------------------------------

			}
		}
		

		if(IsPlayerInRangeOfPoint(playerid,2.0,-529.7124,-76.6541,2773.8778)) {
		    if(GetPVarInt(playerid,"PlayerMenuShow") != 0) return 1;
		    if(D::[playerid][dWoodsDuty] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"Вы не подрабатываете на лесопилке");
		    new s = GetPlayerSkin(playerid);
			if(s == 16 || s == 27 || s == 260 || s == 13 || s == 56 || s == 131) GetBackSkin(playerid),SendClientMessage(playerid,C_GRAY,""gbAccess"Вы вернули рабочую одежду выданную вам обратно.");
			else {
				switch(Player[playerid][uSex]) {
					case 1: {
      					PlayerTextDrawSetPreviewModel(playerid, FermSelectSkin[0][playerid], 16);
                        PlayerTextDrawSetPreviewModel(playerid, FermSelectSkin[1][playerid], 27);
                        PlayerTextDrawSetPreviewModel(playerid, FermSelectSkin[2][playerid], 260);
					}
					case 2: {
				    	PlayerTextDrawSetPreviewModel(playerid, FermSelectSkin[0][playerid], 13);
                        PlayerTextDrawSetPreviewModel(playerid, FermSelectSkin[1][playerid], 56);
         				PlayerTextDrawSetPreviewModel(playerid, FermSelectSkin[2][playerid], 198);
					}
				}
		    	TextDrawShowForPlayer(playerid, FermFon[0]);
		    	TextDrawShowForPlayer(playerid, FermFon[1]);
				PlayerTextDrawShow(playerid, FermSelectSkin[0][playerid]);
				PlayerTextDrawShow(playerid, FermSelectSkin[1][playerid]);
				PlayerTextDrawShow(playerid, FermSelectSkin[2][playerid]);
				SelectTextDraw(playerid,0xd3d3d3FF);
				SetPVarInt(playerid,"PlayerMenuShow",2);
				return showPlayerDialog(playerid,9999,0," ","{ffffff}Нажмите кнопку "cGREEN"ESC {ffffff}чтобы закрыть меню.","Закрыть","");
			}
		}
		if(IsPlayerInRangeOfPoint(playerid,2.0,1037.1237,-305.9707,76.6459)) {
		    if(Player[playerid][uJob] != 3 && D::[playerid][dBusDuty] == false) return SendClientMessage(playerid,C_GRAY,""gbError"Вы не работаете водителем в транспортной компании.");
		    if(GetPVarInt(playerid,"PlayerMenuShow") != 0) return SendClientMessage(playerid,C_GRAY,""gbError"У вас открыто какое-то из меню, закройте его и поробуйте ещё раз.");
			SetPVarInt(playerid,"PlayerSelectTrailer",0);
			SetPVarInt(playerid,"PlayerMenuShow",3);
		    
			for(new i; i != 9; i ++) 
			{
				if( i == 5 )
					continue; 
					
				TextDrawShowForPlayer(playerid, dalnmenu[i]);
		    }
			PlayerTextDrawShow(playerid,dalnmenuplayer[playerid]);
		    PlayerTextDrawSetString(playerid,dalnmenuplayer[playerid],"~y~Щёлкните на любой из~n~прицепов.");
		    SelectTextDraw(playerid,0xd3d3d3FF);
		    return showPlayerDialog(playerid,9999,0," ","{ffffff}Нажмите кнопку "cGREEN"ESC {ffffff}чтобы закрыть меню.","Закрыть","");
		}
		if( IsPlayerInRangeOfPoint( playerid,2.0,1527.8334,-1680.4747,2494.2458 ) 
			|| IsPlayerInRangeOfPoint( playerid,2.0,-134.1429,-1888.1531,2501.0859 ) 
			|| IsPlayerInRangeOfPoint( playerid,2.0,908.4117,-1855.7367,2501.0859 ) 
			|| IsPlayerInRangeOfPoint( playerid,2.0,404.3445,-1866.0304,2501.0859 ) )
		{
		    if( Player[playerid][uMember] != 2 ) 
				return 1;
				
		    if(Player[playerid][uIsPlayerJob][0] == 0) 
			{
				showPlayerDialog(playerid,d_police,0," ","\
					"gbInfo"Заступление на дежурство.\n\n\
					Вы желаете заступить на дежурство?",
					"Да","Нет"
				);
			}
		    else 
			{
				showPlayerDialog(playerid,d_police,0," ","\
					"gbInfo"Покинуть дежурство.\n\n\
					Вы желаете покинуть дежурство?",
					"Да","Нет"
				);
			}
		}
		
		if(IsPlayerInRangeOfPoint(playerid,2.0,1160.5388,-1311.7430,2804.5148)) {
			if(Player[playerid][uMember] != 3) return 1;
			showPlayerDialog(playerid, d_enterfrac + 4, 2, " ", "1. "cGRAY"Заступить на дежурство{ffffff}\n2. "cGRAY"Покинуть дежурство", "Далее", "Закрыть");
			return 1;
			//return showPlayerDialog(playerid,d_medical,2," ","1. "cGRAY"Заступить на дежурство{ffffff}\n2. "cGRAY"Уйти с дежурства","Далее","Закрыть");
		}
		if(IsPlayerInRangeOfPoint(playerid,1.0,1540.0371,-1679.9851,2494.2458)) {
			if(Player[playerid][uTicket]) format(string, sizeof(string), ""gbInfo"У вас есть неоплаченый штраф в размере %d$\n\nЖелаете его оплатить ?", Player[playerid][uTicketPay]);
			else format(string, sizeof(string), ""gbAccess"У вас нет неоплаченых штрафов!");
			return showPlayerDialog(playerid,d_police + 8,0," ",string,"Да","Нет");
		}
		
		if(IsPlayerInRangeOfPoint(playerid,1.0,1544.2462,-1679.9846,2494.2458)) {
		    return showPlayerDialog(playerid,d_police + 2,1," ","{ffffff}Введите в окошко номер своего транспорта:\n\n"cRED"| Номер транспорта может состоять только из цифр.\n| Если транспорт принадлежит не вам, оформелние номера будет недоступно.","Да","Нет");
		}
		if(IsPlayerInRangeOfPoint(playerid,2.0,1485.1050,-1745.8037,3910.4715)) {
            new bool:cuff = false;
	    	for(new i; i != 48; i++) {
				if(Inv[playerid][invSlot][i] == 452) cuff = true;
			}
			if(cuff == true) return SendClientMessage(playerid,C_GRAY,""gbError"У вас уже есть документы подтверждающие вашу личность!");
		    return showPlayerDialog(playerid,d_meria + 9,2,"Получение паспорта","{ffffff}Вы хотите получить документы подтверждающие вашу личность?","Да","Нет");
		}
		if(IsPlayerInRangeOfPoint(playerid,2.0,1670.8842,-1646.3506,4698.9738)) {
			if(cAdvert >= MAX_ADVERT_INFO) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но в данный момент подано слишком много объявлений!");
			if(Player[playerid][uNumber] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но вы должны иметь номер телефона для подачи объявления!");
			return showPlayerDialog(playerid,d_cnn,0," ","{ffffff}Вы хотите подать объявление?","Да","Нет");
		}
		if(IsPlayerInRangeOfPoint(playerid,2.0,1196.6157,1341.1388,1501.6559)) {
			return showPlayerDialog(playerid,d_licenses,2,"Какую лицензию вы желаете купить?","{ffffff}1.  "cGRAY"На управление наземным ТС -"cGREEN" $600\n{ffffff}2.  "cGRAY"На управление водным ТС -"cGREEN" $2000\n{ffffff}3.  "cGRAY"На управление воздушным ТС -"cGREEN" $4000","Далее","Закрыть");
		}

		if(IsPlayerInRangeOfPoint(playerid,2.0,2517.6382,-1542.6737,24.0029)
		|| IsPlayerInRangeOfPoint(playerid,2.0,595.0700,-1504.2452,15.2091)
		|| IsPlayerInRangeOfPoint(playerid,2.0,1362.3319,199.9982,19.7168)) {
			return showPlayerDialog(playerid,d_repair+2,1," ","{ffffff}Введите в окошко номер своего транспорта:\n\n"cRED"| Номер транспорта может состоять только из цифр.\n| Если транспорт принадлежит не вам, покупка дубликата будет невозможна.","Далее","Закрыть");
		}


		if(IsPlayerInRangeOfPoint(playerid,2.0,-526.3150,-70.5220,2773.8861)) return showPlayerDialog(playerid,d_woods,2,"Лесопилка","1. "cGRAY"Устроиться на работу лесоруба{ffffff}\n2. "cGRAY"Устроиться на подработку в цеху{ffffff}\n3. "cGRAY"Уволиться с работы{ffffff}\n4. "cGRAY"Информация о работе","Далее","Закрыть");
		if(IsPlayerInRangeOfPoint(playerid,2.0,2127.6643,-2275.2849,20.6719)) return showPlayerDialog(playerid,d_daln,2,"Транспортная компания","1. "cGRAY"Начать/Закончить рабочий день{ffffff}\n2. "cGRAY"Ознакомиться с работой{ffffff}\n3. "cGRAY"Устроиться на работу{ffffff}\n4. "cGRAY"Уволиться с работы","Выбрать","Закрыть");
		if(IsPlayerInRangeOfPoint(playerid,2.0,1794.1667,-1763.4535,2513.5859)) return showPlayerDialog(playerid,d_bus,2,"Автостанция","1. "cGRAY"Устроиться на работу водителя автобуса{ffffff}\n2. "cGRAY"Уволиться с работы водителя автобуса{ffffff}\n3. "cGRAY"Начать/закончить рабочий день{ffffff}\n4. "cGRAY"Информация о работе","Далее","Закрыть");
	    if(IsPlayerInRangeOfPoint(playerid,2.0,1126.71, -1226.29, 3905.34)) return showPlayerDialog(playerid,d_taxi,2,"Таксопарк","1. "cGRAY"Начать/Закончить рабочий день{ffffff}\n2. "cGRAY"Ознакомиться с работой{ffffff}\n3. "cGRAY"Устроиться на работу{ffffff}\n4. "cGRAY"Уволиться с работы","Выбрать","Закрыть");

		for(new i; i != cBizz; i++)
		{
			if(IsPlayerInRangeOfPoint(playerid,1.0,Bizz::[i][bEnter][0],Bizz::[i][bEnter][1],Bizz::[i][bEnter][2]))
			{
				if(Bizz::[i][bSettings][4] == 1) return SendClientMessage(playerid,C_GRAY,""gbError"В этом бизнесе закрыта входная дверь.");
				if(Bizz::[i][bSettings][7] == 12)
				{
					switch(Bizz::[i][bID])
					{
					    case 87: SetPlayerFightingStyle(playerid, FIGHT_STYLE_BOXING);
						case 88: SetPlayerFightingStyle(playerid, FIGHT_STYLE_KUNGFU);
						case 89: SetPlayerFightingStyle(playerid, FIGHT_STYLE_KNEEHEAD);
						
					}
					SetPVarInt(playerid, "StartTraining", 1);
				}
				setPlayerPos(playerid,Bizz::[i][bEnter][4],Bizz::[i][bEnter][5],Bizz::[i][bEnter][6]);
				SetPlayerInterior(playerid,Bizz::[i][bSettings][1]);
			    SetPlayerVirtualWorld(playerid,Bizz::[i][bID]);
			    spawnFreezeTime(playerid);
				SetPVarInt(playerid,"PlayerBizzID",i);
				SetPlayerTime(playerid, 88, 0);
				break;
			}
			else if(IsPlayerInRangeOfPoint(playerid,1.0,Bizz::[i][bEnter][4],Bizz::[i][bEnter][5],Bizz::[i][bEnter][6]) && GetPlayerVirtualWorld(playerid) == Bizz::[i][bID]) {
				if(Bizz::[i][bSettings][4] == 1) return SendClientMessage(playerid,C_GRAY,""gbError"В этом бизнесе закрыта входная дверь.");
				if(Bizz::[i][bSettings][7] == 12)
				{
				    new s = GetPlayerSkin(playerid);
					if(s == 96 || s == 80 || s == 81 || s == 203 || s == 204 || s == 190 || s == 298) GetBackSkin(playerid), SendClientMessage(playerid,C_GRAY,""gbAccess"Вы покинули спортзал, вам возвращена повседневная одежда");
					SetPVarInt(playerid, "StartTraining", 0), SetPVarInt(playerid, "StartTrainingTwo", 0), SetPlayerFightingStyle(playerid, FIGHT_STYLE_NORMAL);
				}
				setPlayerPos(playerid,Bizz::[i][bEnter][0],Bizz::[i][bEnter][1],Bizz::[i][bEnter][2]);
				SetPlayerInterior(playerid,0);
			    SetPlayerVirtualWorld(playerid,0);
			    SetPlayerTime(playerid, ghour+3, 0);
				break;
			}
		}
		for(new i; i != MAX_OBJECTS_DROP; i ++) {
		    if(_objectInfo[i][objDrop][0] == 0) continue;
		    if(IsPlayerInRangeOfPoint(playerid, 1.0,_objectInfo[i][objPos][0],_objectInfo[i][objPos][1],_objectInfo[i][objPos][2])) {
		        new Float:kg;
		        for(new g; g != 56; g++) kg += _itemsInfo[Inv[playerid][invSlot][g]][invKg];
				if(kg + _itemsInfo[_objectInfo[i][objDrop][0]][invKg] > MAX_PLAYER_KG + Player[playerid][uJobDouble][6]) return SendClientMessage(playerid,C_GRAY,""gbError"Вы уже и так много несёте с собой!");
				if(BoxUse[i] == 1 && _objectInfo[i][objDrop][0] == 469) {
					if(GetPVarInt(playerid, "PutBoomboxID") != i + 1) return SendClientMessage(playerid,C_GRAY,""gbError"Вам не пренадлежит этот BoomBox!");
	                else
					{
					    foreach(new j: Player)
					    {
					        if(!GetPVarInt(j, "uLogin")) continue;
							if(IsPlayerInDynamicArea(j, GetPVarInt(playerid, "BBArea"))) StopAudioStreamForPlayer(j);
						}
						SetPVarInt(playerid, "PutBoombox", 0);
						DeletePVar(playerid, "BBArea");
						DeletePVar(playerid, "BBX"); DeletePVar(playerid, "BBY"); DeletePVar(playerid, "BBZ");
						DeletePVar(playerid, "BBStation");
						DeletePVar(playerid, "PutBoomboxID");
						DeletePVar(playerid, "PutBoombox");
						BoxUse[i] = 0;
					}
				}
				DestroyDynamicObject(_objectInfo[i][objObject]);
                GivePlayerItem(playerid, _objectInfo[i][objDrop][0], _objectInfo[i][objDrop][1]);
				
                if (IsValidDynamic3DTextLabel(_objectInfo[i][objText]))
				{
                	DestroyDynamic3DTextLabel(_objectInfo[i][objText]);
					_objectInfo[i][objText] = Text3D: INVALID_3DTEXT_ID;
				}
				
                _objectInfo[i][objDrop][0] = 0;
	            _objectInfo[i][objDrop][1] = 0;
	            _objectInfo[i][objPos][0] = 0.0;
	            _objectInfo[i][objPos][1] = 0.0;
	            _objectInfo[i][objPos][2] = 0.0;
				break;
		    }
		}
		if(GetPVarInt(playerid, "ObjectFireStatus") >= 1)
		{
		    if(IsPlayerInRangeOfPoint(playerid, 5.0, GetPVarFloat(playerid, "ObjectFireX"), GetPVarFloat(playerid, "ObjectFireY"), GetPVarFloat(playerid, "ObjectFireZ"))) {
		        DestroyDynamicObject(GetPVarInt(playerid, "ObjectFireOne"));
			    DestroyDynamicObject(GetPVarInt(playerid, "ObjectFireTwo"));
			    DeletePVar(playerid, "ObjectFireOne");
			    DeletePVar(playerid, "ObjectFireTwo");
			    DeletePVar(playerid, "ObjectFireStatus");
			    DeletePVar(playerid, "ObjectFireX");
			    DeletePVar(playerid, "ObjectFireY");
			    DeletePVar(playerid, "ObjectFireZ");
			    SendClientMessage(playerid, -1, ""gbAccess"Вы успешно потушили свой кастер");
		    }
		}
		
		foreach(new i : Player)
		{
			if(Border::[i][bStatus] == false) continue;
			if(IsPlayerInRangeOfPoint(playerid, 3.0, Border::[i][bP][0], Border::[i][bP][1], Border::[i][bP][2]))
			{
			    if(Border::[i][bMember] != Player[playerid][uMember]) return 1;
				switch(Border::[i][bObject])
				{
					case 2899: GivePlayerItem(playerid,436,1);
					case 1237: GivePlayerItem(playerid,438,1);
					case 1423: GivePlayerItem(playerid,439,1);
					case 1425: GivePlayerItem(playerid,440,1);
					case 1459: GivePlayerItem(playerid,441,1);
					case 1481: GivePlayerItem(playerid,471,1);
					case 1255: GivePlayerItem(playerid,478,1);
					case 1646: GivePlayerItem(playerid,479,1);
				}
				DestroyDynamicObject(Border::[i][bObjects]);
				Border::[i][bP][0] = 0.0;
				Border::[i][bP][1] = 0.0;
				Border::[i][bP][2] = 0.0;
				Border::[i][bStatus] = false;
				Border::[i][bMember] = 0;
				break;
			}
		}
	}
	return 1;
}

public OnPlayerClickPlayerTextDraw(playerid, PlayerText:playertextid) {
    clear_massive();
	if(playertextid == FermSelectSkin[0][playerid])
	{
		if(D::[playerid][dWoodsDuty] != 0) {
		    switch(Player[playerid][uSex]) {
		        case 1: SetPlayerSkin(playerid,16);
		        case 2: SetPlayerSkin(playerid,13);
		    }
		    if(D::[playerid][dWoodsDuty] == 1) {
		    	SetPlayerAttachedObject(playerid,9,341,6);
				SetPVarInt(playerid,"PlayerUseBox",4);
				return SendClientMessage(playerid,C_GRAY,""gbInfo"Подойдите к одному из деревьев и начните спиливать его.");
			}
		    if(D::[playerid][dWoodsDuty] == 2) return SendClientMessage(playerid,C_GRAY,""gbInfo"Идите в цех и начните перерабатывать древесину.");
		}
		if(Player[playerid][uMember] == 3)
		{
		    switch(Player[playerid][uSex]) {
		        case 1: SetPlayerSkin(playerid, 277);
			}
			SetPlayerAttachedObject(playerid,4,19472,2,0.000000,0.159999,0.001999,88.099952,84.499992,2.000000,1.000000,1.000000,1.000000);
			SetPlayerAttachedObject(playerid,5,1008,1,0.000000,-0.093000,0.000000,-93.800010,-179.000000,1.499997,1.000000,1.000000,1.000000);

		}
	}

	if(playertextid == FermSelectSkin[1][playerid]) {
		if(D::[playerid][dWoodsDuty] != 0) {
		    switch(Player[playerid][uSex]) {
		        case 1: SetPlayerSkin(playerid,27);
		        case 2: SetPlayerSkin(playerid,56);
		    }
		    if(D::[playerid][dWoodsDuty] == 1) {
		    	SetPlayerAttachedObject(playerid,9,341,6);
				SetPVarInt(playerid,"PlayerUseBox",4);
				return SendClientMessage(playerid,C_GRAY,""gbInfo"Подойдите к одному из деревьев и начните спиливать его.");
			}
		    if(D::[playerid][dWoodsDuty] == 2) return SendClientMessage(playerid,C_GRAY,""gbInfo"Идите в цех и начните перерабатывать древесину.");
		}
		if(Player[playerid][uMember] == 3)
		{
		    switch(Player[playerid][uSex]) {
		        case 1: SetPlayerSkin(playerid, 278);
			}
			SetPlayerAttachedObject(playerid,4,19472,2,-0.016000,0.146999,-0.003999,94.600013,99.900039,-4.199994,1.000000,1.000000,1.000000);
			SetPlayerAttachedObject(playerid,5,1008,1,0.040999,-0.114999,0.000000,105.599998,0.000000,-177.499954,1.000000,1.000000,1.000000);

		}
	}
	
	if(GetPVarInt(playerid, "GuperOnSelect") == 1) {
		callPrisonSkin( playerid, playertextid );
	}    
	if(GetPVarInt(playerid, "GuperOnSelect") == 2)
	{
	    for(new i; i < 12; i++)
	    {
            if(GYMSkins[0][i] == 0) continue;
	        if(playertextid == NewSkinSelect[i][playerid])
	        {
	            if(i == 5 || i == 6) { if(Player[playerid][uSex] == 1) return SendClientMessage(playerid, -1, ""gbError"Данная одежда для Вас недоступна"); }

	            SetPlayerSkin(playerid, GYMSkins[0][i]);
	            SetPVarInt(playerid, "StartTrainingTwo", 1);
	            break;
	        }
	    }
	}
	if( getData( playerid, "GuperOnSelect" ) == 8 ) callSasdSkin( playerid, playertextid );
// Vovanm93
	if( getData( playerid, "GuperOnSelect" ) == 3 ) {
		for( new i; i < 12; i++ ) {
			if( playertextid == NewSkinSelect[i][playerid] ) {
				if( Player[playerid][uSex] == 1 ) {
					SetPlayerSkin( playerid, MedicalSkinList[i] );
					Player[playerid][uJobSkin] = MedicalSkinList[i];
				}
				else {
					SetPlayerSkin( playerid, MedicalSkinListMale[i] );
					Player[playerid][uJobSkin] = MedicalSkinListMale[i];
				}
				format:gb_string( "%s", Player[playerid][uSex] == 1 ? ("переоделся"):("переоделась") );
				MeAction( playerid, gb_string, 1 );
				
				Player[playerid][uIsPlayerJob][1] = 1;
				userUpdate( playerid, "uJobSkin", Player[playerid][uJobSkin] );
    			if( getData( playerid, "PlayerColor") == 1 ) SetPlayerColor( playerid, FracColor[0] );
				else SetPlayerColor( playerid, FracColor[ Player[playerid][uMember] ] );
				
				SendClientMessage( playerid,C_GRAY,""gbAccess"Вы успешно вышли на дежурство.");
				break;
			}
		}
	}
	
	if( getData( playerid, "GuperOnSelect" ) == 5 ) {
		for( new i; i < 12; i++ ) {
			if( playertextid == NewSkinSelect[i][playerid] ) {
				if( Player[playerid][uSex] == 1 ) {
					SetPlayerSkin( playerid, police_skin_male[i] );
					Player[playerid][uJobSkin] = police_skin_male[i];
				}
				else {
					SetPlayerSkin( playerid, police_skin_female[i] );
					Player[playerid][uJobSkin] = police_skin_female[i];
				}
				
				format:gb_string( "%s", Player[playerid][uSex] == 1 ? ("переоделся"):("переоделась") );
				MeAction( playerid, gb_string, 1 );
				Player[playerid][uIsPlayerJob][0] = 1;
				UpdatePlayerJob( playerid );
				userUpdate( playerid, "uJobSkin", Player[playerid][uJobSkin] );
    			if( getData( playerid, "PlayerColor") == 1 ) SetPlayerColor( playerid, FracColor[0] );
				else SetPlayerColor( playerid, FracColor[ Player[playerid][uMember] ] );
				break;
			}
		}
	}
//-----------------------------------	
	if(playertextid == FermSelectSkin[2][playerid]) {
		if(D::[playerid][dWoodsDuty] != 0) {
		    switch(Player[playerid][uSex]) {
		        case 1: SetPlayerSkin(playerid,260);
		        case 2: SetPlayerSkin(playerid,131);
		    }
		    if(D::[playerid][dWoodsDuty] == 1) {
		    	SetPlayerAttachedObject(playerid,9,341,6);
				SetPVarInt(playerid,"PlayerUseBox",4);
				return SendClientMessage(playerid,C_GRAY,""gbInfo"Подойдите к одному из деревьев и начните спиливать его.");
			}
		    if(D::[playerid][dWoodsDuty] == 2) return SendClientMessage(playerid,C_GRAY,""gbInfo"Идите в цех и начните перерабатывать древесину.");
		}
		if(Player[playerid][uMember] == 3)
		{
		    switch(Player[playerid][uSex]) {
		        case 1: SetPlayerSkin(playerid, 279);
			}
			SetPlayerAttachedObject(playerid,4,19472,2,-0.025000,0.157000,0.000999,-2.499999,89.799911,90.799964,1.212000,1.106000,1.231000);
			SetPlayerAttachedObject(playerid,5,1008,1,0.024000,-0.110999,0.000000,-90.500007,-179.199951,0.700001,1.000000,1.000000,1.000000);

		}
	}
	for(new i = 0; i < 16; i++) {
		if(playertextid != buyingShopItems[i][playerid]) continue;
		if(playertextid == buyingShopItems[i][playerid]) {
			SetPVarInt(playerid,"playerSelectBuyingSlot",i);
			new Float:kg,string[256];
    		for(new k; k != 56; k++) kg += _itemsInfo[Inv[playerid][invSlot][k]][invKg];
			switch(GetPVarInt(playerid,"UseSlots"))
			{
				case 3:
				{
					if(kg + _itemsInfo[Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")]][invKg] > MAX_PLAYER_KG + Player[playerid][uJobDouble][6]) return SendClientMessage(playerid,C_GRAY,""gbError"Вы уже и так много несёте с собой!");
					if(IsPlayerInRangeOfPoint(playerid,3.0,203.8694,-43.2627,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,207.0882,-129.1814,1003.5078) ||
	    			IsPlayerInRangeOfPoint(playerid,3.0,161.4221,-83.2581,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,206.3741,-8.1361,1001.2109) ||
	    			IsPlayerInRangeOfPoint(playerid,3.0,204.3264,-159.3523,1000.5234) || IsPlayerInRangeOfPoint(playerid,3.0,207.6243,-100.3268,1005.2578) ||
	    			IsPlayerInRangeOfPoint(playerid,3.0,210.1204,-102.2575,1005.2578) || IsPlayerInRangeOfPoint(playerid,3.0,210.5399,-34.1924,1001.9297) || IsPlayerInRangeOfPoint(playerid,3.0,206.9977,-135.6739,1002.8744) ||
	    			IsPlayerInRangeOfPoint(playerid,3.0,150.9207,-75.5895,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,211.3265,-9.5800,1001.2109) || IsPlayerInRangeOfPoint(playerid,3.0,198.8070,-157.5421,1000.5234) ||
	    			IsPlayerInRangeOfPoint(playerid,3.0,205.2868,-102.2578,1005.2578) || IsPlayerInRangeOfPoint(playerid,3.0,208.5928,-33.9872,1001.9297) || IsPlayerInRangeOfPoint(playerid,3.0,209.9369,-135.1686,1002.8672) ||
	    			IsPlayerInRangeOfPoint(playerid,3.0,149.3744,-78.7390,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,208.4021,-7.5041,1001.2109) || IsPlayerInRangeOfPoint(playerid,3.0,198.6052,-166.8229,1000.5234) ||
	    			IsPlayerInRangeOfPoint(playerid,3.0,212.4442,-96.4369,1005.2578) || IsPlayerInRangeOfPoint(playerid,3.0,197.3729,-40.3967,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,199.3410,-138.7777,1003.5078) ||
	    			IsPlayerInRangeOfPoint(playerid,3.0,147.4459,-72.5470,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,226.1939,-11.2933,1002.2109) || IsPlayerInRangeOfPoint(playerid,3.0,202.4432,-166.7652,1000.5234) ||
	    			IsPlayerInRangeOfPoint(playerid,3.0,205.0045,-96.9579,1005.2578) || IsPlayerInRangeOfPoint(playerid,3.0,210.7852,-44.9170,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,215.7504,-137.4998,1003.5078) ||
	    			IsPlayerInRangeOfPoint(playerid,3.0,166.4640,-80.5297,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,226.2144,-5.1318,1002.2109) || IsPlayerInRangeOfPoint(playerid,3.0,210.0818,-166.7970,1000.5234) ||
	    			IsPlayerInRangeOfPoint(playerid,3.0,202.5804,-96.4468,1005.2578) || IsPlayerInRangeOfPoint(playerid,3.0,197.3730,-48.3824,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,216.1559,-132.9930,1003.5078) ||
	    			IsPlayerInRangeOfPoint(playerid,3.0,156.3242,-80.4837,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,215.5925,-9.6650,1001.2109) || IsPlayerInRangeOfPoint(playerid,3.0,206.6252,-166.7522,1000.5306)) {
	    				format(string,sizeof(string),"{ffffff}| Информация о товаре:"cGRAY"\n\nНазвание - %s\nЦена - "cGREEN"$%d",
						_itemsInfo[PlayerBuyingItemsShop[playerid][GetPVarInt(playerid,"playerSelectBuyingSlot")]][invName],
						PlayerBuyingItemsShopProd[playerid][GetPVarInt(playerid,"playerSelectBuyingSlot")] * Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bSettings][5]);
						return showPlayerDialog(playerid,d_bizz + 9,0," ",string,"Купить","Закрыть");
					}
					format(string,sizeof(string),"{ffffff}| Информация о товаре:"cGRAY"\n\nНазвание - %s\nЦена - "cGREEN"$%d",
					_itemsInfo[Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][GetPVarInt(playerid,"playerSelectBuyingSlot")]][invName],
					Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bProdItems][GetPVarInt(playerid,"playerSelectBuyingSlot")] * Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bSettings][5]);
					showPlayerDialog(playerid,d_bizz + 8,0," ",string,"Купить","Закрыть");
				}
				case 4:
				{
					if(Player[playerid][uRank] < F::[Player[playerid][uMember]][fGuns][GetPVarInt(playerid,"playerSelectBuyingSlot")]) return SendClientMessage(playerid,C_GRAY,""gbError"У вас нет доступа к данному оружию!");
					new countguns = 0;
					for(new inv; inv != 56; inv ++) {
						switch(_itemsInfo[Inv[playerid][invSlot][inv]][invID]) {
    						case 65 .. 70, 97: countguns ++;
    					}
					}
					if(countguns >= 3) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас уже достаточно оружия в инвентаре.");

				   	if(kg + _itemsInfo[FracGuns[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")]][invKg] > MAX_PLAYER_KG + Player[playerid][uJobDouble][6]) return SendClientMessage(playerid,C_GRAY,""gbError"Вы уже и так много несёте с собой!");
					switch(FracGuns[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")])
					{
					    case 426: GivePlayerItem(playerid, FracGuns[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")], FracMaterials[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")]);
					    case 458: GivePlayerItem(playerid, FracGuns[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")], FracMaterials[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")]-230);
					    case 428: GivePlayerItem(playerid, FracGuns[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")], FracMaterials[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")]);
					    case 429: GivePlayerItem(playerid, FracGuns[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")], FracMaterials[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")]);
					    case 430: GivePlayerItem(playerid, FracGuns[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")], FracMaterials[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")]);
					    case 431: GivePlayerItem(playerid, FracGuns[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")], FracMaterials[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")]);
					}
					SendClientMessage(playerid,C_GRAY,""gbAccess"Вы взяли служебное оружие из оружейной!");
				}
				case 8: {/****/
				    GivePlayerItem( playerid, 406, 1 );
				}
				case 9: {
					if( Player[playerid][uMember] ) sadoc_eat = { 406, 407, 408, 409 };
	        		else sadoc_eat = { 407, 408, 0, 0 };
					if( i < 4 ) {
					    if( !sadoc_eat[i] ) continue;
					    GivePlayerItem( playerid, sadoc_eat[i], 1 );
					}
				}
			}
		}
	}

	for(new i = 0; i < 18; i++) {
	    if(playertextid != slotUse[i][playerid]) continue;
	    if(playertextid == slotUse[i][playerid]) {
	        if(GetPVarInt(playerid,"changeSlotUse") == -1) {
				SetPVarInt(playerid,"selectSlotUse",i);
	            new Float:kg;
    			for(new k; k != 56; k++) kg += _itemsInfo[Inv[playerid][invSlot][k]][invKg];
				switch(GetPVarInt(playerid,"UseSlots")) {
					case 0: giveHouseInvTD( playerid );
				    case 1:
					{
				        new id = GetPVarInt(playerid,"PlayerVehicleID");
				        if(V::[id][vInvSlot][GetPVarInt(playerid,"selectSlotUse")] == 0)
						{
				        	if(GetPVarInt(playerid,"changeSlot") != -1 && Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")] != 0)
							{
				    			switch(GetPVarInt(playerid,"UseSlots"))
								{
									case 1:
									{
    									switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invID])
										{
    										case 65 .. 80,90,97:
											{
    											if(id >= lspdcars[0] && id <= lspdcars[1] || id >= sherifcar[0] && id <= sherifcar[1] ||
    											id >= sheriffandpolice[0] && id <= sheriffandpolice[1] ||
    											id >= medicalcar[0] && id <= medicalcar[1] || id >= smicars[0] && id <= smicars[1] ||
												id >= fd_cars[0] && id <= fd_cars[1] 
												|| id >= sasd_car[0] && id <= sasd_car[1]) {}
    											else return SendClientMessage(playerid,C_GRAY,""gbError"Данный предмет нельзя выкидывать/передавать/складывать!");
    										}
    										case 91: return SendClientMessage(playerid,C_GRAY,""gbError"Данный предмет нельзя выкидывать/передавать/складывать!");
    									}
				        				PlayerTextDrawSetPreviewModel(playerid, invSPlayer[playerid][GetPVarInt(playerid,"changeSlot")], 19464);
										PlayerTextDrawSetPreviewRot(playerid, invSPlayer[playerid][GetPVarInt(playerid,"changeSlot")], 0.000000, 0.000000, 90.000000, 0.100000);
										PlayerTextDrawBackgroundColor(playerid,invSPlayer[playerid][GetPVarInt(playerid,"changeSlot")], 255);
										PlayerTextDrawSetPreviewModel(playerid, slotUse[GetPVarInt(playerid,"selectSlotUse")][playerid], _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]);
										PlayerTextDrawSetPreviewRot(playerid, slotUse[GetPVarInt(playerid,"selectSlotUse")][playerid], _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invP][0], _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invP][1], _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invP][2], _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invP][3]);
										PlayerTextDrawBackgroundColor(playerid,slotUse[GetPVarInt(playerid,"selectSlotUse")][playerid], 0xd3d3d3FF);
										PlayerTextDrawShow(playerid,slotUse[GetPVarInt(playerid,"selectSlotUse")][playerid]);
										PlayerTextDrawShow(playerid,invSPlayer[playerid][GetPVarInt(playerid,"changeSlot")]);
										V::[id][vInvSlot][GetPVarInt(playerid,"selectSlotUse")] = Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")];
										V::[id][vInvSlotKol][GetPVarInt(playerid,"selectSlotUse")] = Inv[playerid][invSlotKol][GetPVarInt(playerid,"changeSlot")];
										Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")] = 0;
                    					Inv[playerid][invSlotKol][GetPVarInt(playerid,"changeSlot")] = 0;
                    					SaveInventory(playerid);
                    					MeAction(playerid,"положил(-а) что-то в авто",1);
                    					if(V::[id][vBuyingCar] != -1)
										{
                    					    new carid = V::[id][vBuyingCar];
											Car::[carid][cInvSlot][GetPVarInt(playerid,"selectSlotUse")] = V::[id][vInvSlot][GetPVarInt(playerid,"selectSlotUse")];
											Car::[carid][cInvSlotKol][GetPVarInt(playerid,"selectSlotUse")] = V::[id][vInvSlotKol][GetPVarInt(playerid,"selectSlotUse")];
											
											SaveCarInventory( carid );
                    					}
									}
								}
								SetPVarInt(playerid,"changeSlot",-1);
								SetPVarInt(playerid,"selectSlot",-1);
								SetPVarInt(playerid,"selectSlotUse",-1);
	    						SetPVarInt(playerid,"changeSlotUse",-1);
							}
						}
				        else {
				            SetPVarInt(playerid,"changeSlotUse",GetPVarInt(playerid,"selectSlotUse"));
				            PlayerTextDrawBackgroundColor(playerid,slotUse[GetPVarInt(playerid,"changeSlotUse")][playerid], 0xFFFFFFFF);
                    		PlayerTextDrawShow(playerid,slotUse[GetPVarInt(playerid,"changeSlotUse")][playerid]);
							if(GetPVarInt(playerid,"changeSlot") != -1) return SetPVarInt(playerid,"changeSlot",-1);
				        }
				    }
				}
	        }
	        else
			{
	            SetPVarInt(playerid,"selectSlotUse",i);
	            PlayerTextDrawBackgroundColor(playerid,slotUse[GetPVarInt(playerid,"changeSlotUse")][playerid], 0xd3d3d3FF);
                PlayerTextDrawShow(playerid,slotUse[GetPVarInt(playerid,"changeSlotUse")][playerid]);
                if(GetPVarInt(playerid,"changeSlotUse") == GetPVarInt(playerid,"selectSlotUse")) return SetPVarInt(playerid,"changeSlotUse",-1);
	    		switch(GetPVarInt(playerid,"UseSlots")) {
					case 0: moveHouseItemTD( playerid );
					case 1:
					{
					    new id = GetPVarInt(playerid,"PlayerVehicleID");
					    //if(V::[id][
					    if(V::[id][vInvSlot][GetPVarInt(playerid,"selectSlotUse")] != 0 && V::[id][vInvSlot][GetPVarInt(playerid,"selectSlotUse")] != V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")] ||  V::[id][vInvSlot][GetPVarInt(playerid,"selectSlotUse")] == V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")]) return SetPVarInt(playerid,"changeSlotUse",-1);
			    		if(V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")] != 0) {
			        		PlayerTextDrawSetPreviewModel(playerid, slotUse[GetPVarInt(playerid,"changeSlotUse")][playerid], 19464);
							PlayerTextDrawSetPreviewRot(playerid, slotUse[GetPVarInt(playerid,"changeSlotUse")][playerid], 0.000000, 0.000000, 90.000000, 0.100000);
							PlayerTextDrawBackgroundColor(playerid, slotUse[GetPVarInt(playerid,"changeSlotUse")][playerid], 255);
							PlayerTextDrawSetPreviewModel(playerid, slotUse[GetPVarInt(playerid,"selectSlotUse")][playerid], _itemsInfo[V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")]][invObject]);
							PlayerTextDrawSetPreviewRot(playerid, slotUse[GetPVarInt(playerid,"selectSlotUse")][playerid], _itemsInfo[V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")]][invP][0], _itemsInfo[V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")]][invP][1], _itemsInfo[V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")]][invP][2], _itemsInfo[V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")]][invP][3]);
							PlayerTextDrawBackgroundColor(playerid,slotUse[GetPVarInt(playerid,"selectSlotUse")][playerid], 0xd3d3d3FF);
							PlayerTextDrawShow(playerid,slotUse[GetPVarInt(playerid,"selectSlotUse")][playerid]);
							PlayerTextDrawShow(playerid,slotUse[GetPVarInt(playerid,"changeSlotUse")][playerid]);
			    		}
			    		if(V::[id][vInvSlot][GetPVarInt(playerid,"selectSlotUse")] == 0)
						{
			        		V::[id][vInvSlot][GetPVarInt(playerid,"selectSlotUse")] = V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")];
			        		V::[id][vInvSlotKol][GetPVarInt(playerid,"selectSlotUse")] = V::[id][vInvSlotKol][GetPVarInt(playerid,"changeSlotUse")];
			        		V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")] = 0;
			        		V::[id][vInvSlotKol][GetPVarInt(playerid,"changeSlotUse")] = 0;
			        		MeAction(playerid,"переложил(-а) что-то в авто",1);
							if(V::[id][vBuyingCar] != -1) {
							    new carid = V::[id][vBuyingCar];
							    Car::[carid][cInvSlot][GetPVarInt(playerid,"selectSlotUse")] = V::[id][vInvSlot][GetPVarInt(playerid,"selectSlotUse")];
								Car::[carid][cInvSlotKol][GetPVarInt(playerid,"selectSlotUse")] = V::[id][vInvSlotKol][GetPVarInt(playerid,"selectSlotUse")];
								Car::[carid][cInvSlot][GetPVarInt(playerid,"changeSlotUse")] = 0;
								Car::[carid][cInvSlotKol][GetPVarInt(playerid,"changeSlotUse")] = 0;
								SaveCarInventory( carid );
							}
			    		}
         				SetPVarInt(playerid,"selectSlotUse",-1);
	    				SetPVarInt(playerid,"changeSlotUse",-1);
					}
	    		}
				return 1;
			}
		}
	}
	for(new i = 0; i < 56; i++) {
	    if(playertextid != invSPlayer[playerid][i]) continue;
        if(playertextid == invSPlayer[playerid][i]) {
			if(GetPVarInt(playerid,"changeSlot") == -1) {
				SetPVarInt(playerid,"selectSlot",i);
				new Float:kg;
    			for(new k; k != 56; k++) kg += _itemsInfo[Inv[playerid][invSlot][k]][invKg];
				if(Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] == 0) {
				    if(GetPVarInt(playerid,"changeSlotUse") != -1) {
				        switch(GetPVarInt(playerid,"UseSlots")) {
							case 0: takeHouseItemTD( playerid );
				            case 1:
							{
				                new id = GetPVarInt(playerid,"PlayerVehicleID");
				                if(V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")] != 0)
						 		{
				                    if(kg + _itemsInfo[V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")]][invKg] > MAX_PLAYER_KG + Player[playerid][uJobDouble][6]) return SendClientMessage(playerid,C_GRAY,""gbError"Вы уже и так много несёте с собой!");
									if(V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")] == 485) return SendClientMessage(playerid,C_GRAY,""gbError"Данный предмет перекладывать нельзя!");

									PlayerTextDrawSetPreviewModel(playerid, slotUse[GetPVarInt(playerid,"changeSlotUse")][playerid], 19464);
									PlayerTextDrawSetPreviewRot(playerid, slotUse[GetPVarInt(playerid,"changeSlotUse")][playerid], 0.000000, 0.000000, 90.000000, 0.100000);
									PlayerTextDrawBackgroundColor(playerid, slotUse[GetPVarInt(playerid,"changeSlotUse")][playerid], 255);
									PlayerTextDrawSetPreviewModel(playerid,invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")], _itemsInfo[V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")]][invObject]);
									PlayerTextDrawSetPreviewRot(playerid, invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")], _itemsInfo[V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")]][invP][0], _itemsInfo[V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")]][invP][1], _itemsInfo[V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")]][invP][2], _itemsInfo[V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")]][invP][3]);
									PlayerTextDrawBackgroundColor(playerid,invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")], 0xd3d3d3FF);
									PlayerTextDrawShow(playerid,invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")]);
									PlayerTextDrawShow(playerid,slotUse[GetPVarInt(playerid,"changeSlotUse")][playerid]);
								 	Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] = V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")];
									Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = V::[id][vInvSlotKol][GetPVarInt(playerid,"changeSlotUse")];
									V::[id][vInvSlot][GetPVarInt(playerid,"changeSlotUse")] = 0;
									V::[id][vInvSlotKol][GetPVarInt(playerid,"changeSlotUse")] = 0;
									MeAction(playerid,"взял(-а) что-то из авто",1);

									if( IsBuyingCar( id ) )
									{
							    		new carid = V::[id][vBuyingCar];
							    		Car::[carid][cInvSlot][GetPVarInt(playerid,"changeSlotUse")] = 0;
										Car::[carid][cInvSlotKol][GetPVarInt(playerid,"changeSlotUse")] = 0;
										SaveCarInventory( carid );
									}
				                }
				            }
				        }
				        SetPVarInt(playerid,"changeSlotUse",-1);
				        SetPVarInt(playerid,"selectSlotUse",-1);
				        SetPVarInt(playerid,"changeSlot",-1);
						SetPVarInt(playerid,"selectSlot",-1);
				    }
				}
				else {
                    SetPVarInt(playerid,"changeSlot",GetPVarInt(playerid,"selectSlot"));
                    PlayerTextDrawBackgroundColor(playerid,invSPlayer[playerid][GetPVarInt(playerid,"changeSlot")], 0xFFFFFFFF);
                    PlayerTextDrawShow(playerid,invSPlayer[playerid][GetPVarInt(playerid,"changeSlot")]);
                    if(GetPVarInt(playerid,"changeSlotUse") != -1) return SetPVarInt(playerid,"changeSlotUse",-1);
                    if(GetPVarInt(playerid,"changeSlot") != 48 && GetPVarInt(playerid,"changeSlot") != 49 && GetPVarInt(playerid,"changeSlot") && GetPVarInt(playerid,"changeSlot") != 50 &&
                    GetPVarInt(playerid,"changeSlot") != 51 && GetPVarInt(playerid,"changeSlot") != 52 && GetPVarInt(playerid,"changeSlot") != 53 && GetPVarInt(playerid,"changeSlot") != 54 &&
                    GetPVarInt(playerid,"changeSlot") != 55) {
	                    switch(Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]) {
	        				case 1 .. 299: PlayerTextDrawShow(playerid,infoIPlayer[playerid][4]);
	        				case 300 .. 320: PlayerTextDrawShow(playerid,infoIPlayer[playerid][1]);
	        				case 321 .. 325,327 .. 331,339 .. 342,426,429,476,473,480: PlayerTextDrawShow(playerid,infoIPlayer[playerid][2]);
	        				case 332 .. 338,458,428,430: PlayerTextDrawShow(playerid,infoIPlayer[playerid][3]);
	        				case 343 .. 352,367 .. 374: PlayerTextDrawShow(playerid,infoIPlayer[playerid][0]);
	        				case 353 .. 366,433: PlayerTextDrawShow(playerid,infoIPlayer[playerid][5]);
	        				case 393 .. 401: PlayerTextDrawShow(playerid,infoIPlayer[playerid][7]);
	        				case 326,431: PlayerTextDrawShow(playerid,infoIPlayer[playerid][6]);
	        			}
	        		}
				}
			}
			else {
                SetPVarInt(playerid,"selectSlot",i);
				PlayerTextDrawBackgroundColor(playerid,invSPlayer[playerid][GetPVarInt(playerid,"changeSlot")], 0xd3d3d3FF);
                PlayerTextDrawShow(playerid,invSPlayer[playerid][GetPVarInt(playerid,"changeSlot")]);
                if(GetPVarInt(playerid,"changeSlot") == GetPVarInt(playerid,"selectSlot")) return SetPVarInt(playerid,"changeSlot",-1);
                if(Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] != 0 && Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] != Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")] ||  Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] == Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]) return SetPVarInt(playerid,"changeSlot",-1);
                for(new hide; hide != 8; hide ++) PlayerTextDrawHide(playerid,infoIPlayer[playerid][hide]);
                if(playertextid == invSPlayer[playerid][48]) {
					switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]) {
					    case 18926 .. 18935: {
					        if(SkinCaps[GetPlayerSkin(playerid)][0] == 0.0) return SendClientMessage(playerid,C_RED,""gbError"Простите, но на Ваш скин нельзя одеть кепку!"),SetPVarInt(playerid,"changeSlot",-1);
					        SetPlayerAttachedObject(playerid, 0, _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject], 2, SkinCaps[GetPlayerSkin(playerid)][0], SkinCaps[GetPlayerSkin(playerid)][1], SkinCaps[GetPlayerSkin(playerid)][2], SkinCaps[GetPlayerSkin(playerid)][3],SkinCaps[GetPlayerSkin(playerid)][4], SkinCaps[GetPlayerSkin(playerid)][5]);
					        ApplyAnimation(playerid, "SHOP", "ROB_Shifty",4.0, 0, 1, 1, 0, 0, 1);
					    }
					    case 18944 .. 18951, 19528: {
					        if(SkinHead[GetPlayerSkin(playerid)][0] == 0.0) return SendClientMessage(playerid,C_RED,""gbError"Простите, но на Ваш скин нельзя одеть шляпу!"),SetPVarInt(playerid,"changeSlot",-1);
					        SetPlayerAttachedObject(playerid, 0, _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject], 2, SkinHead[GetPlayerSkin(playerid)][0], SkinHead[GetPlayerSkin(playerid)][1], SkinHead[GetPlayerSkin(playerid)][2], SkinHead[GetPlayerSkin(playerid)][3],SkinHead[GetPlayerSkin(playerid)][4], SkinHead[GetPlayerSkin(playerid)][5]);
					        ApplyAnimation(playerid, "SHOP", "ROB_Shifty",4.0, 0, 1, 1, 0, 0, 1);
					    }
						default: return SendClientMessage(playerid,C_RED,""gbError"Этот слот только для головных уборов!"),SetPVarInt(playerid,"changeSlot",-1);
					}
				}
				if(playertextid == invSPlayer[playerid][49]) {
                    switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]) {
                    	case 19007,19011 .. 19019,19024,19027 .. 19029,19022,19035,19031 .. 19033,19139,19140: {
						    if(_skinGlasses[GetPlayerSkin(playerid)][0] == 0.0) return SendClientMessage(playerid,-1,""gbError"Простите, но на Ваш скин нельзя одеть очки!"),SetPVarInt(playerid,"changeSlot",-1);
						    SetPlayerAttachedObject(playerid,1,_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject],2,_skinGlasses[GetPlayerSkin(playerid)][0], _skinGlasses[GetPlayerSkin(playerid)][1], _skinGlasses[GetPlayerSkin(playerid)][2], _skinGlasses[GetPlayerSkin(playerid)][3], _skinGlasses[GetPlayerSkin(playerid)][4], _skinGlasses[GetPlayerSkin(playerid)][5]);
						    ApplyAnimation(playerid, "SHOP", "ROB_Shifty",4.0, 0, 1, 1, 0, 0, 1);
						}
						default: return SendClientMessage(playerid,C_RED,""gbError"Этот слот только для очков!"),SetPVarInt(playerid,"changeSlot",-1);
					}
				}
				if(playertextid == invSPlayer[playerid][50]) 
				{
				    switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]) 
					{
						case 331,334,335,336,337,338,339,326,346,347,348,365,366,367,321,333,325: 
						{
							givePlayerWeapon(playerid,GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]),Inv[playerid][invSlotKol][GetPVarInt(playerid,"changeSlot")]);
						}
						default: 
							return SendClientMessage(playerid,C_RED,""gbError"Этот слот только для пистолетов и для оружия ближнего боя!"),SetPVarInt(playerid,"changeSlot",-1);
					}
				}
				if(playertextid == invSPlayer[playerid][51])
				{
				    switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject])
					{
						case 349,352,353,355,356,372,357,358,341: 
						{
							givePlayerWeapon(
								playerid,
								GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]),
								Inv[playerid][invSlotKol][GetPVarInt(playerid,"changeSlot")]
							);
						}
						default: 
							return SendClientMessage(playerid,C_RED,""gbError"Этот слот только пп и оружия дальнего боя!"),SetPVarInt(playerid,"changeSlot",-1);
					}
				}
				if(playertextid == invSPlayer[playerid][52]) {
				    switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]) {
						case 0 .. 8,14 .. 30,32 .. 37,42 .. 52,57 .. 62,66 .. 68,70 .. 73,78 .. 84,86,94 .. 128,132 .. 137,142 .. 144,146,147,149,153 .. 156,158 .. 168,170,171,173 .. 177,179 .. 189,200,202,203,204,206,208 .. 210,212,213,217,220 .. 223,227 .. 230,234 .. 236,239 .. 242,247 .. 250,252 .. 255,258 .. 262,264 .. 297,299: {
						    if(Player[playerid][uSex] != 1) return SendClientMessage(playerid,C_RED,""gbError"Эта одежда не подходит Вашему полу!"),SetPVarInt(playerid,"changeSlot",-1);
						    SetPlayerSkin(playerid,_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]);
						}
						case 9 .. 13,31,38 .. 41,53 .. 56,63 .. 65,69,75 .. 77,85,87 .. 93,129 .. 131,138 .. 141,145,148,150 .. 152,157,169,172,178,190 .. 199,201,205,207,211,214 .. 216,218,219,224 .. 226,231 .. 233,237,238,243 .. 246,251,256,257,263,298: {
						    if(Player[playerid][uSex] != 2) return SendClientMessage(playerid,C_RED,""gbError"Эта одежда не подходит Вашему полу!"),SetPVarInt(playerid,"changeSlot",-1);
						    SetPlayerSkin(playerid,_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]);
						}
						default: return SendClientMessage(playerid,C_RED,""gbError"Этот слот только для одежды Вашего персонажа!"),SetPVarInt(playerid,"changeSlot",-1);
					}
				}
				if(playertextid == invSPlayer[playerid][53]) {
				    switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]) {
				        case 18911 .. 18920: {
				            if(BandSkin[GetPlayerSkin(playerid)][0] == 0.0) return SendClientMessage(playerid,C_RED,""gbError"Простите, но на Ваш скин нельзя одеть бандану!"),SetPVarInt(playerid,"changeSlot",-1);
					        SetPlayerAttachedObject(playerid, 2, _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject], 2, BandSkin[GetPlayerSkin(playerid)][0], BandSkin[GetPlayerSkin(playerid)][1], BandSkin[GetPlayerSkin(playerid)][2], BandSkin[GetPlayerSkin(playerid)][3],BandSkin[GetPlayerSkin(playerid)][4], BandSkin[GetPlayerSkin(playerid)][5], 1.000000, 1.000000, 1.000000);
					        ApplyAnimation(playerid, "SHOP", "ROB_Shifty",4.0, 0, 1, 1, 0, 0, 1);
				        }
				        case 19421 .. 19424: {
				            if(Beats[GetPlayerSkin(playerid)][0] == 0.0) return SendClientMessage(playerid,C_RED,""gbError"Простите, но на Ваш скин нельзя одеть наушники!"),SetPVarInt(playerid,"changeSlot",-1);
					        SetPlayerAttachedObject(playerid, 2, _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject], 1, Beats[GetPlayerSkin(playerid)][0], Beats[GetPlayerSkin(playerid)][1], Beats[GetPlayerSkin(playerid)][2], Beats[GetPlayerSkin(playerid)][3],Beats[GetPlayerSkin(playerid)][4], Beats[GetPlayerSkin(playerid)][5], 1.000000, 1.000000, 1.000000);
					        ApplyAnimation(playerid, "SHOP", "ROB_Shifty",4.0, 0, 1, 1, 0, 0, 1);
				        }
				        case 18637: {
							SetPlayerAttachedObject(playerid, 2, _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject], 14, 0.0, 0.0, 0.0, 0.0, 180.0, 180.0);
						}
				        default: return SendClientMessage(playerid,C_RED,""gbError"Этот слот только для бандан/наушников/щитов!"),SetPVarInt(playerid,"changeSlot",-1);
				    }
				}
				if(playertextid == invSPlayer[playerid][54]) {
				    switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]) {
						case 1242: setPlayerArmour(playerid,Inv[playerid][invSlotKol][GetPVarInt(playerid,"changeSlot")]);
				        default: return SendClientMessage(playerid,C_RED,""gbError"Этот слот только для бронежилетов!"),SetPVarInt(playerid,"changeSlot",-1);
				    }
				}
				if(playertextid == invSPlayer[playerid][55]) {
				    switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]) {
						case 18874,18871,18872,18869,18870,18866,18865,18868,18867: { }
				        default: return SendClientMessage(playerid,C_RED,""gbError"Этот слот только для телефонов!"),SetPVarInt(playerid,"changeSlot",-1);
				    }
				}
				if(playertextid != invSPlayer[playerid][48] || playertextid != invSPlayer[playerid][49] || playertextid != invSPlayer[playerid][50] ||
				playertextid != invSPlayer[playerid][51] || playertextid != invSPlayer[playerid][52] || playertextid != invSPlayer[playerid][53] || playertextid != invSPlayer[playerid][54] ||
				playertextid != invSPlayer[playerid][55]) {
					switch(GetPVarInt(playerid,"changeSlot")) {
						case 48: RemovePlayerAttachedObject(playerid, 0);
						case 49: RemovePlayerAttachedObject(playerid, 1);
						case 50: RemovePlayerWeapon(playerid,GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]));
						case 51: RemovePlayerWeapon(playerid,GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]));
						case 52: {
							if(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject] != 0) {
							    if(Player[playerid][uSex] == 1) {
									if(Player[playerid][uColor] == 1) SetPlayerSkin(playerid,18);
									else if(Player[playerid][uColor] == 2) SetPlayerSkin(playerid,154);
								}
								else if(Player[playerid][uSex] == 2) {
								    if(Player[playerid][uColor] == 1) SetPlayerSkin(playerid,139);
									else if(Player[playerid][uColor] == 2) SetPlayerSkin(playerid,138);
								}
							}
							//else SetPlayerSkin(playerid,_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]);
							// Изменить
						}
						case 53: RemovePlayerAttachedObject(playerid, 2);
						case 54: setPlayerArmour(playerid,0);
					}
				}
				if(Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")] != 0) {
                    PlayerTextDrawSetPreviewModel(playerid, invSPlayer[playerid][GetPVarInt(playerid,"changeSlot")], 19464);
					PlayerTextDrawSetPreviewRot(playerid, invSPlayer[playerid][GetPVarInt(playerid,"changeSlot")], 0.000000, 0.000000, 90.000000, 0.100000);
					PlayerTextDrawBackgroundColor(playerid,invSPlayer[playerid][GetPVarInt(playerid,"changeSlot")], 255);
					PlayerTextDrawSetPreviewModel(playerid,invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")], _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invObject]);
                    PlayerTextDrawSetPreviewRot(playerid, invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")], _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invP][0], _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invP][1], _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invP][2], _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")]][invP][3]);
					PlayerTextDrawBackgroundColor(playerid,invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")], 0xd3d3d3FF);
					PlayerTextDrawShow(playerid,invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")]);
					PlayerTextDrawShow(playerid,invSPlayer[playerid][GetPVarInt(playerid,"changeSlot")]);
                }
	            if(Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] == 0) {
                    Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] = Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")];
                    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = Inv[playerid][invSlotKol][GetPVarInt(playerid,"changeSlot")];
                    Inv[playerid][invSlot][GetPVarInt(playerid,"changeSlot")] = 0;
                    Inv[playerid][invSlotKol][GetPVarInt(playerid,"changeSlot")] = 0;
                    SaveInventory(playerid);
                }
                SetPVarInt(playerid,"changeSlot",-1);
                SetPVarInt(playerid,"selectSlot",-1);
                return 1;
			}
        }
    }
	return 1;
}

public OnPlayerEnterVehicle(playerid, vehicleid, ispassenger)
{
	return 1;
}

public OnPlayerAttachTrailer(playerid,vehicleid,trailerid) {
    if(D::[playerid][dDalnDuty] == true && trailerid != PlayerTrailer[playerid]) {
        SendClientMessage(playerid,C_GRAY,""gbError"Этот прицеп выдан в аренду не вам.");
        return DetachTrailerFromVehicle(vehicleid);
    }
    else {
        if(GetPVarInt(playerid,"dettachTrailer") != 0) SetPVarInt(playerid,"dettachTrailer",0);
    }
	return 1;
}

public OnPlayerDeattachTrailer(playerid,vehicleid,trailerid) {
	if(trailerid == PlayerTrailer[playerid]) {
	    SetPVarInt(playerid,"dettachTrailer",120);
	}
	return 1;
}

stock HideInventory( playerid ) 
{
	CancelSelectTextDraw(playerid);
	SetPVarInt(playerid,"PlayerMenuShow",0);
	SetCameraBehindPlayer(playerid);
	for(new i; i != 22; i++) TextDrawHideForPlayer(playerid,invPlayer[i]);
	for(new s; s != 61; s++) PlayerTextDrawHide(playerid,invSPlayer[playerid][s]);
	SetPVarInt(playerid,"changeSlot",-1);
	SetPVarInt(playerid,"selectSlot",-1);

	switch(GetPVarInt(playerid,"UseSlots")) {
		case 0,1,7: {
			for(new i; i != 18; i++) PlayerTextDrawHide(playerid,slotUse[i][playerid]);
			for(new i; i != 3; i++) PlayerTextDrawHide(playerid,iconUse[i][playerid]);
 		}
 		case 2,3,4,5,8,9: {
			for(new i; i != 16; i ++) {
				TextDrawHideForPlayer(playerid,buyingShopFon[i]);
				PlayerTextDrawHide(playerid,buyingShopItems[i][playerid]);
				PlayerTextDrawHide(playerid,buyingShopInfo[i][playerid]);
 			}
  		}
  		case 6:
  		{
    		for(new i; i != 30; i ++) PlayerTextDrawHide(playerid,Warehouse[i][playerid]);
		    for(new i; i != 3; i++) PlayerTextDrawHide(playerid,iconUse[i][playerid]);
  		}
  	}
  	for(new i = 48; i != 56; i++) PlayerTextDrawSetSelectable(playerid,invSPlayer[playerid][i], 1);
  	for(new i; i != 8; i ++) PlayerTextDrawHide(playerid,infoIPlayer[playerid][i]);
  	SetPVarInt(playerid,"UseSlots",-1);
  	if(GetPVarInt(playerid,"PlayerVehicleID") != -1) {
		GetVehicleParamsEx(GetPVarInt(playerid,"PlayerVehicleID"),eng,light,other1,other2,other3,other4,other5);
  		SetVehicleParamsEx(GetPVarInt(playerid,"PlayerVehicleID"),eng,light,other1,other2,other3,0,other5);
    	SetPVarInt(playerid,"PlayerVehicleID",-1);
   	}
   	if(IsPlayerInAnyVehicle(playerid) && GetPlayerState(playerid) == PLAYER_STATE_DRIVER) {
		if(Player[playerid][uSettings][0] == 1) {
			for(new i; i != 3; i++) TextDrawShowForPlayer(playerid, SpeedFon[i]);
			for(new i; i != 8; i++) PlayerTextDrawShow(playerid,Speed[i][playerid]);
			UpdateFuelBar(playerid,GetPlayerVehicleID(playerid));
		}
	}
	return true;
}


public OnPlayerClickTextDraw(playerid, Text:clickedid) {
	new string[1024],warningtext[50];
	warningtext = "";

    if(_:clickedid == INVALID_TEXT_DRAW) {
		switch( getData( playerid, "PlayerMenuShow" ) ) {
		    case 1: {
			    for(new i; i != 21; i ++) TextDrawHideForPlayer(playerid,MenuPlayer[i]);
			    for(new i; i != 3; i ++) PlayerTextDrawHide(playerid,menuPlayer[i][playerid]);
            	setData( playerid, "PlayerMenuShow", 0 );
            	CancelSelectTextDraw(playerid);
            	SetCameraBehindPlayer(playerid);
		    }
		    case 2: {
		        SetPVarInt(playerid,"PlayerMenuShow",0);
		        CancelSelectTextDraw(playerid);
		    	TextDrawHideForPlayer(playerid, FermFon[0]);
		    	TextDrawHideForPlayer(playerid, FermFon[1]);
				PlayerTextDrawHide(playerid, FermSelectSkin[0][playerid]);
				PlayerTextDrawHide(playerid, FermSelectSkin[1][playerid]);
				PlayerTextDrawHide(playerid, FermSelectSkin[2][playerid]);
		    }
			case 3: {
			    SetPVarInt(playerid,"PlayerMenuShow",0);
			    
				for(new i; i != 9; i ++) 
				{
					if( i == 5 )
						continue; 
						
					TextDrawHideForPlayer(playerid, dalnmenu[i]);
		    	}
				
				PlayerTextDrawHide(playerid,dalnmenuplayer[playerid]);
			}
			case 4: {
				HideInventory( playerid );
				
			    
			}
			case 5: {
				if(D::[playerid][dPhone] == true) return 1;
			    hidePhone(playerid);
			    SetPVarInt(playerid,"PlayerMenuShow",0);
			}
			case 6: {
			    for(new i; i != 6; i ++) TextDrawHideForPlayer(playerid, furnitureBuy[i]);
				PlayerTextDrawHide(playerid, furniturePrice[playerid]);
			    SetPVarInt(playerid,"PlayerMenuShow",0);
			    SetCameraBehindPlayer(playerid);
			    CancelSelectTextDraw(playerid);
			    togglePlayerControllable(playerid,true);
			}
			case 7: {
				HideTuneList( playerid );
			}
			case 9:
			{
			    CancelSelectTextDraw(playerid);
			    for(new i; i != 13; i++) PlayerTextDrawHide(playerid, NewSkinSelect[i][playerid]);
			    SetPVarInt(playerid,"PlayerMenuShow",0);
			}
		}
    }
	
	
    if(clickedid == MenuPlayer[15])
	{
        if( IsMute( playerid, TYPE_OOC )) 
			return SendClientMessage( playerid, C_WHITE, !PLAYER_MUTED );
			
		showPlayerDialog( playerid, d_a_menu + 1, 1, "Связь с администрацией",
			""gbInfo"Введите запрос администрации или операторам поддержки:\n\n\
			"cRED"| Если Вы указываете жалобу, не забудьте указать ID игрока на которого жалуетесь.\n\
			"cRED"| Запрос не должен содержать в себе оффтоп.",
			"Далее", "Закрыть"
		);
	}
    if(clickedid == MenuPlayer[16]) showHelp( playerid, 0 );
    if(clickedid == MenuPlayer[17]) showSettings(playerid);
    if(clickedid == MenuPlayer[18]) showHelp( playerid, 1 );
	if(clickedid == MenuPlayer[19]) {
        string = "";
        strcat(string,"{ffffff}Проект "cBLUE"Gambit Role Play {ffffff}был основан в июле 2014 года разработчиками нашумевшего "cBLUE"State 99{ffffff}.\n");
        strcat(string,"Свое название проект получил от известного шахматного хода, так как разработчики пожертвовали одним сервером, \nчто бы дать игрокам будущее спустя год.\n\n");
        strcat(string,"Основной целью проекта является, удаление стереотипов серверов в SA:MP индустрии\n");
        strcat(string,"и поворот шаблонности в новое русло, так как разработчиками был замечен фактор\n");
        strcat(string,"повторения внутреннего строения сервера, которое берет свое начало с гигантов SA:MP индустрии.");
		showPlayerDialog(playerid,9999,0,"Информация о сервере",string,"Закрыть","");
	}
    if(clickedid == MenuPlayer[20]) {
        string = "";
        strcat(string,"{ffffff}| Чтобы воспользоваться донат услугами на нашем сервере, Вам необходимо:\n\n");
        strcat(string,"{ffffff}1. "cGRAY"Не находиться на сервере, в момент использования услугами доната;\n");
        strcat(string,"{ffffff}2. "cGRAY"Авторизироваться на сайте проекта (g-rp.su) под своим игровым аккаунтом;\n");
        strcat(string,"{ffffff}3. "cGRAY"Перейти в раздел \"Магазин\";");
		showPlayerDialog(playerid,9999,0,"Донат",string,"Закрыть","");
	}
    if(clickedid == invPlayer[18])
	{
		if(GetPVarInt(playerid,"selectSlot") != -1 && Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] != 0) {
			new bool:keycar = false;
			switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invID]) {
				case 1 .. 22,35 .. 40: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:"cGRAY"\n\n%s\n\nКоличество - 1\nПатроны - %d\nВес - %.1fkg",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")],_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invKg]),keycar = true;
			    case 23: {
			    	for(new i; i != MAX_CARS_BUY; i++) {
			    	    if(Car::[i][cID] == 0 || Car::[i][cModel] == 0) continue;
						if(Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] == Car::[i][cID]) {
							format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от машины\n\nИнформация - %s\n\nМашина - %s(%d)",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],CarNames[Car::[i][cModel] - 400],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]);
							keycar = true;
							break;
						}
					}
			    }
			    case 24: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от дома\n\nИнформация - %s\n\nНомер дома - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
			    case 25: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от закусочной\n\nИнформация - %s\n\nНомер закусочной - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
		    	case 49: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от бара\n\nИнформация - %s\n\nНомер бара - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
		    	case 50: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от ресторана\n\nИнформация - %s\n\nНомер ресторана - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
		    	case 51: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от магазины одежды\n\nИнформация - %s\n\nНомер магазина одежды - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
		    	case 52: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от магазина электроники\n\nИнформация - %s\n\nНомер магазина электроники - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
		    	case 60: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от автосалона\n\nИнформация - %s\n\nНомер автосалона - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
		    	case 61: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от магазина оружия\n\nИнформация - %s\n\nНомер магазина оружия - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
		    	case 62: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от магазина одежды\n\nИнформация - %s\n\nНомер магазина одежды - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
		    	case 63: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от клуба\n\nИнформация - %s\n\nНомер клуба - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
		    	case 64: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от заправки\n\nИнформация - %s\n\nНомер заправки - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
				case 123: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от магазина Все для отдыха\n\nИнформация - %s\n\nНомер магазина - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
				case 126: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от магазина Аренда транспорта\n\nИнформация - %s\n\nНомер магазина - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
				case 127: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от Спортзала\n\nИнформация - %s\n\nНомер магазина - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
				case 145:
				{
				    if(Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] == -1)
				    {
				    	format(string, sizeof(string), "{ffffff}| Информация о данном предмете:\n\n"cGRAY"Гильза от оружия\n\nНомер оружия: Неизвестно", Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]), keycar = true;
					}
					else
					{
                        format(string, sizeof(string), "{ffffff}| Информация о данном предмете:\n\n"cGRAY"Гильза от оружия\n\nНомер оружия: %d", Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]), keycar = true;
					}
				}
				case 148: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"Ключ от квартиры\n\nИнформация - %s\n\nНомер квартиры - %d",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")]),keycar = true;
				default: format(string,sizeof(string),"{ffffff}| Информация о данном предмете:\n\n"cGRAY"%s\n\nКоличество - %d\nВес - %.1fkg",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invText],Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")],_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invKg]),keycar = true;
		    }
		    if(keycar != false) showPlayerDialog(playerid,9999,0,_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invName],string,"Закрыть","");
			else SendClientMessage(playerid,C_GRAY,""gbError"Простите, но информацию о данном ключе посмотреть нельзя!");
		}
	}
	if(clickedid == invPlayer[20])
	{
		if( GetPVarInt(playerid,"selectSlot") == -1 )
			return 1;
			
		if(GetPVarInt(playerid,"selectSlot") == 48 || GetPVarInt(playerid,"selectSlot") == 49 || GetPVarInt(playerid,"selectSlot") == 50 ||
		GetPVarInt(playerid,"selectSlot") == 51 || GetPVarInt(playerid,"selectSlot") == 52 || GetPVarInt(playerid,"selectSlot") == 53 ||
		GetPVarInt(playerid,"selectSlot") == 54 || GetPVarInt(playerid,"selectSlot") == 55) return SendClientMessage(playerid,C_GRAY,""gbError"Сначала снимите предмет с используемого слота!");
		switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invID]) 
		{
      		case 158: {
            	if( GetPVarInt( playerid, "use_slot_9" ) == 158 ) return SendClientMessage( playerid, C_GRAY, ""gbError"Вы не можете удалить предмет вы его используете!" );
			}
			case 156: {
            	if( GetPVarInt( playerid, "use_slot_9" ) == 156 ) return SendClientMessage( playerid, C_GRAY, ""gbError"Вы не можете удалить предмет вы его используете!" );
			}
		}
		if(Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] != 0 || Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] != 0) {
			showPlayerDialog(playerid,d_inventory + 1, 0, " ","{ffffff}Вы уверены, что хотите удалить данный предмет:\n\n"gbError"После удаления предмет нельзя восстановить.","Согласен","Нет");

		}
	}
	/*
	if(clickedid == invPlayer[21]) {
	    if(GetPVarInt(playerid,"selectSlot") == 48 || GetPVarInt(playerid,"selectSlot") == 49 || GetPVarInt(playerid,"selectSlot") == 50 ||
		GetPVarInt(playerid,"selectSlot") == 51 || GetPVarInt(playerid,"selectSlot") == 52 || GetPVarInt(playerid,"selectSlot") == 53 ||
		GetPVarInt(playerid,"selectSlot") == 54 || GetPVarInt(playerid,"selectSlot") == 55) return SendClientMessage(playerid,C_GRAY,""gbError"Сначала снимите предмет с используемого слота!");
 		switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invID])
	 	{
    		case 426..441,451,458,340,462,65..69,97,91,452,145: return SendClientMessage(playerid,C_GRAY,""gbError"Данный предмет нельзя выкидывать/передавать/складывать/удалять!");
			case 158: {
            	if( GetPVarInt( playerid, "use_slot_9" ) == 158 ) return SendClientMessage( playerid, C_GRAY, ""gbError"Вы не можете продать предмет вы его используете!" );
			}
			case 156: {
            	if( GetPVarInt( playerid, "use_slot_9" ) == 156 ) return SendClientMessage( playerid, C_GRAY, ""gbError"Вы не можете продать предмет вы его используете!" );
			}
		}
		if(Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] != 0 || Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] != 0) {
			showPlayerDialog(playerid, d_inventory + 2, 1, " ","{ffffff}Введите ID человека, которому хотите продать предмет:\n\n"cGREEN"| Человек должен находиться рядом с вами.\n"cRED"Не закрывайте инвентарь, до соглашения о продаже","Согласен","Нет");
		}
	}*/

	if(clickedid == invPlayer[16]) {
        if(GetPVarInt(playerid,"selectSlot") != -1 && Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] != 0 && Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] != 0) {
            new Float:kg;
            for(new i; i != 56; i++) kg += _itemsInfo[Inv[playerid][invSlot][i]][invKg];
			switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invID]) {
				case 23,24,25,60 .. 64: SendClientMessage(playerid,C_GRAY,""gbError"Пожалуйста, используйте команду "cBLUE"/lock");

				case 105:
				{

				    format(string,sizeof(string),"употребил(-а) %s",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invName]);
					MeAction(playerid,string,1);
				    ApplyAnimation(playerid,"SMOKING","M_smk_drag",4.1,0,0,0,0,0,1);
			    	SetPlayerDrunkLevel(playerid, GetPlayerDrunkLevel(playerid)+50000);
			    	SetPlayerTime(playerid, 17, 0);
        			SetPlayerWeather(playerid, -68);
			    	SetPVarInt(playerid,"EffectGone",_:SetTimerEx("EffectGone",300000,false,"d",playerid));
	           	 	Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
	           	 	SetPVarInt(playerid, "Stunned", 5);
					new Float:HealthP;
					GetPlayerHealth(playerid, HealthP);
					SetPlayerHealth(playerid, HealthP + 30);
				}
				case 108:
				{
				    //SendClientMessage(playerid,-1,""gbError"Простите, но бумбокс временно не работает!");
				    //if(GetPlayerInterior(playerid) != 0) return SendClientMessage(playerid,-1,""gbError"Нельзя ставить boombox в интерьере!");
				    if(GetPVarInt(playerid, "PutBoombox") >= 1) return SendClientMessage(playerid,-1,""gbError"Нельзя ставить больше 1 boombox!");
                    new Float:BBCoord[4];
    				GetPlayerPos(playerid, BBCoord[0], BBCoord[1], BBCoord[2]);
    				GetPlayerFacingAngle(playerid, BBCoord[3]);
    				SetPVarInt(playerid, "PutBoombox", 1);
                    new Float:x,Float:y,Float:z;
					GetPlayerPos(playerid,x,y,z);
			        BBCoord[0] += (2 * floatsin(-BBCoord[3], degrees));
   					BBCoord[1] += (2 * floatcos(-BBCoord[3], degrees));
   					BBCoord[2] -= 1.0;
			        new bool:count = false;
					for(new i; i != MAX_OBJECTS_DROP; i ++) {
					    if(_objectInfo[i][objDrop][0] == 0 && _objectInfo[i][objDrop][1] == 0) {
					        _objectInfo[i][objDrop][0] = Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")];
						    _objectInfo[i][objDrop][1] = Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")];
						   	_objectInfo[i][objPos][0] = x;
						   	_objectInfo[i][objPos][1] = y;
					    	_objectInfo[i][objPos][2] = z;
					    	MeAction(playerid,"поставил(-а) что-то на землю",1);
			    			ApplyAnimation(playerid,"WUZI", "Wuzi_grnd_chk",4.0, 0, 1, 1, 0, 0, 1);
							_objectInfo[i][objText] = CreateDynamic3DTextLabel(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invName],0xFFFFFF50, _objectInfo[i][objPos][0],_objectInfo[i][objPos][1],_objectInfo[i][objPos][2] + 0.3, 2.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,0,-1,GetPlayerVirtualWorld(playerid));
                            _objectInfo[i][objObject] = CreateDynamicObject(
								_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invObject], 
								x, y, BBCoord[2], 0.0, 0.0, 0.0, GetPlayerVirtualWorld( playerid ), GetPlayerInterior( playerid ) );
							count = true;
							SetPVarInt(playerid, "PutBoomboxID", i + 1);
							BoxUse[i] = 1;
							//_objectInfo[i][MusicDelete] = playerid;
							break;
						}
					}
					if(GetPVarInt(playerid, "BBArea")) return SendClientMessage(playerid,-1,""gbError"У вас уже стоит бумбокс!");
					if(count == false) return SendClientMessage(playerid,-1,""gbError"Простите, но лимит на объекты исчерпан!");
					SetPVarInt(playerid, "BBArea", CreateDynamicSphere(x, y, BBCoord[2], 60.0, GetPlayerVirtualWorld(playerid), GetPlayerInterior(playerid)));
					SetPVarFloat(playerid, "BBX", x);
   			 		SetPVarFloat(playerid, "BBY", y);
    				SetPVarFloat(playerid, "BBZ", BBCoord[2]);
					Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
					SendClientMessage(playerid,C_GRAY,"Вы установили бумбокс. Для изменения радиостанции используйте - "cBLUE"/music"cWHITE".");

				}
				case 107:
				{
                    format(string,sizeof(string),"употребил(-а) %s",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invName]);
					MeAction(playerid,string,1);
				    ApplyAnimation(playerid,"SMOKING","M_smk_drag",4.1,0,0,0,0,0,1);
			    	SetPlayerDrunkLevel(playerid, GetPlayerDrunkLevel(playerid)+50000);
			    	SetPlayerWeather(playerid, 149);
			    	SetPVarInt(playerid,"EffectGone",_:SetTimerEx("EffectGone",600000,false,"d",playerid));
	           	 	Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
	           	 	new Float:HealthP;
					GetPlayerHealth(playerid, HealthP);
					SetPlayerHealth(playerid, HealthP + 80);

					SetPVarInt(playerid, "NarkEffect", 1);
				}
				case 113:
				{
				    if(IsPlayerInRangeOfPoint(playerid,10.0,354.3251,-2088.7981,7.8359) || IsPlayerInRangeOfPoint(playerid,10.0,362.3351,-2088.7979,7.8359) ||
				    IsPlayerInRangeOfPoint(playerid,10.0,367.0258,-2088.7979,7.8359) || IsPlayerInRangeOfPoint(playerid,10.0,369.7540,-2088.7981,7.8359) ||
				    IsPlayerInRangeOfPoint(playerid,10.0,374.0645,-2088.7969,7.8359) || IsPlayerInRangeOfPoint(playerid,10.0,383.3422,-2088.7974,7.8359) ||
				    IsPlayerInRangeOfPoint(playerid,10.0,390.2083,-2088.7983,7.8359) || IsPlayerInRangeOfPoint(playerid,10.0,396.6046,-2088.7979,7.8359) ||
				    IsPlayerInRangeOfPoint(playerid,10.0,403.5682,-2088.7976,7.8359) || IsPlayerInRangeOfPoint(playerid,10.0,409.2429,-2088.6521,7.8359) ||
				    IsPlayerInRangeOfPoint(playerid,10.0,848.5983,-2067.0613,12.8672) ||
					IsPlayerInRangeOfPoint(playerid,10.0,842.3860,-2066.9458,12.8672) ||
					IsPlayerInRangeOfPoint(playerid,10.0,834.8680,-2066.7813,12.8672) ||
					IsPlayerInRangeOfPoint(playerid,10.0,827.9201,-2066.7400,12.8672) ||
					IsPlayerInRangeOfPoint(playerid,10.0,822.7025,-2066.8269,12.8672) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2123.9187,200.9012,1.2027) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2120.2754,192.3841,1.1137) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2115.2820,177.3095,1.0042) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2111.2664,164.9935,1.4432) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2107.7646,150.1912,1.6234) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2114.3384,-96.2156,2.0707) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2121.5461,-94.8149,2.0707) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2118.9031,-89.5528,2.0707) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2181.5938,-163.7056,1.4800) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2178.5530,-155.9341,1.4800) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2183.7515,-159.1423,1.4800) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2347.8196,-2546.1006,1.6400) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2346.4968,-2530.4929,1.6400) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2346.9084,-2516.0146,1.6400) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2318.2864,-2452.3552,1.6400) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2289.6252,-2459.0647,1.6400) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2942.3811,-2051.5227,3.5480) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2933.0435,-2049.6165,3.5480) ||
					IsPlayerInRangeOfPoint(playerid,10.0,2932.7874,-2054.8372,3.5480) ||
					IsPlayerInRangeOfPoint(playerid,10.0,716.2957,-1702.7920,2.4297) ||
					IsPlayerInRangeOfPoint(playerid,10.0,716.6318,-1694.4417,2.4297) ||
					IsPlayerInRangeOfPoint(playerid,10.0,716.4900,-1628.6141,2.4297) ||
					IsPlayerInRangeOfPoint(playerid,10.0,716.3840,-1637.1311,2.4297)
				    )
        			{
        			   	new bool:cuff = false;
				    	for(new j; j != 48; j++) {
							if(Inv[playerid][invSlot][j] == 477) cuff = true;
						}
						if(!cuff) return SendClientMessage(playerid,C_GRAY,""gbError"У вас нет наживки!");

        			    for(new i; i != 22; i++) TextDrawHideForPlayer(playerid,invPlayer[i]);
			            for(new s; s != 61; s++) PlayerTextDrawHide(playerid,invSPlayer[playerid][s]);
			            SetPVarInt(playerid,"changeSlot",-1);
				        SetPVarInt(playerid,"selectSlot",-1);
				        switch(GetPVarInt(playerid,"UseSlots")) {
				        	case 0,1,7: {
				        		for(new i; i != 18; i++) PlayerTextDrawHide(playerid,slotUse[i][playerid]);
			            		for(new i; i != 3; i++) PlayerTextDrawHide(playerid,iconUse[i][playerid]);
				        	}
				        	case 2,3: {
				        		for(new i; i != 16; i ++) {
				        			TextDrawHideForPlayer(playerid,buyingShopFon[i]);
				        			PlayerTextDrawHide(playerid,buyingShopItems[i][playerid]);
				        			PlayerTextDrawHide(playerid,buyingShopInfo[i][playerid]);
				        		}
				        	}
				        	case 6:
				        	{
				        	    for(new i; i != 30; i ++) PlayerTextDrawHide(playerid,Warehouse[i][playerid]);
				        	    for(new i; i != 3; i++) PlayerTextDrawHide(playerid,iconUse[i][playerid]);
				        	}
				        }
			            for(new i = 48; i != 56; i++) PlayerTextDrawSetSelectable(playerid,invSPlayer[playerid][i], 1);
			            SetPVarInt(playerid, "PlayerMenuShow", 0);
			            //-----------Закрытие инвентаря-------------------------

			            for(new j; j != 48; j++)
						{
							switch(Inv[playerid][invSlot][j])
							{
								case 477:
								{
									if(Inv[playerid][invSlotKol][j] != 0)
									{
										Inv[playerid][invSlotKol][j] --;
										break;
									}
									else {
										Inv[playerid][invSlotKol][j] = 0;
										Inv[playerid][invSlot][j] = 0;
										break;
									}
								}
							}
						}
			            //------------------------------------------------------



			            //------------------------------------------------------
						for(new i; i < 2; i++) PlayerTextDrawShow(playerid, YNText[playerid][i]);
			   			KeyYN{playerid} = RandomEx(0, 2);
						if(!(playerFlags[playerid] & YN)) playerFlags[playerid] ^= YN;
						switch(KeyYN{playerid})
						{
							case 0: PlayerTextDrawSetString(playerid, YNText[playerid][1], "PRESS ~r~N");
							case 1: PlayerTextDrawSetString(playerid, YNText[playerid][1], "PRESS ~r~Y");
						}
						PlayerTextDrawHide(playerid, YNText[playerid][1]);
						PlayerTextDrawShow(playerid, YNText[playerid][1]);

						ApplyAnimation(playerid,"SWORD","sword_block",50.0 ,0,1,0,1,1);
						ApplyAnimation(playerid,"SWORD","sword_block",50.0 ,0,1,0,1,1);
						universalbar[playerid] = CreatePlayerProgressBar(playerid, 256.000000, 131.000000, 140.0, 12.0, 0xFFFFFFFF, 5);
				    	UpdatePlayerProgressBar(playerid, universalbar[playerid]);
				    	ShowPlayerProgressBar(playerid, universalbar[playerid]);
				    	SetPlayerProgressBarMaxValue(playerid, universalbar[playerid], 210);
				    	SetPlayerProgressBarValue(playerid, universalbar[playerid], 20);
				    	SetPVarInt(playerid, "CreateBarForPlayer", 1);
						UpdatePlayerProgressBar(playerid, universalbar[playerid]);
            			SetPlayerAttachedObject(playerid,5,18632,6,0.079376,0.037070,0.007706,181.482910,0.000000,0.000000,1.000000,1.000000,1.000000);
						SetPVarInt(playerid,"FishingStart",1);
            			SetPVarInt(playerid,"PlayerMenuShow",0);
						SetPVarInt(playerid,"UseSlots",-1);
					    CancelSelectTextDraw(playerid);
					    SetCameraBehindPlayer(playerid);
					}
					else return SendClientMessage(playerid,C_GRAY,""gbError"Вы находитесь не около пирса!");
				}
				case 111:
				{
				    if(GetPlayerInterior(playerid) != 0) return 1;
				    new bool:cuff = false;
			    	for(new j; j != 48; j++) {
						if(Inv[playerid][invSlot][j] == 470) cuff = true;
					}
					if(!cuff) return SendClientMessage(playerid,C_GRAY,""gbError"У вас нет спичек!");
					for(new j; j != 48; j++)
					{
						switch(Inv[playerid][invSlot][j])
						{
							case 470:
							{
								if(Inv[playerid][invSlotKol][j] != 0) Inv[playerid][invSlotKol][j] --;
								else {
									Inv[playerid][invSlotKol][j] = 0;
									Inv[playerid][invSlot][j] = 0;
								}
							}
						}
					}
				    new Float:p[4];
				    GetPlayerPos(playerid, p[0], p[1], p[2]);
					GetPlayerFacingAngle(playerid, p[3]);
				    SetPVarInt(playerid,"ObjectFireOne",_:CreateDynamicObject(1463, p[0] + 1.0 * -floatsin(p[3],degrees),p[1] + 1.0 * floatcos(p[3],degrees),p[2] - 0.970020, 0, 0, p[3]));
				    SetPVarInt(playerid,"ObjectFireTwo",_:CreateDynamicObject(18688, p[0] + 1.0 * -floatsin(p[3],degrees),p[1] + 1.0 * floatcos(p[3],degrees),p[2] - 1.9, 0, 0, p[3]));
					SetPVarInt(playerid,"ObjectFireStatus", 1);
					SetPVarFloat(playerid, "ObjectFireX",p[0]);
					SetPVarFloat(playerid, "ObjectFireY",p[1]);
					SetPVarFloat(playerid, "ObjectFireZ",p[2]);
				    ApplyAnimation(playerid,"BOMBER","BOM_Plant",4.0,0,0,0,0,0,0);
					SendClientMessage(playerid,C_GRAY,"Вы зажгли кастер, нажмите "cBLUE"ALT "cGRAY"чтобы потушить его!");
					Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;

				}
				case 104:
				{
				    SetPlayerSpecialAction(playerid, SPECIAL_ACTION_SMOKE_CIGGY);
				    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
				    format(string,sizeof(string),"взял(-а) %s",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invName]);
					MeAction(playerid,string,1);
					SetPVarInt(playerid, "CIGGYNIGGA", 1);
					SetPlayerDrunkLevel(playerid, 4000);

					SetPVarInt(playerid, "NarkEffect", 1);
				}
				case 101:
				{
				   	format(string,sizeof(string),"съел(-а) %s",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invName]);
					MeAction(playerid,string,1);
					Player[playerid][uHunger] = 100;
					Hunger(playerid, Player[playerid][uHunger]);
					if(Player[playerid][uSettings][2] == 1) Hunger(playerid,0);
					Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
				}
				
				case 35: { //387
				    switch(_itemsInfo[Inv[playerid][invSlot][50]][invObject]) {
						case 346: {
							weapon_exception{ playerid } = 3;
							
						    Inv[playerid][invSlotKol][50] += Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")];
						   
						    SetPlayerAmmo( playerid, GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][50]][invObject]), Inv[playerid][invSlotKol][50] );
						   /*givePlayerWeapon(
								playerid,
								GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][50]][invObject]),
								Inv[playerid][invSlotKol][50]
							);*/
							
						    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
                            SaveInventory(playerid);
						}
						case 347: {
							weapon_exception{ playerid } = 3;
						    Inv[playerid][invSlotKol][50] += Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")];
						    SetPlayerAmmo( playerid, GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][50]][invObject]), Inv[playerid][invSlotKol][50] );
						    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
						    SaveInventory(playerid);
						}
						default: SendClientMessage(playerid,C_GRAY,""gbError"Оружие которое вы хотите зарядить, должно быть в слоте!");
				    }
				}
				case 36: {
				    switch(_itemsInfo[Inv[playerid][invSlot][50]][invObject]) {
						case 348: {
							weapon_exception{ playerid } = 3;
							
						    Inv[playerid][invSlotKol][50] += Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")];
						    SetPlayerAmmo( playerid, GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][50]][invObject]), Inv[playerid][invSlotKol][50] );
						    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
						}
						default: SendClientMessage(playerid,C_GRAY,""gbError"Оружие которое вы хотите зарядить, должно быть в слоте!");
				    }
				}
				case 37: {
				    switch(_itemsInfo[Inv[playerid][invSlot][51]][invObject]) {
						case 349: {
							weapon_exception{ playerid } = 3;
							
						    Inv[playerid][invSlotKol][51] += Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")];
						    SetPlayerAmmo( playerid, GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][51]][invObject]), Inv[playerid][invSlotKol][51] );
						    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
						}
						default: SendClientMessage(playerid,C_GRAY,""gbError"Оружие которое вы хотите зарядить, должно быть в слоте!");
				    }
				}
				case 38: {
				    switch(_itemsInfo[Inv[playerid][invSlot][51]][invObject]) {
						case 352: {
							weapon_exception{ playerid } = 3;
						    Inv[playerid][invSlotKol][51] += Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")];
						    SetPlayerAmmo( playerid, GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][51]][invObject]), Inv[playerid][invSlotKol][51] );
						    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
						}
						case 353: {
							weapon_exception{ playerid } = 3;
						    Inv[playerid][invSlotKol][51] += Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")];
						    SetPlayerAmmo( playerid, GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][51]][invObject]), Inv[playerid][invSlotKol][51] );
						    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
						}
						case 372: {
							weapon_exception{ playerid } = 3;
						    Inv[playerid][invSlotKol][51] += Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")];
						    SetPlayerAmmo( playerid, GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][51]][invObject]), Inv[playerid][invSlotKol][51] );
						    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
						}
						default: SendClientMessage(playerid,C_GRAY,""gbError"Оружие которое вы хотите зарядить, должно быть в слоте!");
				    }
				}
				case 39: {
				    switch(_itemsInfo[Inv[playerid][invSlot][51]][invObject]) {
						case 355: {
							weapon_exception{ playerid } = 3;
						    Inv[playerid][invSlotKol][51] += Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")];
						    SetPlayerAmmo( playerid, GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][51]][invObject]), Inv[playerid][invSlotKol][51] );
						    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
						}
						case 357: {
							weapon_exception{ playerid } = 3;
						    Inv[playerid][invSlotKol][51] += Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")];
						    SetPlayerAmmo( playerid, GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][51]][invObject]), Inv[playerid][invSlotKol][51] );
						    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
						}
						default: SendClientMessage(playerid,C_GRAY,""gbError"Оружие которое вы хотите зарядить, должно быть в слоте!");
				    }
				}
				case 40: {
				    switch(_itemsInfo[Inv[playerid][invSlot][51]][invObject]) {
						case 356: {
							weapon_exception{ playerid } = 3;
						    Inv[playerid][invSlotKol][51] += Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")];
						    SetPlayerAmmo( playerid, GetWeaponToObject(_itemsInfo[Inv[playerid][invSlot][51]][invObject]), Inv[playerid][invSlotKol][51] );
						    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
						}
						default: SendClientMessage(playerid,C_GRAY,""gbError"Оружие которое вы хотите зарядить, должно быть в слоте!");
				    }
				}
				case 96: {
				    new Float:hp;
					GetPlayerHealth(playerid, hp);
				    setPlayerHealth(playerid, hp+50);
					ApplyAnimation(playerid,"ped","gum_eat",4.0,0,0,0,0,0,1);
					format(string,sizeof(string),"использовал(-а) %s",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invName]);
					MeAction(playerid,string,1);
	    			Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
				}
				case 42 .. 48,82 .. 84,147: {
					format(string,sizeof(string),"съел(-а) %s",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invName]);
					MeAction(playerid,string,1);
					switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invID]) {
						case 42,83,84: Player[playerid][uHunger] += 20;
						case 43: Player[playerid][uHunger] += 25;
						case 44: Player[playerid][uHunger] += 20;
						case 45: Player[playerid][uHunger] += 50;
						case 46: Player[playerid][uHunger] += 50;
						case 47: Player[playerid][uHunger] += 60;
						case 48,82: Player[playerid][uHunger] += 70;
						case 147: Player[playerid][uHunger] += 10;
					}
					if(Player[playerid][uHunger] > 100) Player[playerid][uHunger] = 100;
					if(Player[playerid][uSettings][2] == 1) Hunger(playerid,0);
					new Float:hp;
					GetPlayerHealth(playerid,hp);
					if(hp >= 100.0) setPlayerHealth(playerid,100.0);
					else setPlayerHealth(playerid,hp + 5.0);
					ApplyAnimation(playerid,"FOOD","EAT_Burger", 2.0,0,0,0,0,5000,1);
					Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
				}
				case 41,53 .. 59,85 .. 88: {
					if(GetPVarInt(playerid,"PlayerUseBox") != 0) return SendClientMessage(playerid,C_GRAY,""gbError"У вас уже есть что-то в руках!");
					PlayerUseDrink[playerid] = Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")];
					SetPVarInt(playerid,"PlayerUseBox",6);
					SetPlayerAttachedObject(playerid,9,_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invObject],5,0.126999,0.016998,-0.010999,5.099999,-175.499862,1.399999,1.000000,1.000000,1.000000);
					Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
				}
				case 74,89: {
					for(new i = 1; i <= MAX_VEHICLES; i++ ) 
					{
						if(!IsValidVehicle(i)) continue;
						new Float:p[3];
						GetVehiclePos(i,p[0],p[1],p[2]);
						if(IsPlayerInRangeOfPoint(playerid, 4.0, p[0], p[1], p[2])) {
							new Float:hp;
							GetVehicleHealth(i,hp);
							if(hp > 400.0) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но Ваш автомобиль уже в состоянии завестись, езжайте в СТО!");
							else 
							{
							    setVehicleHealth(i,500.0);
							    SendClientMessage(playerid,C_GRAY,""gbAccess"Вы использовали ящик с инструментами, теперь вы можете доехать до СТО!");
							    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
							}
							break;
						}
					}
				}
				case 75,77 .. 80, 110, 117, 118: {
					if(GetPlayerVirtualWorld(playerid) != 0) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но тут запрещена установка объектов!");
					if(GetPlayerInterior(playerid) != 0) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но тут запрещена установка объектов!");
					if(IsPlayerInAnyVehicle(playerid)) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но тут запрещена установка объектов!");
					new Float:p[4];
					GetPlayerPos(playerid,p[0],p[1],p[2]);
					GetPlayerFacingAngle(playerid,p[3]);
					if(Border::[playerid][bStatus] == false)
					{
						switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invObject]) {
							case 2899: Border::[playerid][bObjects] = CreateDynamicObject(2899, p[0] + 1.0 * -floatsin(p[3],degrees),p[1] + 1.0 * floatcos(p[3],degrees),p[2] - 0.9, 0, 0, p[3]),Border::[playerid][bObject] = 2899;
							case 1237: Border::[playerid][bObjects] = CreateDynamicObject(1237, p[0] + 1.0 * -floatsin(p[3],degrees),p[1] + 1.0 * floatcos(p[3],degrees),p[2] - 0.9, 0, 0, p[3]),Border::[playerid][bObject] = 1237;
							case 1423: Border::[playerid][bObjects] = CreateDynamicObject(1423, p[0] + 1.0 * -floatsin(p[3],degrees),p[1] + 1.0 * floatcos(p[3],degrees),p[2] - 0.3, 0, 0, p[3]),Border::[playerid][bObject] = 1423;
							case 1425: Border::[playerid][bObjects] = CreateDynamicObject(1425, p[0] + 1.0 * -floatsin(p[3],degrees),p[1] + 1.0 * floatcos(p[3],degrees),p[2] - 0.5, 0, 0, p[3]),Border::[playerid][bObject] = 1425;
							case 1459: Border::[playerid][bObjects] = CreateDynamicObject(1459, p[0] + 1.0 * -floatsin(p[3],degrees),p[1] + 1.0 * floatcos(p[3],degrees),p[2] - 0.5, 0, 0, p[3]),Border::[playerid][bObject] = 1459;
							case 1481: Border::[playerid][bObjects] = CreateDynamicObject(1481, p[0] + 1.0 * -floatsin(p[3],degrees),p[1] + 1.0 * floatcos(p[3],degrees),p[2] - 0.319996, 0, 0, p[3]), Border::[playerid][bObject] = 1481;
							case 1255: Border::[playerid][bObjects] = CreateDynamicObject(1255, p[0] + 1.0 * -floatsin(p[3],degrees),p[1] + 1.0 * floatcos(p[3],degrees),p[2] - 0.439987, 0, 0, p[3]), Border::[playerid][bObject] = 1255;
							case 1646: Border::[playerid][bObjects] = CreateDynamicObject(1646, p[0] + 1.0 * -floatsin(p[3],degrees),p[1] + 1.0 * floatcos(p[3],degrees),p[2] - 0.900001, 0, 0, p[3]), Border::[playerid][bObject] = 1646;
						}
						Border::[playerid][bP][0] = p[0];
						Border::[playerid][bP][1] = p[1];
						Border::[playerid][bP][2] = p[2];
						Border::[playerid][bStatus] = true;
						Border::[playerid][bMember] = Player[playerid][uMember];
						ApplyAnimation(playerid,"BOMBER","BOM_Plant",4.0,0,0,0,0,0,0);
						SendClientMessage(playerid,C_GRAY,"Вы установили объект, нажмите "cBLUE"ALT "cGRAY"чтобы поднять его!");
						SendClientMessage(playerid,C_GRAY,""gbInfo"Можно установить только один объект.");
						SendClientMessage(playerid,C_GRAY,""gbInfo"Если Вы ставили объект до этого, лучше поднемите его, иначе не сможете восстановить!");
						Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
						MeAction(playerid,"установил(-а) объект",1);
					}
					else
					{
						DestroyDynamicObject(Border::[playerid][bObjects]);
						Border::[playerid][bP][0] = 0.0;
						Border::[playerid][bP][1] = 0.0;
						Border::[playerid][bP][2] = 0.0;
						Border::[playerid][bStatus] = false;
						Border::[playerid][bMember] = 0;
					}
				}
				case 81: {
					for(new i = 1; i <= MAX_VEHICLES; i++ ) {
						if(!IsValidVehicle(i)) continue;
						new Float:p[3];
						GetVehiclePos(i,p[0],p[1],p[2]);
						if(IsPlayerInRangeOfPoint(playerid, 4.0, p[0], p[1], p[2])) {
							V::[i][vFuel] += 20;
							if(V::[i][vFuel] >= MaxVehicleFuel[GetVehicleModel(i) - 400]) V::[i][vFuel] = MaxVehicleFuel[GetVehicleModel(i) - 400];
							SendClientMessage(playerid,C_GRAY,""gbAccess"Вы заправили транспорт при помощи канистры!");
							Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
							break;
						}
					}
				}
				case 91: CallLocalFunction( "cmd_pass", "i", playerid );

				case 152: {// Игральные кости

				    return CallLocalFunction( "cmd_dice", "i", playerid );
				}
				case 154, 155: {//Сигарета
				    CallLocalFunction( "cmd_smoke", "i", playerid );
					return HideInventory( playerid );
				}
				case 156: {
				    if( GetPVarInt( playerid, "use_slot_9" ) ) {
						if( GetPVarInt( playerid, "use_slot_9" ) != 156 ) return SendClientMessage( playerid, C_GRAY, ""gbError"Вы не можете использовать этот предмет, т.к уже используете другой" );
                        RemovePlayerAttachedObject( playerid, 9 );
                        DeletePVar( playerid, "use_slot_9" );
						return true;
				    }
				    SetPlayerAttachedObject( playerid, 9, 19319, 1, 0.090999, -0.096000, 0.000000,  -3.100006, 64.099906, -2.400009, 0.877000, 1.000000, 0.865001 );
					SendClientMessage( playerid, C_GRAY, ""gbInfo"Вы одели на себя электрогитару" );
					SetPVarInt( playerid, "use_slot_9", 156 );
					return true;
				}
				case 158: {
				    if( GetPVarInt( playerid, "use_slot_9" ) ) {
                        if( GetPVarInt( playerid, "use_slot_9" ) != 158 ) return SendClientMessage( playerid, C_GRAY, ""gbError"Вы не можете использовать этот предмет, т.к уже используете другой" );
						RemovePlayerAttachedObject( playerid, 9 );
                        DeletePVar( playerid, "use_slot_9" );
				        return true;
				    }
				    SetPlayerAttachedObject( playerid, 9, 19624, 6, 0.000000, 0.000000, 0.007000,  1.900000, -102.500030, 0.000000, 1.000000, 1.000000, 1.000000 );
					SendClientMessage( playerid, C_GRAY, ""gbInfo"Вы взяли в руку Чемодан торговца " );
					SetPVarInt( playerid, "use_slot_9", 158 );
					return true;
				}
				// Premium Inv
			}
			
			if(Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] <= 0) {
			    format(string,sizeof(string),""gbAccess"Вы использовали - "cBLUE"%s"cWHITE".",_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invName]);
			    SendClientMessage(playerid,C_WHITE,string);
                Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
                Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] = 0;
                PlayerTextDrawSetPreviewModel(playerid, invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")], 19464);
				PlayerTextDrawSetPreviewRot(playerid, invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")], 0.000000, 0.000000, 90.000000, 0.100000);
				PlayerTextDrawShow(playerid,invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")]);
				SaveInventory(playerid);
                SetPVarInt(playerid,"selectSlot",-1);
				SetPVarInt(playerid,"changeSlot",-1);
			}
        }
	}
	if(clickedid == invPlayer[17])
	{
		if( GetPVarInt(playerid,"selectSlot") == -1 )
			return 1;
			
		if(GetPVarInt(playerid,"selectSlot") == 48 || GetPVarInt(playerid,"selectSlot") == 49 || GetPVarInt(playerid,"selectSlot") == 50 ||
		GetPVarInt(playerid,"selectSlot") == 51 || GetPVarInt(playerid,"selectSlot") == 52 || GetPVarInt(playerid,"selectSlot") == 53 ||
		GetPVarInt(playerid,"selectSlot") == 54 || GetPVarInt(playerid,"selectSlot") == 55) return SendClientMessage(playerid,C_GRAY,""gbError"Сначала снимите предмет с используемого слота!");
        if(Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] == 0 && Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] == 0) return 1;
    	switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invID]) {
    		case 65 .. 80,90,91,97,98..107, 471, 472, 475, 477..482, 109, 110..123,145,146,147,162,163: return SendClientMessage(playerid,C_GRAY,""gbError"Данный предмет нельзя выкидывать/передавать/складывать!");
			case 152: return SendClientMessage(playerid,C_GRAY,""gbError"Данный предмет нельзя выкидывать!");
		}
        if(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invObject] == 3435 ||
        _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invObject] == 2684 ||
        _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invObject] == 19054 ||
        _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invObject] == 19055 ||
        _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invObject] == 19057) return SendClientMessage(playerid,C_GRAY,""gbError"Данный предмет можно только использовать или передавать.");
		new Float:x,Float:y,Float:z,Float:kg;
		GetPlayerPos(playerid,x,y,z);

		new bool:count = false, om = -1;
		for(new i; i != MAX_OBJECTS_DROP; i ++)
		{
		    if(_objectInfo[i][objDrop][0] == 0 && _objectInfo[i][objDrop][1] == 0)
			{
		        _objectInfo[i][objDrop][0] = Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")];
			    _objectInfo[i][objDrop][1] = Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")];
			   	_objectInfo[i][objPos][0] = x;
			   	_objectInfo[i][objPos][1] = y;
		    	_objectInfo[i][objPos][2] = z;
		    	//MeAction(playerid,"выкинул(-а) что-то на землю",1);
    			//ApplyAnimation(playerid,"WUZI", "Wuzi_grnd_chk",4.0, 0, 1, 1, 0, 0, 1);
    			switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invObject])
				{
		    	    case 0 .. 299: {
						SetPVarInt( playerid, "dr_object", CreateDynamicObject( 2386, _objectInfo[i][objPos][0],_objectInfo[i][objPos][1],_objectInfo[i][objPos][2]-1, 0.0, 0.0, 0.0, GetPlayerVirtualWorld( playerid ), GetPlayerInterior( playerid ) ) );
						om = 2386;
					}
     				case 19319: {
					    if( GetPVarInt( playerid, "use_slot_9" ) == 156 ) return SendClientMessage( playerid, C_GRAY, ""gbError"Вы не можете выкинуть предмет вы его используете!" );
                        SetPVarInt( playerid, "dr_object", CreateDynamicObject( _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invObject], _objectInfo[i][objPos][0],_objectInfo[i][objPos][1],_objectInfo[i][objPos][2]-1, 80.0, 0.0, 0.0, GetPlayerVirtualWorld( playerid ), GetPlayerInterior( playerid ) ) );
					}
				 	case 19624: {
                        if( GetPVarInt( playerid, "use_slot_9" ) == 158 ) return SendClientMessage( playerid, C_GRAY, ""gbError"Вы не можете выкинуть предмет вы его используете!" );
                        SetPVarInt( playerid, "dr_object", CreateDynamicObject( _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invObject], _objectInfo[i][objPos][0],_objectInfo[i][objPos][1],_objectInfo[i][objPos][2]-1, 80.0, 0.0, 0.0, GetPlayerVirtualWorld( playerid ), GetPlayerInterior( playerid ) ) );

					}
					default: {
						SetPVarInt( playerid, "dr_object", CreateDynamicObject( _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invObject], _objectInfo[i][objPos][0],_objectInfo[i][objPos][1],_objectInfo[i][objPos][2]-1, 80.0, 0.0, 0.0, GetPlayerVirtualWorld( playerid ), GetPlayerInterior( playerid ) ) );
						om = _itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invObject];
					}
				}
				
				SetPVarInt( playerid, "dr_id", i );
				SetPVarInt( playerid, "dr_name", Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] );
				SetPVarInt( playerid, "dr_model", om );
		    	//MeAction(playerid,"выкинул(-а) что-то на землю",1);
    			//ApplyAnimation(playerid,"WUZI", "Wuzi_grnd_chk",4.0, 0, 1, 1, 0, 0, 1);
				//_objectInfo[i][objText] = CreateDynamic3DTextLabel(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invName],0xFFFFFF50, _objectInfo[i][objPos][0],_objectInfo[i][objPos][1],_objectInfo[i][objPos][2] - 1,2.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,0,-1,GetPlayerVirtualWorld(playerid));
				count = true;
				break;
			}
		}
		if(count == false) return SendClientMessage(playerid,-1,""gbError"Простите, но лимит на объекты исчерпан!");

		Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] = 0;
 	    Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] = 0;
 	    PlayerTextDrawSetPreviewModel(playerid, invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")], 19464);
		PlayerTextDrawSetPreviewRot(playerid, invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")], 0.000000, 0.000000, 90.000000, 0.100000);
		PlayerTextDrawShow(playerid, invSPlayer[playerid][GetPVarInt(playerid,"selectSlot")]);
        for(new i; i != 56; i++) kg += _itemsInfo[Inv[playerid][invSlot][i]][invKg];
        format(string,sizeof(string),"~y~%s~n~~w~%.1f/%d.0kg",Player[playerid][uName],kg,20 + Player[playerid][uJobDouble][6]);
		PlayerTextDrawSetString(playerid,invSPlayer[playerid][58],string);
		SaveInventory(playerid);
		HideInventory( playerid );
 	    SetPVarInt(playerid,"selectSlot",-1);
 	    SetPVarInt(playerid,"changeSlot",-1);
 	    Streamer_UpdateEx( playerid, x, y, z );
 	    EditDynamicObject( playerid, GetPVarInt( playerid, "dr_object" ) );
	}
	if(clickedid == invPlayer[19]) 
	{
		if( GetPVarInt(playerid,"selectSlot") == -1 )
			return 1;
			
		if(GetPVarInt(playerid,"selectSlot") == 48 || GetPVarInt(playerid,"selectSlot") == 49 || GetPVarInt(playerid,"selectSlot") == 50 ||
		GetPVarInt(playerid,"selectSlot") == 51 || GetPVarInt(playerid,"selectSlot") == 52 || GetPVarInt(playerid,"selectSlot") == 53 ||
		GetPVarInt(playerid,"selectSlot") == 54 || GetPVarInt(playerid,"selectSlot") == 55) return SendClientMessage(playerid,C_GRAY,""gbError"Сначала снимите предмет с используемого слота!");
		if(Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")] == 0 && Inv[playerid][invSlotKol][GetPVarInt(playerid,"selectSlot")] == 0) return 1;
		switch(_itemsInfo[Inv[playerid][invSlot][GetPVarInt(playerid,"selectSlot")]][invID]) {
    		case 65 .. 80,90,91,97,103,340,462: return SendClientMessage(playerid,C_GRAY,""gbError"Данный предмет нельзя выкидывать/передавать/складывать!");
            case 158: {
            	if( GetPVarInt( playerid, "use_slot_9" ) == 158 ) return SendClientMessage( playerid, C_GRAY, ""gbError"Вы не можете передать предмет вы его используете!" );
			}
			case 156: {
            	if( GetPVarInt( playerid, "use_slot_9" ) == 156 ) return SendClientMessage( playerid, C_GRAY, ""gbError"Вы не можете передать предмет вы его используете!" );
			}
		}
		showPlayerDialog(playerid,d_inventory,1," ","{ffffff}Введите ID человека, которому хотите передать предмет:\n\n"cGREEN"| Человек должен находиться рядом с вами.","Далее","Закрыть");
	}
	if(clickedid == dalnmenu[3]) {
	    SetPVarInt(playerid,"PlayerSelectTrailer",1);
	    if(MebelZavod == 0) warningtext = "~n~~n~~r~Внимание!~n~Нет мебели на заводе!";
	    format(string,sizeof(string),"~w~Маршрут:~n~~y~Мебельный завод <> Склад~n~~n~~w~Описание:~n~~y~Выбрав этот прицеп, ~n~вы будете перевозить мебель ~n~с завода мебели на склад.%s",warningtext);
    	PlayerTextDrawSetString(playerid,dalnmenuplayer[playerid],string);
	}
	if(clickedid == dalnmenu[4]) {
	    SetPVarInt(playerid,"PlayerSelectTrailer",2);
	    if(ToplivoZavod == 0) warningtext = "~n~~n~~r~Внимание!~n~Нет топлива на заводе!";
	    format(string,sizeof(string),"~w~Маршрут:~n~~y~Топливный завод <> Заправки~n~~n~~w~Описание:~n~~y~Выбрав этот прицеп, вы будете ~n~осуществлять перевозку топлива~n~ с топливного завода на заправки и предприятия которые ~n~его используют.%s",warningtext);
     	PlayerTextDrawSetString(playerid,dalnmenuplayer[playerid],string);
	}
	if(clickedid == dalnmenu[6]) {
	    SetPVarInt(playerid,"PlayerSelectTrailer",4);
	    if(S::[0][wsWoodsSklad] == 0) warningtext = "~n~~n~~r~Внимание!~n~Нет дерева на лесопилке!";
	    format(string,sizeof(string),"~w~Маршрут:~n~~y~Лесопилка <> Завод мебели~n~~n~~w~Описание:~n~~y~Выбрав этот прицеп, ~n~вы будете осуществлять перевозку ~n~дерева на завод мебели.%s",warningtext);
     	PlayerTextDrawSetString(playerid,dalnmenuplayer[playerid],string);
	}
	if(clickedid == dalnmenu[8]) {
	    if(IsTrailerAttachedToVehicle(D::[playerid][dDalnKey])) return SendClientMessage(playerid,C_GRAY,""gbError"К вашему тягачу уже подцеплен прицеп.");
	    if(D::[playerid][dDalnKey] == -1) return SendClientMessage(playerid,C_GRAY,""gbError"Вашего тягача нет рядом с местом загрузки.");
        if(GetVehicleModel(D::[playerid][dDalnKey]) == 403 || GetVehicleModel(D::[playerid][dDalnKey]) == 514 || GetVehicleModel(D::[playerid][dDalnKey]) == 515) {
			if(PlayerTrailer[playerid] != -1) return SendClientMessage(playerid,C_GRAY,""gbInfo"Вам в аренду уже выдали прицеп, подцепите его тягачом.");
	    	switch(GetPVarInt(playerid,"PlayerSelectTrailer")) {
	        	case 1: if(MebelZavod == 0) return SendClientMessage(playerid,C_GRAY,""gbError"На заводе мебели кончилась мебель.");
	        	case 2: 
				{
					if( ToplivoZavod == 0 ) 
						return SendClientMessage(playerid, C_WHITE,""gbError"На заводе топлива кончилось топливо.");
						
					new bool:count = false;
					for(new i; i != 15; i ++) 
					{
					    if( Fuel::[i][bCount] != 0 )
						{
							count = true;
							break;
					    }
					}
					
					if( !count ) 
					{
						return SendClientMessage(playerid, C_WHITE,""gbError"Простите, но нет заказов на развозку топлива!");
					}
	        	}
				case 4: if(S::[0][wsWoodsSklad] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"На лесопилке кончилось дерево.");
	        	default: return 0;
	    	}
			for(new i;i<10;i++)
			{
				if(gTruckLoadTurn[0][i] == INVALID_PLAYER_ID)
				{
					gTruckLoadTurn[0][i] = playerid;
					format(string,sizeof(string),"Вы номер %d в очереди на загрузку",i+1);
					SendClientMessage(playerid, -1, string);
					SetPVarInt(playerid,"truckonroad",0);
					SetPVarInt(playerid,"waitgruz",0);
					break;
				}
			}
		}
		else return SendClientMessage(playerid,C_GRAY,""gbError"Транспортное средство выданное вам должно быть рядом.");
	}
	if(clickedid == phoneOne[23] || clickedid == phoneTwo[11] || clickedid == phoneThree[10])  {
		if(Player[playerid][uNumber] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"У вас нет сим-карты в вашем телефоне!");
		new str[128];
		string = "";
		for(new i; i != 10; i ++) {
			if(Player[playerid][uContacts][i] != 0) {
				format(str,sizeof(str),"%i. "cGRAY"%s Номер: %d\n",i + 1,phoneName[playerid][i],Player[playerid][uContacts][i]);
				strcat(string,str);
			}
			else strcat(string,"{d3d3d3}- Пусто\n");
		}
		showPlayerDialog(playerid,d_phone + 2,2,"Контакты",string,"Далее","Закрыть");
	}
	if(clickedid == phoneOne[24] || clickedid == phoneTwo[9] || clickedid == phoneThree[9]) {
		format(string,sizeof(string),"{ffffff}1. "cGRAY"Показывать объявления - %s\n{ffffff}2. "cGRAY"Радио - %s",Player[playerid][uSettings][4] ? (""cGREEN"Да") : (""cRED"Нет"), Player[playerid][uRadio] ? (""cGREEN"Да") : (""cRED"Нет"));
		showPlayerDialog(playerid,d_phone + 14,2,"Настройки",string,"Далее","Закрыть");
	}
	if(clickedid == phoneOne[25] || clickedid == phoneTwo[10] || clickedid == phoneThree[12]) {
		if(Player[playerid][uNumber] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"У вас нет сим-карты в вашем телефоне!");
		showPlayerDialog(playerid,d_phone + 6,2,"Сообщения","1. "cGRAY"Входящие сообщения{ffffff}\n2. "cGRAY"Исходящие сообщения{ffffff}\n3. "cGRAY"Отправить сообщение","Далее","Закрыть");
	}
	if(clickedid == phoneOne[26] || clickedid == phoneTwo[8] || clickedid == phoneThree[11]) {
		if(Player[playerid][uNumber] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"У вас нет сим-карты в вашем телефоне!");
		showPlayerDialog(playerid,d_phone,2,"Набрать номер","1. "cGRAY"Набрать новый номер{ffffff}\n2. "cGRAY"Номера сервисных служб\n{ffffff}3. "cGRAY"Телефонная книга","Далее","Закрыть");
	}
	if(clickedid == phoneOne[27] || clickedid == phoneTwo[12] || clickedid == phoneThree[17]) hidePhone(playerid);
	
	
   	
	return 1;
}


public OnPlayerText(playerid,text[]) 
{
	return 0;
}

public OnPlayerPressButton(playerid,buttonid) {
	if(buttonid == gDoorsButton[0] || buttonid == gDoorsButton[1]) {
		if(Player[playerid][uMember] != 2) return SendClientMessage(playerid,C_GRAY,""gbError"У вас нет ключа для открытия данной двери!");
		MoveDynamicObject(gDoors[0], 1552.25488, -1671.65527, 1099.50562, 1.0,0.00000, 0.00000, 0.00000);
		SetTimerEx("CloseDoors",10000,false,"i",0);
	}
	if(buttonid == gDoorsButton[2] || buttonid == gDoorsButton[3]) {
		if(Player[playerid][uMember] != 2) return SendClientMessage(playerid,C_GRAY,""gbError"У вас нет ключа для открытия данной двери!");
		MoveDynamicObject(gDoors[1], 1552.23499, -1682.53528, 1099.50562, 1.0,0.00000, 0.00000, 0.00000);
		SetTimerEx("CloseDoors",10000,false,"i",1);
	}
	if(buttonid == gDoorsButton[4] || buttonid == gDoorsButton[5]) {
		if(Player[playerid][uMember] != 2) return SendClientMessage(playerid,C_GRAY,""gbError"У вас нет ключа для открытия данной двери!");
		MoveDynamicObject(gDoors[2], 1552.85889, -1686.27502, 1098.23999, 1.0, 0.00000, 0.00000, 90.00000);
		SetTimerEx("CloseDoors",10000,false,"i",2);
	}
	if(buttonid == gDoorsButton[8] || buttonid == gDoorsButton[9]) {
		if(Player[playerid][uMember] != 2) return SendClientMessage(playerid,C_GRAY,""gbError"У вас нет ключа для открытия данной двери!");
		MoveDynamicObject(gDoors[4], 1577.08997, -1686.29504, 1098.23999, 1.0, 0.00000, 0.00000, 90.00000);
		SetTimerEx("CloseDoors",10000,false,"i",4);
	}
	if(buttonid == gDoorsButton[6] || buttonid == gDoorsButton[7]) {
		if(Player[playerid][uMember] != 8) return SendClientMessage(playerid,C_GRAY,""gbError"У вас нет ключа для открытия данной двери!");
		MoveDynamicObject(gDoors[3], 244.2880,72.5611,1002.6413,1.0,0.0,0.0,0.0);
		SetTimerEx("CloseDoors",10000,false,"i",3);
	}
	return 1;
}

forward GameModeExitDelay();
public GameModeExitDelay() {
	GameModeExit();
}

forward ModePlanRestart();
public ModePlanRestart()
{
	GameModeExit();
}

forward ClearBackup(playerid);
public ClearBackup(playerid) {
	if(GetPVarInt(playerid,"playerUseBackup") != 0) {
	    SendClientMessage(playerid,C_GRAY,""gbInfo"Выше время на ожидание подмоги закончилось.");
	    SetPVarInt(playerid,"playerUseBackup",0);
	    foreach(new i : Player) {
	        switch(Player[playerid][uMember]) {
	            case 1,2: SetPlayerMarkerForPlayer(i, playerid, FracColor[Player[i][uMember]]);
	        }
	    }
	    if(Player[playerid][uIsPlayerJob][0] == 1) SetPlayerColor(playerid,FracColor[Player[playerid][uMember]]);
	}
	return 1;
}

forward CloseDoors(id);
public CloseDoors(id) {
	switch(id) {
		case 0: MoveDynamicObject(gDoors[0],1553.51501, -1671.65527, 1099.50562,1.0,0.00000, 0.00000, 0.00000);
		case 1: MoveDynamicObject(gDoors[1],1553.51501, -1682.53528, 1099.50562,1.0,0.00000, 0.00000, 0.00000);
		case 2: MoveDynamicObject(gDoors[2],1552.85889, -1684.95496, 1098.23999,1.0,0.00000, 0.00000, 90.00000);
		case 3: MoveDynamicObject(gDoors[3],245.6280, 72.5611, 1002.6413,1.0, 0.0,0.0,0.0);
		case 4: MoveDynamicObject(gDoors[4],1577.08997, -1684.97498, 1098.23999,1.0, 0.00000, 0.00000, 90.00000);
	}
}

forward WoodsPlayer(playerid,wood,selected);
public WoodsPlayer(playerid,wood,selected) {
	new j = GetPVarInt(playerid,"WoodDrop");
	switch(selected) {//-462.9798,-88.4665,59.9006
	    case 0: {
	        WD::[j][woodIsDrop] = true;
	        WD::[j][woodUse] = false;
	        MoveDynamicObject(WD::[j][woodObject],WoodsDrop[j][0],WoodsDrop[j][1],WoodsDrop[j][2] - 0.05, 0.05, WoodsDrop[j][3],WoodsDrop[j][4],WoodsDrop[j][5]);
	        SendClientMessage(playerid,C_GRAY,""gbInfo"Чтобы напилить ещё дров, подойдите к основанию дерева.");
            RemovePlayerAttachedObject(playerid,9);
			SetPlayerAttachedObject(playerid,9,1463,5,0.073999,0.186000,0.105998,95.299972,-175.499984,-72.199935,0.540999,0.350999,0.610999);
	        SetPlayerSpecialAction(playerid, SPECIAL_ACTION_CARRY);
			SetPVarInt(playerid,"PlayerUseBox",5);
            WD::[j][woodCount] -= 25;
			SetPVarInt(playerid,"WoodCheckpointTop",_:SetPlayerCheckpoint(playerid,-462.9798,-88.4665,59.9006,1.0));
	    }
	    case 1: {
            RemovePlayerAttachedObject(playerid,9);
			SetPlayerAttachedObject(playerid,9,1463,5,0.073999,0.186000,0.105998,95.299972,-175.499984,-72.199935,0.540999,0.350999,0.610999);
	        SetPlayerSpecialAction(playerid, SPECIAL_ACTION_CARRY);
	        SetPVarInt(playerid,"PlayerUseBox",5);
	        SetPVarInt(playerid,"WoodCheckpointTop",_:SetPlayerCheckpoint(playerid,-462.9798,-88.4665,59.9006,1.0));
	        if(WD::[j][woodCount] == 0) {
		   		DestroyDynamicObject(WD::[j][woodObject]);
    		}
	    }
	}
	togglePlayerControllable(playerid,true);
	DeletePVar(playerid,"WoodDrop");
	return 1;
}

forward WoodStanok(playerid);
public WoodStanok(playerid) {
	SetPVarInt(playerid,"PlayerStanok",1);
	SendClientMessage(playerid,C_GRAY,""gbInfo"Ваша древесина прошла обработку, заберите её с конвеера.");
	DeletePVar(playerid,"TimerStanok");
	return 1;
}

forward VehicleToPoint(Float:radi, vehicleid, Float:x, Float:y, Float:z);
public VehicleToPoint(Float:radi, vehicleid, Float:x, Float:y, Float:z) {
	new Float:oldposx, Float:oldposy, Float:oldposz;
	new Float:tempposx, Float:tempposy, Float:tempposz;
	GetVehiclePos(vehicleid, oldposx, oldposy, oldposz);
	tempposx = (oldposx -x);
	tempposy = (oldposy -y);
	tempposz = (oldposz -z);
	if (((tempposx < radi) && (tempposx > -radi)) && ((tempposy < radi) && (tempposy > -radi)) && ((tempposz < radi) && (tempposz > -radi))) return 1;
	return 0;
}

function ClearAnimationsDelay(playerid) ApplyAnimation(playerid,"ped","IDLE_chat",4.1,1,0,0,0,1,1);


function OnMinuteTimer() 
{
	callHouse();
    foreach (new playerid : Player) 
	{
		new afk = getData( playerid, "PlayerAFK");
    	if( Player[playerid][uMute] > 0) Player[playerid][uMute]--;
    	if( Player[playerid][uBMute] > 0) Player[playerid][uBMute]--;
	

		if( Player[playerid][uHunger] >= 1 && afk <= 0 && !GetAccessAdmin( playerid, 1 )) 
		{
			Player[playerid][uHunger]--;
			if( Player[playerid][uSettings][2] == 1 ) Hunger( playerid, 0 );
			else Hunger(playerid, Player[playerid][uHunger]);
		}
		else if( afk <= 0 ) 
		{
			setPlayerHealth( playerid, Player[playerid][uHP] - 2.0 );
		}
		
		if( afk > 2400 && !GetAccessAdmin( playerid, 1 ) ) 
		{ 
			AntiCheatKick( playerid, "AFK", true, false );
			continue;
		}
		
		if( GetPlayerState( playerid ) == PLAYER_STATE_DRIVER) UpdateFuelBar( playerid, GetPlayerVehicleID(playerid) );
		prisonTimer( playerid );
		PlayerCountMinute[playerid] ++;
		
		if( !IsAfk( playerid ) )
		{
			Player[playerid][uPayTime]++;
			if(Player[playerid][uPayTime] >= 60) 
			{
				payDay( playerid );
			}
		}
		
        if( D::[playerid][dRentVehicleTime] && D::[playerid][dRentVehicleID] ) {
			D::[playerid][dRentVehicleTime] --;
		 	if( D::[playerid][dRentVehicleTime] <= 0 ) {
		 	    SendMes( playerid, -1, ""gbInfo"Время аренды истекло, хотите продлить?");
				RemovePlayerFromVehicle(playerid);
				SetVehicleToRespawn(D::[playerid][dRentVehicleID]);
			}
		}
        if( Player[playerid][uDMJail] > 0 ) {
			Player[playerid][uDMJail]--;
			if( Player[playerid][uDMJail] == 0 ) {
				Player[playerid][uDMJail] = 0;
				nowUpdateInfo( playerid , "d" , "gb_users" , "uName" , "uDMJail" , Player[playerid][uDMJail] );
				SendClientMessage( playerid, C_GRAY, ""gbAccess"Вы отсидели свой срок в Де Моргане." );
				SetPlayerInterior( playerid, 0 );
				SetPlayerVirtualWorld( playerid, 0 );
				setPlayerPos( playerid, 1543.9922, -1669.7343, 13.5575 );
			}
		}
    }
	
    for(new i; i != MAX_VEHICLES; i ++) 
	{
    	if( !IsValidVehicle( i ) ) 
			continue;
			
    	GetVehicleParamsEx( i, eng, light, other1, other2, other3, other4, other5 );
		
    	if( eng == 1 ) 
		{
    		V::[i][vFuel] -= 0.5;
			
    		if( V::[i][vFuel] == 0.0 ) 
			{
				SetVehicleParamsEx( i, false, light, other1, other2, other3, other4, other5 );
			}
		}
		
    	if( IsBuyingCar( i ) ) 
		{
    	    if( Car::[ i ][cStatus][0] <= 20 ) 
			{
    			GetVehicleParamsEx( i, eng, light, other1, other2, other3, other4, other5 );
    			if( eng == 1 ) {
    				switch( random( 10 ) ) 
					{
    					case 0 .. 4: {}
    					case 5 .. 9: SetVehicleParamsEx( i, false, light, other1, other2, other3, other4, other5 );
    				}
    			}
    		}
    	}
    }
    if( countWoods != 10 ) countWoods ++;
	else {
	    countWoods = 0;
		for( new i; i != MAX_WOODS; i++ ) {
		    if( WD::[i][woodCount] <= 0 ) {
		        WD::[i][woodObject] = CreateDynamicObject( 660, Woods[i][0], Woods[i][1], Woods[i][2], Woods[i][3], Woods[i][4], Woods[i][5] );
		        WD::[i][woodUse] = false;
				WD::[i][woodIsDrop] = false;
				WD::[i][woodCount] = 100;
		    }
		}
	}
    if( countSave != 10 ) countSave ++;
	else {
	    countSave = 0;
	    S::[0][sProducts] += 100;
	    MebelZavod += 100;
	    WoodsZavod += 100;
	    ToplivoZavod += 1000;
	    S::[0][wsWoodsSklad] += 100;

	    if( ToplivoZavod >= MAX_FUEL_IN_ZAVOD ) ToplivoZavod = 100000;

	    format( gb_string, sizeof gb_string,"Завод мебели\n\n{ffffff}Мебель: %d ед.\nДревесины: %d ед.",MebelZavod,WoodsZavod);
		UpdateDynamic3DTextLabelText( InfoFermText[7], C_BLUE, gb_string );
	    format( gb_string, sizeof gb_string, "Нефтеперерабатывающий завод{ffffff}\n\nТопливо: %d л.",ToplivoZavod );
	    UpdateDynamic3DTextLabelText( InfoFermText[8], C_BLUE, gb_string );
	    format( gb_string, sizeof gb_string, "Обработанная древесина\n{ffffff}%d кг.",S::[0][wsWoodsSklad] );
	    UpdateDynamic3DTextLabelText( S::[0][wsWoodsTS][0], C_BLUE, gb_string );
	    UpdateDynamic3DTextLabelText( S::[0][wsWoodsTS][1], C_BLUE, gb_string );
		SaveAllProducts();
	}
}

function OnSecondTimer() 
{
	clear_massive();
    new string[128];
	new text[256];
	strcat(text,""cBLUE"Очередь на загрузку:{FFFFFF}");
	for(new i;i<10;i++)
	{
		if(gTruckLoadTurn[0][i] != INVALID_PLAYER_ID && !IsPlayerConnected(gTruckLoadTurn[0][i])) gTruckLoadTurn[0][i] = INVALID_PLAYER_ID;
		if(i != 9 && gTruckLoadTurn[0][i] == INVALID_PLAYER_ID && gTruckLoadTurn[0][i+1] != INVALID_PLAYER_ID) {gTruckLoadTurn[0][i] = gTruckLoadTurn[0][i+1]; gTruckLoadTurn[0][i+1] = INVALID_PLAYER_ID;}
		if(gTruckLoadTurn[0][i] != INVALID_PLAYER_ID) format(text,sizeof(text),"%s\n%d. %s",text,i+1,Player[gTruckLoadTurn[0][i]][uName]);
		else format(text,sizeof(text),"%s\n%d. -",text,i+1);
	}
	UpdateDynamic3DTextLabelText(gTruckLoadTurnText[0], -1, text);
	if(gTruckLoadTurn[0][0] != INVALID_PLAYER_ID)
	{
	    new playerid = gTruckLoadTurn[0][0];
		new Float:posv[3][6] = {
       		{-520.3046,-488.6065,26.5456,1019.3719, -325.2847, 74.4603},
       		{-529.7679,-488.5077,26.5385,-529.7606,-500.6951,25.6024},
       		{-557.5859,-488.8280,26.5471,-557.7141,-500.6195,25.6110}
    	};
		if(IsPlayerConnected(playerid))
		{
		    if(PlayerTrailer[playerid] != -1)
		    {
		        if(PlayerTrailerTime[playerid] && GetPVarInt(playerid,"waitgruz") == 2) PlayerTrailerTime[playerid]--;
          		else if(PlayerTrailerTime[playerid] < 1 && GetPVarInt(playerid,"waitgruz") == 2)
		        {

    				V::[PlayerTrailer[playerid]][vWoods] = 0;
					V::[PlayerTrailer[playerid]][vMebel] = 0;
					V::[PlayerTrailer[playerid]][vToplivo] = 0;
					
					if (IsValidDynamic3DTextLabel(V::[PlayerTrailer[playerid]][vTextTrailer]))
					{
			    		DestroyDynamic3DTextLabel(V::[PlayerTrailer[playerid]][vTextTrailer]);
						V::[PlayerTrailer[playerid]][vTextTrailer] = Text3D: INVALID_3DTEXT_ID;
					}	
		   			
					DestroyVehicle(PlayerTrailer[playerid]);
			    	
			    	SetPVarInt(playerid,"dettachTrailer",0);
			       	PlayerTrailer[playerid] = -1;
					DisablePlayerCheckpoint(playerid);
     				SendClientMessage(playerid,C_GRAY,""gbError"Вы оставили свой прицеп на месте аренды.");
			   		gTruckLoadTurn[0][0] = INVALID_PLAYER_ID;
                    SetPVarInt(playerid,"waitgruz",0);
				}
		    }
		    else
			{
			    SendClientMessage(playerid,-1,""gbInfo"Подошла очередь загрузки вашей фуры");
				SendClientMessage(playerid,-1,""gbInfo"После загрузки у Вас будет всего минута, чтобы прицепить её.");
				SetPVarInt(playerid,"waitgruz",2);
				PlayerTrailerTime[playerid] = 80;
				switch(GetPVarInt(playerid,"PlayerSelectTrailer"))
				{
					case 1: {
						PlayerTrailer[playerid] = CreateVehicle(435,posv[0][3],posv[0][4],posv[0][5],180.0000,1,1,-1);
						format(string,sizeof(string),"Мебель\n{ffffff}%d/%d ед.",V::[PlayerTrailer[playerid]][vMebel],MAX_MEBEL_IN_VEHICLE);
						SetPVarInt(playerid,"PlayerDriverCheckpoint",_:SetPlayerCheckpoint(playerid,-18.9291,-273.3552,5.4297,5.0));
						SetPVarInt(playerid,"PlayerSelectTrailerTwo",1);
					}
					case 2: {
						PlayerTrailer[playerid] = CreateVehicle(584,posv[0][3],posv[0][4],posv[0][5],180.0000,1,1,-1);
						format(string,sizeof(string),"Топливо\n{ffffff}%d/%d л.",V::[PlayerTrailer[playerid]][vToplivo],MAX_FUEL_IN_VEHICLE);
						SetPVarInt(playerid,"PlayerDriverCheckpoint",_:SetPlayerCheckpoint(playerid,248.2978,1420.6721,10.5727,5.0));
						SetPVarInt(playerid,"PlayerSelectTrailerTwo",2);
					}
					case 4: {
						PlayerTrailer[playerid] = CreateVehicle(450,posv[0][3],posv[0][4],posv[0][5],180.0000,1,1,-1);
						format(string,sizeof(string),"Древесина\n{ffffff}%d/%d кг.",V::[PlayerTrailer[playerid]][vWoods],MAX_WOODS_IN_VEHICLE);
						SetPVarInt(playerid,"PlayerDriverCheckpoint",_:SetPlayerCheckpoint(playerid,-496.0325,-82.4771,61.2981,5.0));
						SetPVarInt(playerid,"PlayerSelectTrailerTwo",4);
					}
		  			default: SendClientMessage(playerid,C_GRAY,""gbError"Вы должны выбрать хотя бы один из прицепов.");
				}
				V::[PlayerTrailer[playerid]][vTextTrailer] = CreateDynamic3DTextLabel(string,C_BLUE,0.0,0.0,0.0,20.0,INVALID_PLAYER_ID,PlayerTrailer[playerid],1);
    		}
    		if(!IsPlayerInDynamicArea(playerid, strZones[4]) && (gTruckLoadTurn[0][0] == playerid))
			{
			    if(GetVehicleTrailer(GetPlayerVehicleID(playerid)) == PlayerTrailer[playerid])
			    {
					gTruckLoadTurn[0][0] = INVALID_PLAYER_ID;
			        PlayerTrailerTime[playerid] = 0;
			    }
			}
		}
	}
	new hour,minuts,second;
    gettime(hour,minuts,second);
	if( hour == 5 ) {
	    if( minuts < 5 && second == 0 ) {
			format( text, sizeof text, "Уважаемые игроки! Через %d мин. произойдёт рестарт сервера!", 5 - minuts);
	        SendClientMessageToAll(C_ORANGE, text );
	    }
	    else if( minuts == 5 && second == 0 ) {
     		SendClientMessageToAll(C_ORANGE, "Уважаемые игроки! В данный момент происходит рестарт сервера. Пожалуйста, войдите через минуту!");
        	foreach(new i : Player) KickEx(i);
    		SetTimer("ModePlanRestart",30*1000,false);
    		closeserver = true;
	    }
	}
    
	if( ghour != hour ) 
	{
		OnBusinessUpdate();
		
		callHouse();
	}
	
	if( ghour != hour ) ghour = hour;
	
	callWeather();
    foreach( new i:Player) // TYT
	{
		if(!IsPlayerConnected(i)) continue;
		if(GetPVarInt(i,"uLogin") == 0) continue;
		if(IsKicked(i)) continue;
		user_update_weather[i]++;
		if( user_update_weather[i] > 160 ) user_update_weather[i] = 0, updateWeather( i );
		if( stop_time[i] > 0 ) {
			stop_time[i]--;
			if( stop_time[i] < 1 ) {
				TogglePlayerControllable( i, true );
			}
		}
		
		SetPVarInt(i,"PlayerAFK",GetPVarInt(i,"PlayerAFK") + 1);
		
		cctvTimer( i );
    	DeathTimer( i );
		walktimer( i );
		AntiCheatTimer( i );
		
		if(Player[i][uJailSettings][2] != 0) {
			if(Player[i][uJailSettings][3] != 0) {
				Player[i][uJailSettings][3] --;
    			format(string,sizeof(string),"%d",Player[i][uJailSettings][3]);
    			GameTextForPlayer(i, string, 2000, 6);
    			ApplyAnimation(i, "CRACK", "crckdeth2", 4.0, 1, 0, 0, 0, 0);
    			new Float:health;
    			GetPlayerHealth(i,health);
    			if(health < 100.0) setPlayerHealth(i,health + 5);
			}
			else {
				Player[i][uJailSettings][2] = 0;
				Player[i][uJailSettings][3] = 0;
				format(string,sizeof(string),"%d|%d|%d|%d|%d",Player[i][uJailSettings][0],Player[i][uJailSettings][1],Player[i][uJailSettings][2],Player[i][uJailSettings][3],Player[i][uJailSettings][4]);
				nowUpdateInfo(i , "s" , "gb_users" , "uName" , "uJailSettings" , string);
				ClearAnimations(i);
				SendClientMessage(i,C_GRAY,""gbAccess"Вас выписали из больницы!");
				setPlayerPos(i,1137.4501,-1321.1863,2804.5207);
				togglePlayerControllable(i,true);
				spawnFreezeTime(i);
			 	SetPVarInt(i, "RepeatKill", 0);
			}
		}
		if( Player[i][uJail] ) {
			if( Player[i][uJailTime] ) Player[i][uJailTime]--;
			else {
				switch( Player[i][uJail] ) {
					case 1: setPlayerPos( i, 1547.1527, -1679.3868, 2494.2449 );
					case 2: setPlayerPos( i, 637.7561, -576.3484, 1994.0859 );
					//
				}
				stopPlayer( i, 3 );
				Player[i][uJail] = 0, Player[i][uJailTime] = 0;
				userUpdate( i, "uJail", 0 ), userUpdate( i, "uJailTime", 0 );
				SendMes( i, C_GRAY, ""gbAccess"Вы отсидели свой срок  в тюрьме!" );
			}
		}
		if(Player[i][uJailSettings][4] != 0) ApplyAnimation(i, "WUZI", "CS_Dead_Guy", 4.0, 1, 0, 0, 0, 0);
		if(GetPVarInt(i,"playerFreezingTime") != 0) {
		    SetPVarInt(i,"playerFreezingTime",GetPVarInt(i,"playerFreezingTime") - 1);
			if(GetPVarInt(i,"playerFreezingTime") == 0) {
			    togglePlayerControllable(i,true);
			}
		}
		if(GetPVarInt(i,"Stunned") != 0) {
		    SetPVarInt(i,"Stunned",GetPVarInt(i,"Stunned") - 1);
		    if (GetPlayerAnimationIndex(i) != 388)
            	ApplyAnimation(i, "CRACK", "crckdeth4", 4.0, 0, 0, 0, 1, 0, 1);
			if(GetPVarInt(i,"Stunned") == 0) {
			    togglePlayerControllable(i,true);
			}
		}
		if(GetPVarInt(i,"follow") != INVALID_PLAYER_ID && GetPVarInt(i,"playerCuffed") != 0) {
		    if(IsPlayerConnected(GetPVarInt(i,"follow"))) {
		        if(!IsPlayerInAnyVehicle(GetPVarInt(i,"follow"))) {
		            if(!IsPlayerInAnyVehicle(i)) {
		                if(GetDistanceBetweenPlayers(i, GetPVarInt(i,"follow")) < 1.5) {
							ClearAnimations(i);
						}
						else if(GetDistanceBetweenPlayers(i, GetPVarInt(i,"follow")) > 1.0 && GetDistanceBetweenPlayers(i, GetPVarInt(i,"follow")) < 10.0) {
							SetPlayerToFacePlayer(i, GetPVarInt(i,"follow"));
							ApplyAnimation(i, "ped", "WALK_civi", 6.0, 1, 1, 1, 1, 0, 1);
						}
						else if(GetDistanceBetweenPlayers(i, GetPVarInt(i,"follow")) > 10.0) {
							SendClientMessage(GetPVarInt(i,"follow"),C_GRAY,""gbInfo"Вы отошли слишком далеко от человека, которого ведёте за собой!");
							SetPVarInt(GetPVarInt(i,"follow"),"follow",INVALID_PLAYER_ID);
							SetPVarInt(i,"follow",INVALID_PLAYER_ID);
							togglePlayerControllable(i,false);
						}
		            }
		            else {
					    SetPVarInt(GetPVarInt(i,"follow"),"follow",INVALID_PLAYER_ID);
						SetPVarInt(i,"follow",INVALID_PLAYER_ID);
					}
				}
				else {
				    SetPVarInt(GetPVarInt(i,"follow"),"follow",INVALID_PLAYER_ID);
					SetPVarInt(i,"follow",INVALID_PLAYER_ID);
				}
		    }
		    else SetPVarInt(i,"follow",INVALID_PLAYER_ID);
		}
		if(GetPVarInt(i,"dettachTrailer") != 0) {
		    SetPVarInt(i,"dettachTrailer",GetPVarInt(i,"dettachTrailer") - 1);
		    format(string,sizeof(string),"%d",GetPVarInt(i,"dettachTrailer"));
		    GameTextForPlayer(i, string, 1000, 6);
		    if(GetPVarInt(i,"dettachTrailer") == 0) {
		        V::[PlayerTrailer[i]][vWoods] = 0;
				V::[PlayerTrailer[i]][vMebel] = 0;
				V::[PlayerTrailer[i]][vToplivo] = 0;
				
				if (IsValidDynamic3DTextLabel(V::[PlayerTrailer[i]][vTextTrailer]))
			    	DestroyDynamic3DTextLabel(V::[PlayerTrailer[i]][vTextTrailer]);
					
			    DestroyVehicle(PlayerTrailer[i]);
			    
		        PlayerTrailer[i] = -1;
				DisablePlayerCheckpoint(i);
				SetPVarInt(i,"dettachTrailer",0);
		        SendClientMessage(i,C_GRAY,""gbError"Ваш прицеп отцепился от тягача, прицеп возвращен на склад.");
		    }
		}
		if(GetPVarInt(i,"CountBackTaxi") != 0) {
		    SetPVarInt(i,"CountBackTaxi",GetPVarInt(i,"CountBackTaxi") - 1);
		    format(string,sizeof(string),"%d",GetPVarInt(i,"CountBackTaxi"));
		    GameTextForPlayer(i, string, 1000, 6);
		    if(GetPlayerVehicleID(i) >= ataxils[0] && GetPlayerVehicleID(i) <= ataxils[1]) {
	            if(V::[GetPlayerVehicleID(i)][vTaxiDriver] == i && D::[i][dTaxiKey] == GetPlayerVehicleID(i)) SetPVarInt(i,"CheckpointBack",_:SetPlayerCheckpoint(i,1099.9902,-1242.7791,15.3823,5.0));
			}
			else DisablePlayerCheckpoint(i);
			if(GetPVarInt(i,"CountBackTaxi") == 0) {
			    if(GetPlayerVehicleID(i) >= ataxils[0] && GetPlayerVehicleID(i) <= ataxils[1]) {
			        if(V::[GetPlayerVehicleID(i)][vTaxiDriver] == i && D::[i][dTaxiKey] == GetPlayerVehicleID(i)) {
		                V::[GetPlayerVehicleID(i)][vTaxiDriver] = -1;
		                D::[i][dTaxiKey] = -1;
						DisablePlayerCheckpoint(i);
						D::[i][dTaxiDuty] = false;
						Player[i][uTaxiNoZp] = gettime();
						nowUpdateInfo(i, "d" , "gb_users" , "uName" , "uTaxiNoZp" , Player[i][uTaxiNoZp]);
		            }
		            else {
		                if(D::[i][dTaxiKey] != -1) {
					    	V::[D::[i][dTaxiKey]][vTaxiDriver] = -1;
						    D::[i][dTaxiKey] = -1;
							DisablePlayerCheckpoint(i);
							D::[i][dTaxiDuty] = false;
							Player[i][uTaxiNoZp] = gettime();
							nowUpdateInfo(i , "d" , "gb_users" , "uName" , "uTaxiNoZp" , Player[i][uTaxiNoZp]);
						}
		            }
			    }
			}
		}
		if(GetPVarInt(i,"CountBackDaln") != 0) {
		    SetPVarInt(i,"CountBackDaln",GetPVarInt(i,"CountBackDaln") - 1);
		    format(string,sizeof(string),"%d",GetPVarInt(i,"CountBackDaln"));
		 	GameTextForPlayer(i, string, 1000, 6);
			if(GetPVarInt(i,"CountBackDaln") == 0) {
			    if(GetPlayerVehicleID(i) >= dalncars[0] && GetPlayerVehicleID(i) <= dalncars[1]) {
			        if(V::[GetPlayerVehicleID(i)][vDalnDriver] == i && D::[i][dDalnKey] == GetPlayerVehicleID(i)) {
		                V::[GetPlayerVehicleID(i)][vDalnDriver] = -1;
		                D::[i][dDalnKey] = -1;
						DisablePlayerCheckpoint(i);
						D::[i][dDalnDuty] = false;
						if(PlayerTrailer[i] != -1) {
							V::[PlayerTrailer[i]][vWoods] = 0;
							V::[PlayerTrailer[i]][vMebel] = 0;
							V::[PlayerTrailer[i]][vToplivo] = 0;
							
							if (IsValidDynamic3DTextLabel(V::[PlayerTrailer[i]][vTextTrailer]))
							{
								DestroyDynamic3DTextLabel(V::[PlayerTrailer[i]][vTextTrailer]);
								V::[PlayerTrailer[i]][vTextTrailer] = Text3D: INVALID_3DTEXT_ID;
							}
							
							DestroyVehicle(PlayerTrailer[i]);
							
							PlayerTrailer[i] = -1;
							SetPVarInt(i,"dettachTrailer",0);
						}
		            }
			    }
			    else {
			        if(D::[i][dDalnKey] != -1) {
				    	V::[D::[i][dDalnKey]][vDalnDriver] = -1;
					    D::[i][dDalnKey] = -1;
						DisablePlayerCheckpoint(i);
						D::[i][dDalnDuty] = false;
						if(PlayerTrailer[i] != -1) {
							V::[PlayerTrailer[i]][vWoods] = 0;
							V::[PlayerTrailer[i]][vMebel] = 0;
							V::[PlayerTrailer[i]][vToplivo] = 0;
							
							if (IsValidDynamic3DTextLabel(V::[PlayerTrailer[i]][vTextTrailer]))
							{
								DestroyDynamic3DTextLabel(V::[PlayerTrailer[i]][vTextTrailer]);
								V::[PlayerTrailer[i]][vTextTrailer] = Text3D: INVALID_3DTEXT_ID;
							}
							
							DestroyVehicle(PlayerTrailer[i]);
					
							
							PlayerTrailer[i] = -1;
							SetPVarInt(i,"dettachTrailer",0);
						}
					}
			    }
			}
		}
		if(GetPVarInt(i,"CountBackToBus") != 0) {
		    SetPVarInt(i,"CountBackToBus",GetPVarInt(i,"CountBackToBus") - 1);
		    format(string,sizeof(string),"%d",GetPVarInt(i,"CountBackToBus"));
    		GameTextForPlayer(i, string, 2000, 6);
		    if(GetPVarInt(i,"CountBackToBus") == 0) SetVehicleToRespawn(D::[i][dBusKey]);
		}
		if(GetPVarInt(i,"TimerCountWoods") != 0) {
		    SetPVarInt(i,"TimerCountWoods",GetPVarInt(i,"TimerCountWoods") - 1);
		    format(string,sizeof(string),"%d",GetPVarInt(i,"TimerCountWoods"));
    		GameTextForPlayer(i, string, 2000, 6);
    		if(GetPVarInt(i,"TimerCountWoods") == 0) {
    		    DeletePVar(i,"PlayerWoodsLimit");
    			SendClientMessage(i, -1, ""gbAccess"Ваша зарплата перечислена на чековую книжку, обналичить ее можно в банке");
    		    showPlayerDialog(i, 9999, 0, " ", "{ffffff}Ваш рабочий день закончен!\n\n"cGREEN"| Ваша зарплата перечислена на чековую книжку.\n"gbError"Снять деньги с чековой книжки можно в банке", "Закрыть", "");
				D::[i][dWoodsDuty] = 0;
				DeletePVar(i,"PlayerUseBox");
				DeletePVar(i,"PlayerStanok");
				GetBackSkin(i);
				RemovePlayerAttachedObject(i,9);
				RemovePlayerAttachedObject(i,8);
				SetPlayerSpecialAction(i, SPECIAL_ACTION_NONE);
    		}
		}
		if(IsPlayerInAnyVehicle(i)) {
		    new Float:hpcar,car = GetPlayerVehicleID(i);
	        GetVehicleHealth(GetPlayerVehicleID(i),hpcar);
			if(V::[GetPlayerVehicleID(i)][vHealth] < hpcar) {
			    if(GetPVarInt(i,"ACPlayerTuning") == 0 && GetPVarInt(i,"playerUsePaynSpray") == 0) SetVehicleHealth(GetPlayerVehicleID(i),V::[GetPlayerVehicleID(i)][vHealth]);
				if(GetPVarInt(i,"ACPlayerTuning") != 0) setVehicleHealth(GetPlayerVehicleID(i),1000.0);
				if(GetPVarInt(i,"playerUsePaynSpray") != 0 && GetPlayerState(i) == PLAYER_STATE_DRIVER) {
				    setVehicleHealth(GetPlayerVehicleID(i),1000.0);
					Player[i][uMoney] -= 100;
					format(string,sizeof(string),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[i][uMoney],Player[i][uName]);
					mysql_tquery(1, string, "", "");
					S::[0][sMeria][0] += S::[0][sMeria][1];
			        format(string,sizeof(string),"UPDATE gb_others SET sMeria0 = %d",S::[0][sMeria][0]);
					mysql_tquery(1, string, "", "");
				    SetPVarInt(i,"playerUsePaynSpray",0);
				}
			}
			else V::[GetPlayerVehicleID(i)][vHealth] = hpcar;
			if(car >= ataxils[0] && car <= ataxils[1]) {
				if(V::[car][vTaxiDriver] == i && D::[i][dTaxiKey] == car) {
                    if(D::[i][dArendTaxi] != 0) {
						D::[i][dArendTaxi] --;
						switch(D::[i][dArendTaxi]) {
							case 400: JobValueNow(i, 10, 350,Player[i][uJob]);
							case 800: JobValueNow(i, 10, 350,Player[i][uJob]);
							case 1200: JobValueNow(i, 10, 350,Player[i][uJob]);
							case 1600: JobValueNow(i, 10, 350,Player[i][uJob]);
							case 2000: JobValueNow(i, 10, 350,Player[i][uJob]);
							case 2400: JobValueNow(i, 10, 350,Player[i][uJob]);
							case 2800: JobValueNow(i, 10, 350,Player[i][uJob]);
							case 3200: JobValueNow(i, 10, 350,Player[i][uJob]);
							case 3600: JobValueNow(i, 10, 350,Player[i][uJob]);
							case 4000: JobValueNow(i, 10, 350,Player[i][uJob]);
							case 4400: JobValueNow(i, 10, 350,Player[i][uJob]);
							case 4800: JobValueNow(i, 10, 350,Player[i][uJob]);
							case 5200: JobValueNow(i, 10, 350,Player[i][uJob]);
							case 5600: JobValueNow(i, 10, 350,Player[i][uJob]);
						}
					}
                    else {
                        D::[i][dArendTaxi] = -1;
						SendClientMessage(i,C_GRAY,""gbInfo"Ваш контракт с таксопарком подошёл к концу, верните автомобиль на место!");
						SetPVarInt(i,"CountBackTaxi",MAX_COUNT_BACK_TAXI);
						SetPVarInt(i,"CheckpointBack",_:SetPlayerCheckpoint(i,1099.9902,-1242.7791,15.3823,5.0));
                    }
                }
			}
			if(car >= dalncars[0] && car <= dalncars[1]) {
				if(V::[car][vDalnDriver] == i && D::[i][dDalnKey] == car) {
                    if(D::[i][dArendDaln] != 0) D::[i][dArendDaln] --;
                    else {
                        D::[i][dArendDaln] = -1;
						SendClientMessage(i,C_GRAY,""gbInfo"Ваш контракт с транспортной компанией подошёл к концу, верните автомобиль на место!");
						SetPVarInt(i,"CountBackDaln",MAX_COUNT_BACK_DALN);
						SetPVarInt(i,"CheckpointBackDaln",_:SetPlayerCheckpoint(i,2209.2693,-2220.6868,14.1527,5.0));
                    }
                }
			}
    		new Float:ST[4], vehicleid;
    		vehicleid = GetPlayerVehicleID(i);
			GetVehicleVelocity(vehicleid,ST[0],ST[1],ST[2]);
			ST[3] = floatsqroot(floatpower(floatabs(ST[0]), 2.0) + floatpower(floatabs(ST[1]), 2.0) + floatpower(floatabs(ST[2]), 2.0)) * 179.28625;
			V::[vehicleid][vMile] += ST[3]/2000;
			format(string,sizeof(string),"%.1f MP",V::[vehicleid][vMile]);
			PlayerTextDrawSetString(i,Speed[4][i],string);
		}
		else {
			if(GetPVarInt(i, "NarkEffect") <= 0) SetPlayerDrunkLevel(i, 0);
		}
	}	
	
	new 
		Float: hp;
	
	for(new i; i != MAX_VEHICLES; i ++) 
	{
		if( !IsValidVehicle( i ) ) 
			continue;
		
    	GetVehicleHealth( i, hp );
    	GetVehicleParamsEx( i, eng, light, other1, other2, other3, other4, other5 );
		
		switch( GetVehicleModel( i ) )
		{
			case 528, 601 :
			{
				if( hp <= 950.0 )
				{
					setVehicleHealth( i, 1000.0 );
				}
			}
			
			default :
			{
				if(hp <= 400.0) 
				{
					setVehicleHealth( i, 400.0 );
					SetVehicleParamsEx( i, false, light, other1, other2, other3, other4, other5 );
				}
			}
		}
		

    	new value = floatround(V::[i][vMile]);
    	if(value == 50.0 * V::[i][vCountMile]) {

    	    if( IsBuyingCar( i ) ) 
			{
    	        if(Car::[ i ][cStatus][0] != 20)
				{
					Car::[ i ][cStatus][0] -= 5;
				}
				else 
				{
					GetVehicleParamsEx( i, eng, light, other1, other2, other3, other4, other5 );
					
					switch( random( 10 ) ) 
					{
						case 0 .. 4: {}
						case 5 .. 9: SetVehicleParamsEx(i,false,light,other1,other2,other3,other4,other5);
					}
				}
    	    }
    		V::[i][vCountMile] ++;
    	}
  
    	if(IsVelo(i))
		{
    		GetVehicleParamsEx(i,eng,light,other1,other2,other3,other4,other5);
    		SetVehicleParamsEx(i,true,light,other1,other2,other3,other4,other5);
    	}
    }
	for(new i; i != MAX_GATE; i ++) {
		if(gTime[i] + (10) < gettime() && gStatus[i] == true) {
		    switch(G::[i][gObject]) {
		        case 968: MoveDynamicObject(gID[i], G::[i][gP][0],G::[i][gP][1],G::[i][gP][2] - 0.05, 0.05, G::[i][gP][3],G::[i][gP][4],G::[i][gP][5]);
                case 19313: MoveDynamicObject(gID[i], G::[i][gP][0],G::[i][gP][1],G::[i][gP][2], 1.0, G::[i][gP][3],G::[i][gP][4],G::[i][gP][5]);
                case 19912: MoveDynamicObject(gID[i], G::[i][gP][0],G::[i][gP][1],G::[i][gP][2], 1.0, G::[i][gP][3],G::[i][gP][4],G::[i][gP][5]);
			}
		    gStatus[i] = false;
		}
	}
    format(string,sizeof(string),"%02d:%02d",hour,minuts);
    TextDrawSetString(phoneOne[16],string);
    TextDrawSetString(phoneTwo[13],string);
    TextDrawSetString(phoneThree[5],string);
	return 1;
}


stock SetPlayerToFacePlayer(playerid, targetid) {
    new Float:pX, Float:pY, Float:pZ, Float:X, Float:Y, Float:Z,Float:ang;
    if(!IsPlayerConnected(playerid) || !IsPlayerConnected(targetid)) return 0;
    GetPlayerPos(targetid, X, Y, Z);
    GetPlayerPos(playerid, pX, pY, pZ);
    if( Y > pY ) ang = (-acos((X - pX) / floatsqroot((X - pX)*(X - pX) + (Y - pY)*(Y - pY))) - 90.0);
    else if( Y < pY && X < pX ) ang = (acos((X - pX) / floatsqroot((X - pX)*(X - pX) + (Y - pY)*(Y - pY))) - 450.0);
    else if( Y < pY ) ang = (acos((X - pX) / floatsqroot((X - pX)*(X - pX) + (Y - pY)*(Y - pY))) - 90.0);
    if(X > pX) ang = (floatabs(floatabs(ang) + 180.0));
    else ang = (floatabs(ang) - 180.0);
    SetPlayerFacingAngle(playerid, ang);
    return 0;
}

stock SuspectPlayer(playerid,text[],name[],value) {
	clear_massive();
	format( gb_string,sizeof( gb_string ),"%s объявил(-а) вас в розыск. Причина: %s.",name,text);
	SendClientMessage(playerid,C_LIGHTRED, gb_string);
	Player[playerid][uSuspect] += value;
	if(Player[playerid][uSuspect] >= 6) Player[playerid][uSuspect] = 6;
	SetPlayerWantedLevel(playerid,Player[playerid][uSuspect]);
	nowUpdateInfo(playerid , "d" , "gb_users" , "uName" , "uSuspect" , Player[playerid][uSuspect]);
	return 1;
}

nowUpdateInfo ( playerid , const type [ ] , db_table [ ] , db_name_field [ ] , field [ ] , {Float, _}:...) {
    static const STATIC_ARGS = 0x5 ;
	clear_massive();
    for ( new i , x = numargs ( ) - STATIC_ARGS ; i != x ; i++ ) {
        switch ( type [ i ] ) {
            case 'i','d' : format ( query , sizeof query , "update `%s` set `%s`=%d where BINARY `%s`='%s' limit 1;" , db_table , field , getarg (i + STATIC_ARGS ) , db_name_field , Player[playerid][uName] );
            case 'f' : format ( query , sizeof query , "update `%s` set `%s`=%f where BINARY `%s`='%s' limit 1;" , db_table , field , Float:getarg ( i + STATIC_ARGS ) , db_name_field , Player[playerid][uName] );
            case 's' : {
                for ( new a ; getarg ( i + STATIC_ARGS , a ) != 0x0 ; a++) {
                    gb_string [ a ] = getarg ( i+STATIC_ARGS , a ) ;
                }
                format ( query , sizeof query , "update `%s` set `%s`='%s' where BINARY `%s`='%s' limit 1;" , db_table , field , gb_string , db_name_field , Player[playerid][uName] ) ;
            }
        }
    }
    return mysql_tquery ( mysql, query, "", "" ) ;
}

stock SpeedVehicle(vehicleid) {
    new Float:x, Float:y, Float:z;
    GetVehicleVelocity(vehicleid, x, y, z);
    return floatround(floatsqroot(x*x+y*y)*100);
}

stock MeAction( playerid, text[], type ) 
{
	switch(type) 
	{
	    case 0: 
		{
			format:vb_string( "%s %s", GetCharacterName( playerid ), text );
			sendLongMessage( playerid, vb_string, 0xC2A2DAFF, 0xC2A2DAFF, 0xC2A2DAFF, 0xC2A2DAFF, 0xC2A2DAFF);
        }
        case 1: 
		{
			SetPlayerChatBubble( playerid, text, 0xC2A2DAFF, 15.0, 5000 );
        }
	}
	return 1;
}

stock DoAction( playerid, text[] ) 
{
	format:gb_string( "%s (( %s ))", text, GetCharacterName( playerid ) );
    sendLongMessage( playerid, gb_string, 0xC2A2DAFF, 0xC2A2DAFF, 0xC2A2DAFF, 0xC2A2DAFF, 0xC2A2DAFF );
	return 1;
}

stock GiveTaxiMoney(playerid) {
	switch(D::[playerid][dArendTaxi]) {
	    case -10 .. 400: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
	    case 401 .. 800: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
	    case 801 .. 1200: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
	    case 1201 .. 1600: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
	    case 1601 .. 2000: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
     	case 2001 .. 2400: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
     	case 2401 .. 2800: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
     	case 2801 .. 3200: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
     	case 3201 .. 3600: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
     	case 3601 .. 4000: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
     	case 4001 .. 4400: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
     	case 4401 .. 4800: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
     	case 4801 .. 5200: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
     	case 5201 .. 5600: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
     	case 5601 .. 6000: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
     	case 6001 .. 6400: JobValueNow(playerid, 10, 350,Player[playerid][uJob]);
	}
	return 1;
}

stock IsVelo(carid) {
	switch(GetVehicleModel(carid)) { case 481,509,510:return true; }
	return 0;
}

stock UpdateVehicleHud(playerid)
{
    new vehicleid = GetPlayerVehicleID(playerid);
    GetVehicleParamsEx(vehicleid,eng,light,other1,other2,other3,other4,other5);
    if(eng == 1) PlayerTextDrawSetString(playerid,Speed[0][playerid],"~w~ENG");
    else PlayerTextDrawSetString(playerid,Speed[0][playerid],"~l~ENG");
    if(light == 1) PlayerTextDrawSetString(playerid,Speed[2][playerid],"~w~lamp");
    else PlayerTextDrawSetString(playerid,Speed[2][playerid],"~l~lamp");
    if(other2 == 1) PlayerTextDrawSetString(playerid,Speed[3][playerid],"~w~lock");
    else PlayerTextDrawSetString(playerid,Speed[3][playerid],"~l~lock");
    if(V::[vehicleid][vLimit] == true) PlayerTextDrawSetString(playerid,Speed[1][playerid],"~w~lim");
    else PlayerTextDrawSetString(playerid,Speed[1][playerid],"~l~lim");
    UpdateFuelBar(playerid,GetPlayerVehicleID(playerid));
	return 1;
}

stock CheckEngine(playerid) {
	//new string[30];
    new vehicleid = GetPlayerVehicleID(playerid),Float:hp;
    GetVehicleParamsEx(vehicleid,eng,light,other1,other2,other3,other4,other5);
    GetVehicleHealth(vehicleid,hp);
    if(hp <= 400.0) return SendClientMessage(playerid,C_GRAY,""gbError"Данная машина не способна завестись!");
    if(eng!=1)
	{
        if(IsPlayerInAnyVehicle(playerid))
		{
        	if(V::[GetPlayerVehicleID(playerid)][vFuel] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"В данном транспорте закончилось топливо!");
        	
        	if(vehicleid >= ataxils[0] && vehicleid <= ataxils[1]) {
			    if(Player[playerid][uJob] != 1) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
			    if(V::[vehicleid][vTaxiDriver] != playerid || D::[playerid][dTaxiKey] != vehicleid) return SendClientMessage(playerid,C_GRAY,"У Вас нет ключей от данного транспорта!");
			}
			if( V::[vehicleid][vCrime] ) {
				if( Player[playerid][uCrimeM] != V::[vehicleid][vCrime] ) {
					return SendMes( playerid, C_GRAY, "У Вас нет ключей от данного транспорта!" );
				}
				else if( !Player[playerid][uCrimeSet][CRIME_USECAR] && !getRankSettings( playerid, CRIME_USECAR ) ) {
					return SendMes( playerid, C_GRAY, "У Вас нет ключей от данного транспорта!" );			
				}
			}
			if(vehicleid >= buscars[0] && vehicleid <= buscars[1]) {
			    if(Player[playerid][uJob] != 2) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
			    if(D::[playerid][dBusDuty] != true) return SendClientMessage(playerid,C_GRAY,""gbError"Вы не начали свой рабочий день!");
			    if(V::[vehicleid][vBusDriver] != playerid || D::[playerid][dBusKey] != vehicleid) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
			    if(GetVehicleModel(vehicleid) == 437 && Player[playerid][uBusSkill] < 50) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но Ваш стаж водителя слишком мал для этого транспорта.");
			}
			if(vehicleid >= dalncars[0] && vehicleid <= dalncars[1]) {
			    if(Player[playerid][uJob] != 3) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
			    if(D::[playerid][dDalnDuty] != true) return SendClientMessage(playerid,C_GRAY,""gbError"Вы не начали свой рабочий день!");
			    if(V::[vehicleid][vDalnDriver] != playerid || D::[playerid][dDalnKey] != vehicleid) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
			    if(GetVehicleModel(vehicleid) == 514 && Player[playerid][uDalnSkill] < 50) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но Ваш стаж водителя слишком мал для этого транспорта.");
			    if(GetVehicleModel(vehicleid) == 515 && Player[playerid][uDalnSkill] < 100) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но Ваш стаж водителя слишком мал для этого транспорта.");
			}
			
			if(vehicleid >= sheriffandpolice[0] && vehicleid <= sheriffandpolice[1]) {
				if( (Player[playerid][uMember] != 2 || Player[playerid][uIsPlayerJob][0] == 0) && (Player[playerid][uMember] != 8 || Player[playerid][uIsPlayerJob][0] == 0)) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
			}
			if(vehicleid >= lspdcars[0] && vehicleid <= lspdcars[1]) {
				if(Player[playerid][uMember] != 2 || Player[playerid][uIsPlayerJob][0] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
			}
			if(vehicleid >= sherifcar[0] && vehicleid <= sherifcar[1]) {
				if(Player[playerid][uMember] != 1 || Player[playerid][uIsPlayerJob][0] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
			}
			if(vehicleid >= sasd_car[0] && vehicleid <= sasd_car[1]) {
				if(Player[playerid][uMember] != 8 || Player[playerid][uIsPlayerJob][0] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
			}
			if(vehicleid >= medicalcar[0] && vehicleid <= medicalcar[1]) {
				if(Player[playerid][uMember] != 3 || Player[playerid][uIsPlayerJob][1] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
			}
			if(vehicleid >= smicars[0] && vehicleid <= smicars[1]) {
				if(Player[playerid][uMember] != 4) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
			}
			if(vehicleid >= fd_cars[0] && vehicleid <= fd_cars[1]) 
			{
				if(Player[playerid][uMember] != 5 || Player[playerid][uIsPlayerJob][2] == 0) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
			}
			if(vehicleid >= meria[0] && vehicleid <= meria[1]) {
				if(Player[playerid][uMember] != 6) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
			}
			if(vehicleid >= comm[0] && vehicleid <= comm[1]) {
				if(Player[playerid][uMember] != 7) return SendClientMessage(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
			}
			if(V::[GetPlayerVehicleID(playerid)][vRentCar][0] == 1 && D::[playerid][dRentVehicleID] == GetPlayerVehicleID(playerid))
			{
			    SetVehicleParamsEx(vehicleid,1,light,other1,other2,other3,other4,other5);
	 			PlayerTextDrawSetString(playerid,Speed[0][playerid],"~w~ENG");
	 			return 1;
			}
			
			if( IsBuyingCar( vehicleid ) )
			{
				new 
					bool: count = false;
				
                for(new g; g != 48; g++) 
				{
                    switch( _itemsInfo[ Inv[playerid][invSlot][g] ][invID] ) 
					{
                        case 23: 
						{
                            if( Car::[ vehicleid ][cID] == Inv[playerid][invSlotKol][g] ) 
							{
								count = true;
								break;
							}
                        }
                    }
				}
				
				if( !count)
				{
					return SendMes(playerid,C_GRAY,""gbError"У Вас нет ключей от данного транспорта!");
				}
			}
			
			SetVehicleParamsEx(vehicleid,1,light,other1,other2,other3,other4,other5);
 			PlayerTextDrawSetString(playerid,Speed[0][playerid],"~w~ENG");
		}
    }
    else {
	    SetVehicleParamsEx(vehicleid,0,light,other1,other2,other3,other4,other5);
	    PlayerTextDrawSetString(playerid,Speed[0][playerid],"~l~ENG");
	}
	return 1;
}

stock SetVehicleSpeed(vehicleid, Float:speed) {
    new Float:x1, Float:y1, Float:z1, Float:x2, Float:y2, Float:z2, Float:a;
    GetVehicleVelocity(vehicleid, x1, y1, z1);
    GetVehiclePos(vehicleid, x2, y2, z2);
    GetVehicleZAngle(vehicleid, a); a = 360 - a;
    x1 = (floatsin(a, degrees) * (speed/100) + floatcos(a, degrees) * 0 + x2) - x2;
    y1 = (floatcos(a, degrees) * (speed/100) + floatsin(a, degrees) * 0 + y2) - y2;
    SetVehicleVelocity(vehicleid, x1, y1, z1);
}

stock CheckDoor(playerid) {
    new vehicleid = GetPlayerVehicleID(playerid);
    GetVehicleParamsEx(vehicleid,eng,light,other1,other2,other3,other4,other5);
    if(other2 != 1) {
        if(IsPlayerInAnyVehicle(playerid)) {
		    SetVehicleParamsEx(vehicleid,eng,light,other1,1,other3,other4,other5);
		    PlayerTextDrawSetString(playerid,Speed[3][playerid],"~w~lock");
		}
		else SetVehicleParamsEx(vehicleid,eng,light,other1,1,other3,other4,other5);
		GameTextForPlayer(playerid, "~r~LOCK", 3000, 3);
		V::[vehicleid][vLock] = true;
    }
    else {
        if(IsPlayerInAnyVehicle(playerid)) {
	    	SetVehicleParamsEx(vehicleid,eng,light,other1,0,other3,other4,other5);
	    	PlayerTextDrawSetString(playerid,Speed[3][playerid],"~l~lock");
		}
		else SetVehicleParamsEx(vehicleid,eng,light,other1,0,other3,other4,other5);
		GameTextForPlayer(playerid, "~g~UNLOCK", 3000, 3);
		V::[vehicleid][vLock] = false;
	}
}

stock CheckLight(playerid) {
    new vehicleid = GetPlayerVehicleID(playerid);
    GetVehicleParamsEx(vehicleid,eng,light,other1,other2,other3,other4,other5);
    if(light!=1) {
        if(IsPlayerInAnyVehicle(playerid)) {
		    SetVehicleParamsEx(vehicleid,eng,1,other1,other2,other3,other4,other5);
		    PlayerTextDrawSetString(playerid,Speed[2][playerid],"~w~lamp");
		}
    }
    else {
	    SetVehicleParamsEx(vehicleid,eng,0,other1,other2,other3,other4,other5);
	    PlayerTextDrawSetString(playerid,Speed[2][playerid],"~l~lamp");
	}
}

stock IsPlane(carid) {
	switch(GetVehicleModel(carid)) { case 417,425,447,460,469,467,476,487,488,497,511,512,513,519,520,548,553,563,577,592,593: return true; }
	return false;
}

stock GetCoordBootVehicle(vehicleid, &Float:x, &Float:y, &Float:z) {
    new Float:angle,Float:distance;
    GetVehicleModelInfo(GetVehicleModel(vehicleid), 1, x, distance, z);
    distance = distance/2 + 0.1;
    GetVehiclePos(vehicleid, x, y, z);
    GetVehicleZAngle(vehicleid, angle);
    x += (distance * floatsin(-angle+180, degrees));
    y += (distance * floatcos(-angle+180, degrees));
    return 1;
}

stock IsTextRussian(text[])
{
	if(strfind(text, "а", true) != -1) return 1;
	if(strfind(text, "б", true) != -1) return 1;
	if(strfind(text, "в", true) != -1) return 1;
	if(strfind(text, "г", true) != -1) return 1;
	if(strfind(text, "д", true) != -1) return 1;
	if(strfind(text, "е", true) != -1) return 1;
	if(strfind(text, "ё", true) != -1) return 1;
	if(strfind(text, "ж", true) != -1) return 1;
	if(strfind(text, "з", true) != -1) return 1;
	if(strfind(text, "и", true) != -1) return 1;
	if(strfind(text, "й", true) != -1) return 1;
	if(strfind(text, "к", true) != -1) return 1;
	if(strfind(text, "л", true) != -1) return 1;
	if(strfind(text, "м", true) != -1) return 1;
	if(strfind(text, "н", true) != -1) return 1;
	if(strfind(text, "о", true) != -1) return 1;
	if(strfind(text, "п", true) != -1) return 1;
	if(strfind(text, "р", true) != -1) return 1;
	if(strfind(text, "с", true) != -1) return 1;
	if(strfind(text, "т", true) != -1) return 1;
	if(strfind(text, "у", true) != -1) return 1;
	if(strfind(text, "ф", true) != -1) return 1;
	if(strfind(text, "х", true) != -1) return 1;
	if(strfind(text, "ц", true) != -1) return 1;
	if(strfind(text, "ч", true) != -1) return 1;
	if(strfind(text, "ш", true) != -1) return 1;
	if(strfind(text, "щ", true) != -1) return 1;
	if(strfind(text, "ъ", true) != -1) return 1;
	if(strfind(text, "ы", true) != -1) return 1;
	if(strfind(text, "ь", true) != -1) return 1;
	if(strfind(text, "э", true) != -1) return 1;
	if(strfind(text, "ю", true) != -1) return 1;
	if(strfind(text, "я", true) != -1) return 1;
	return 0;
}

stock isNumeric(const string[])
{
	for (new i = 0, j = strlen(string); i < j; i++) if (string[i] > '9' || string[i] < '0') return 0;
	return 1;
}

stock isNumericEx(const string[])
{
	for (new i = 0, j = strlen(string); i < j; i++) if (string[i] > '9' || string[i] < '1') return 0;
	return 1;
}

stock GetWeaponToObject( weaponid ) 
{
	switch( weaponid ) 
	{
		case 321: return 10;
		case 331: return 1;
		case 333: return 2;
		case 334: return 3;
		case 325: return 14;
		case 335: return 4;
		case 336: return 5;
		case 337: return 6;
		case 338: return 7;
		case 339: return 8;
		case 326: return 15;
		case 341: return 9;
		case 346: return 22;
		case 347: return 23;
		case 348: return 24;
		case 349: return 25;
		case 352: return 28;
		case 353: return 29;
		case 355: return 30;
		case 356: return 31;
		case 372: return 32;
		case 357: return 33;
		case 358: return 34;
		case 365: return 41;
		case 366: return 42;
		case 367: return 43;
	}
	
	return 0;
}

stock SetCarsStr(idx, stolb[], znach[]) {
	new Query[128];
	format(Query, sizeof(Query), "UPDATE gb_cars SET  %s = '%s' WHERE cID = '%d'", stolb, znach, idx);
	return mysql_tquery(1, Query, "", "");
}

stock GetBackSkinWork(playerid)
{
    SetPlayerSkin(playerid,F::[Player[playerid][uMember]][fSkins][Player[playerid][uRank] - 1]);
    SendClientMessage(playerid,C_GRAY,""gbAccess"Вы взяли свою форму из шкафчика!");
	if(GetPVarInt(playerid, "PlayerColor") == 1)
	{
	    SetPlayerColor(playerid,FracColor[0]);
	}
	else SetPlayerColor(playerid,FracColor[Player[playerid][uMember]]);
	MeAction(playerid,"переоделся(ась)",1);

	if(IsPlayerAttachedObjectSlotUsed(playerid, 4)) RemovePlayerAttachedObject(playerid, 4);
	if(IsPlayerAttachedObjectSlotUsed(playerid, 5)) RemovePlayerAttachedObject(playerid, 5);
}

stock GetBackSkin(playerid) 
{
	if(_itemsInfo[Inv[playerid][invSlot][52]][invObject] == 0) 
	{
	    if(Player[playerid][uSex] == 1) {
			if(Player[playerid][uColor] == 1) SetPlayerSkin(playerid,18);
			else if(Player[playerid][uColor] == 2) SetPlayerSkin(playerid,154);
		}
		else if(Player[playerid][uSex] == 2) {
		    if(Player[playerid][uColor] == 1) SetPlayerSkin(playerid,139);
			else if(Player[playerid][uColor] == 2) SetPlayerSkin(playerid,138);
		}
	}
	else SetPlayerSkin(playerid,_itemsInfo[Inv[playerid][invSlot][52]][invObject]);
}

stock RemoveWeapon(playerid, weaponid) {
    if(!IsPlayerConnected(playerid) || weaponid < 0 || weaponid > 50) return;
    new saveweapon[13], saveammo[13];
    for(new slot = 0; slot < 13; slot++) GetWeaponData(playerid, slot, saveweapon[slot], saveammo[slot]);
    ResetWeapons(playerid);
    for(new slot; slot !=12; slot++) {
        if(saveweapon[slot] == weaponid || saveammo[slot] == 0) continue;
        givePlayerWeapon(playerid, saveweapon[slot], saveammo[slot]);
    }
    givePlayerWeapon(playerid, 0, 1);
}

stock GetWeaponSlot(weaponid)
{
	switch(weaponid)
	{
		case 0, 1: return 0;
  		case 2..9: return 1;
  		case 22..24: return 2;
  		case 25..27: return 3;
  		case 28..29,32: return 4;
  		case 30,31: return 5;
  		case 33..34: return 6;
  		case 35..38: return 7;
  		case 16..18: return 8;
  		case 41..43: return 9;
  		case 10..15: return 10;
  		case 44..46: return 11;
  		case 40: return 12;
 	}
 	return false;
}

stock putPlayerInVehicle(playerid,vehicle,seat){
	//SetPVarInt(playerid,"ACPlayerCarID",vehicle);
	//GetVehiclePos(vehicle,vehPos[vehicle][0],vehPos[vehicle][1],vehPos[vehicle][2]);
	PutPlayerInVehicle(playerid,vehicle,seat);
	SetPVarInt(playerid, "PutHacking", 1);

}

stock GetPlayerSpeed(playerid) {
    new Float:Coord[4];
    GetPlayerVelocity(playerid, Coord[0], Coord[1], Coord[2]);
    Coord[3] = floatsqroot(floatpower(floatabs(Coord[0]), 2.0) + floatpower(floatabs(Coord[1]), 2.0) + floatpower(floatabs(Coord[2]), 2.0)) * 213.3;
    return floatround(Coord[3]);
}

stock SendRadioMessageForSubChanel(chanel, subchanel, text[])
{
    foreach(new i: Player)
	{

	    if(!IsPlayerConnected(i)) continue;
		//GetPVarInt(i,"uLogin") == 0)) continue;
	    if(Player[i][uRadioChanel] == chanel && Player[i][uRadioSubChanel] == subchanel) SendClientMessage(i, 0xE6E6B8AA, text);
	}
}

stock SendRadioMessage(chanel, text[])
{
	foreach(new i: Player)
	{
	
	    if(!IsPlayerConnected(i)) continue;
  		//GetPVarInt(i,"uLogin") == 0)) continue;
	    if(Player[i][uRadioChanel] == chanel) SendClientMessage(i, 0xFFFFCCAA, text);
	}
}

stock ShowUseSlots(playerid,useid)
{
	new string[128];
	switch(useid) {
	    case 1: {
	        new id = GetPVarInt(playerid,"PlayerVehicleID");
	        if(GetVehicleBag(id) == 0) return 1;
	        SetPVarInt(playerid,"UseSlots",1);
	        PlayerTextDrawSetPreviewModel(playerid, iconUse[1][playerid], GetVehicleModel(id));
	        //new color1,color2;
	        //GetVehicleColor(id,color1,color2);
	        PlayerTextDrawSetPreviewVehCol(playerid, iconUse[1][playerid], 0,0);
	        for(new i = 48; i != 56; i++) PlayerTextDrawSetSelectable(playerid,invSPlayer[playerid][i], 0);
	        for(new i; i != GetVehicleBag(id); i ++) {
				if(V::[id][vInvSlot][i] == 0) PlayerTextDrawSetPreviewModel(playerid, slotUse[i][playerid], 19464),PlayerTextDrawSetPreviewRot(playerid, slotUse[i][playerid], 0.000000, 0.000000, 90.000000, 0.100000),PlayerTextDrawBackgroundColor(playerid,slotUse[i][playerid], 255);
				else PlayerTextDrawSetPreviewModel(playerid,slotUse[i][playerid], _itemsInfo[V::[id][vInvSlot][i]][invObject]),PlayerTextDrawSetPreviewRot(playerid, slotUse[i][playerid], _itemsInfo[V::[id][vInvSlot][i]][invP][0], _itemsInfo[V::[id][vInvSlot][i]][invP][1], _itemsInfo[V::[id][vInvSlot][i]][invP][2], _itemsInfo[V::[id][vInvSlot][i]][invP][3]),PlayerTextDrawBackgroundColor(playerid,slotUse[i][playerid], 0xd3d3d3FF);
				PlayerTextDrawShow(playerid,slotUse[i][playerid]);
            }
            GetVehicleParamsEx(id,eng,light,other1,other2,other3,other4,other5);
            SetVehicleParamsEx(id,eng,light,other1,other2,other3,1,other5);
            MeAction(playerid,"открыл(-а) багажник авто",1);
            for(new i; i != 3; i ++) PlayerTextDrawShow(playerid,iconUse[i][playerid]);
	    }
	    case 3: {
	    	SetPVarInt(playerid,"UseSlots",3);
	    	new bool:playerinshop = false;
	    	if(IsPlayerInRangeOfPoint(playerid,3.0,203.8694,-43.2627,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,207.6243,-100.3268,1005.2578) || IsPlayerInRangeOfPoint(playerid,3.0,207.0882,-129.1814,1003.5078) ||
			IsPlayerInRangeOfPoint(playerid,3.0,161.4221,-83.2581,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,206.3741,-8.1361,1001.2109) || IsPlayerInRangeOfPoint(playerid,3.0,204.3264,-159.3523,1000.5234)) {
				switch(Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bID]) {
				    case 24: {
						if(Player[playerid][uSex] == 1) {
				        	PlayerBuyingSkinShop(playerid,1,2,3,17,21,24,47,59,68,95,105,106,107,121,126,144);
							PlayerBuyingSkinShopProd(playerid,100,120,120,460,471,345,400,579,400,345,467,500,511,400,450,300);
						}
						else if(Player[playerid][uSex] == 2) {
							PlayerBuyingSkinShop(playerid,9,10,11,12,13,40,41,55,56,63,65,69,76,85,88,90);
							PlayerBuyingSkinShopProd(playerid,200,100,450,500,250,300,270,300,290,120,150,270,200,270,120,230);
						}
				    }
					case 25: {
						if(Player[playerid][uSex] == 1) {
				        	PlayerBuyingSkinShop(playerid,4,5,6,19,23,28,48,60,82,96,108,109,110,122,127,147);
							PlayerBuyingSkinShopProd(playerid,130,130,200,450,300,367,350,498,350,411,460,490,500,450,461,700);
						}
						else if(Player[playerid][uSex] == 2) {
							PlayerBuyingSkinShop(playerid,91,93,131,141,148,150,151,152,169,172,190,192,193,194,195,207);
							PlayerBuyingSkinShopProd(playerid,550,450,130,313,320,340,300,120,190,500,200,287,300,490,310,120);
						}
					}
					case 26: {
					    if(Player[playerid][uSex] == 1) {
				        	PlayerBuyingSkinShop(playerid,7,8,14,20,22,25,49,62,83,98,111,112,113,123,128,153);
							PlayerBuyingSkinShopProd(playerid,120,120,140,456,440,344,200,100,350,587,550,500,590,500,150,320);
						}
						else if(Player[playerid][uSex] == 2) {
							PlayerBuyingSkinShop(playerid,211,214,215,216,219,224,225,226,233,237,243,263,298,111,112,113);
							PlayerBuyingSkinShopProd(playerid,450,350,190,550,360,209,211,220,305,150,170,300,310,550,500,590);
						}
					}
					case 27: {
					    if(Player[playerid][uSex] == 1) {
				        	PlayerBuyingSkinShop(playerid,15,29,30,32,33,35,57,66,84,100,114,115,116,124,142,155);
							PlayerBuyingSkinShopProd(playerid,130,420,442,100,298,200,379,349,350,490,450,500,550,440,325,320);
						}
						else if(Player[playerid][uSex] == 2) {
							PlayerBuyingSkinShop(playerid,9,10,11,12,13,40,41,55,56,53,65,69,76,85,88,90);
							PlayerBuyingSkinShopProd(playerid,200,100,450,500,250,300,270,300,290,120,150,270,200,270,120,230);
						}
					}
					case 28: {
					    if(Player[playerid][uSex] == 1) {
				        	PlayerBuyingSkinShop(playerid,36,37,42,44,46,58,67,94,102,103,104,117,118,120,125,143);
							PlayerBuyingSkinShopProd(playerid,311,345,350,420,569,270,400,351,451,432,490,600,600,650,500,320);
						}
						else if(Player[playerid][uSex] == 2) {
							PlayerBuyingSkinShop(playerid,91,93,131,141,148,150,151,152,169,172,190,192,193,194,195,207);
							PlayerBuyingSkinShopProd(playerid,550,450,130,313,320,340,300,120,190,500,200,287,300,490,310,120);
						}
					}
					case 29: {
					    if(Player[playerid][uSex] == 1) {
				        	PlayerBuyingSkinShop(playerid,43,156,158,159,160,161,170,171,173,174,175,176,177,180,181,183);
							PlayerBuyingSkinShopProd(playerid,456,230,120,150,100,120,390,550,490,470,450,400,420,450,478,360);
						}
						else if(Player[playerid][uSex] == 2) {
							PlayerBuyingSkinShop(playerid,211,214,215,216,219,224,225,226,233,237,243,263,298,111,112,113);
							PlayerBuyingSkinShopProd(playerid,450,350,190,550,360,209,211,220,305,150,170,300,310,550,500,590);
						}
					}
					case 71: {
					    if(Player[playerid][uSex] == 1) {
				        	PlayerBuyingSkinShop(playerid,184,185,186,187,188,202,206,208,210,217,220,221,222,223,227,228);
							PlayerBuyingSkinShopProd(playerid,400,440,550,600,390,200,220,563,150,290,210,300,310,610,450,500);
						}
						else if(Player[playerid][uSex] == 2) {
							PlayerBuyingSkinShop(playerid,9,10,11,12,13,40,41,55,56,63,65,69,76,85,88,90);
							PlayerBuyingSkinShopProd(playerid,200,100,450,500,250,300,270,300,290,120,150,270,200,270,120,230);
						}
					}
					case 73: {
					    if(Player[playerid][uSex] == 1) {
				        	PlayerBuyingSkinShop(playerid,229,234,235,236,240,241,247,248,249,250,254,258,259,261,269,270);
							PlayerBuyingSkinShopProd(playerid,230,200,210,220,300,310,400,420,490,350,400,410,410,320,500,550);
						}
						else if(Player[playerid][uSex] == 2) {
							PlayerBuyingSkinShop(playerid,91,93,131,141,148,150,151,152,169,172,190,192,193,194,195,207);
							PlayerBuyingSkinShopProd(playerid,550,450,130,313,320,340,300,120,190,500,200,287,300,490,310,120);
						}
					}
					case 74: {
					    if(Player[playerid][uSex] == 1) {
				        	PlayerBuyingSkinShop(playerid,271,272,273,289,290,291,292,293,294,295,296,297,299,46,58,67);
							PlayerBuyingSkinShopProd(playerid,600,340,479,389,500,430,500,460,2000,670,700,490,320,569,270,400);
						}
						else if(Player[playerid][uSex] == 2) {
							PlayerBuyingSkinShop(playerid,211,214,215,216,219,224,225,226,233,237,243,263,298,111,112,113);
							PlayerBuyingSkinShopProd(playerid,450,350,190,550,360,209,211,220,305,150,170,300,310,550,500,590);
						}
					}
				}
				playerinshop = true;
			}
	    	if(Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bUpdate][1] == 1) {
	    		if(IsPlayerInRangeOfPoint(playerid,1.0,210.1204,-102.2575,1005.2578) || IsPlayerInRangeOfPoint(playerid,1.0,210.5399,-34.1924,1001.9297) || IsPlayerInRangeOfPoint(playerid,1.0,206.9977,-135.6739,1002.8744) ||
				IsPlayerInRangeOfPoint(playerid,1.0,150.9207,-75.5895,1001.8047) || IsPlayerInRangeOfPoint(playerid,1.0,211.3265,-9.5800,1001.2109) || IsPlayerInRangeOfPoint(playerid,1.0,198.8070,-157.5421,1000.5234)) {
	    			PlayerBuyingSkinShop(playerid,300,301,302,303,304,305,306,307,308,309,310,311,312,313,314,315);
	    			PlayerBuyingSkinShopProd(playerid,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10,10);
	    			playerinshop = true;
	    		}
	    		if(IsPlayerInRangeOfPoint(playerid,1.0,205.2868,-102.2578,1005.2578) || IsPlayerInRangeOfPoint(playerid,1.0,208.5928,-33.9872,1001.9297) || IsPlayerInRangeOfPoint(playerid,1.0,209.9369,-135.1686,1002.8672) ||
				IsPlayerInRangeOfPoint(playerid,1.0,149.3744,-78.7390,1001.8047) || IsPlayerInRangeOfPoint(playerid,1.0,208.4021,-7.5041,1001.2109) || IsPlayerInRangeOfPoint(playerid,1.0,198.6052,-166.8229,1000.5234)) {
	    			PlayerBuyingSkinShop(playerid,363,364,365,366);
	    			PlayerBuyingSkinShopProd(playerid,10,10,10,10);
	    			playerinshop = true;
	    		}
	    		if(IsPlayerInRangeOfPoint(playerid,1.0,212.4442,-96.4369,1005.2578) || IsPlayerInRangeOfPoint(playerid,1.0,197.3729,-40.3967,1001.8047) || IsPlayerInRangeOfPoint(playerid,1.0,199.3410,-138.7777,1003.5078) ||
				IsPlayerInRangeOfPoint(playerid,1.0,147.4459,-72.5470,1001.8047) || IsPlayerInRangeOfPoint(playerid,1.0,226.1939,-11.2933,1002.2109) || IsPlayerInRangeOfPoint(playerid,1.0,202.4432,-166.7652,1000.5234)) {
	    			PlayerBuyingSkinShop(playerid,343,344,345,346,347,348,349,350,351,352);
	    			PlayerBuyingSkinShopProd(playerid,20,20,20,20,20,20,20,20,20,20);
	    			playerinshop = true;
	    		}
	    		if(IsPlayerInRangeOfPoint(playerid,1.0,205.0045,-96.9579,1005.2578) || IsPlayerInRangeOfPoint(playerid,1.0,210.7852,-44.9170,1001.8047) || IsPlayerInRangeOfPoint(playerid,1.0,215.7504,-137.4998,1003.5078) ||
				IsPlayerInRangeOfPoint(playerid,1.0,166.4640,-80.5297,1001.8047) || IsPlayerInRangeOfPoint(playerid,1.0,226.2144,-5.1318,1002.2109) || IsPlayerInRangeOfPoint(playerid,1.0,210.0818,-166.7970,1000.5234)) {
	    			PlayerBuyingSkinShop(playerid,353,354,355,356,357,358,359,360,361,362);
	    			PlayerBuyingSkinShopProd(playerid,20,20,20,20,20,20,20,20,20,20);
	    			playerinshop = true;
	    		}
	    		if(IsPlayerInRangeOfPoint(playerid,1.0,202.5804,-96.4468,1005.2578) || IsPlayerInRangeOfPoint(playerid,1.0,197.3730,-48.3824,1001.8047) || IsPlayerInRangeOfPoint(playerid,1.0,216.1559,-132.9930,1003.5078) ||
				IsPlayerInRangeOfPoint(playerid,1.0,156.3242,-80.4837,1001.8047) || IsPlayerInRangeOfPoint(playerid,1.0,215.5925,-9.6650,1001.2109) || IsPlayerInRangeOfPoint(playerid,1.0,206.6252,-166.7522,1000.5306)) {
	    			PlayerBuyingSkinShop(playerid,367,368,369,370,371,372,373,374);
	    			PlayerBuyingSkinShopProd(playerid,20,20,20,20,20,20,20,20);
	    			playerinshop = true;
	    		}
	    	}
	    	if(playerinshop == true) {
	    		for(new i; i != 16; i++) {
	    			if(PlayerBuyingItemsShop[playerid][i] != 0) {
	    				PlayerTextDrawSetPreviewModel(playerid,buyingShopItems[i][playerid], _itemsInfo[PlayerBuyingItemsShop[playerid][i]][invObject]);
	        			PlayerTextDrawSetPreviewRot(playerid, buyingShopItems[i][playerid], _itemsInfo[PlayerBuyingItemsShop[playerid][i]][invP][0], _itemsInfo[PlayerBuyingItemsShop[playerid][i]][invP][1], _itemsInfo[PlayerBuyingItemsShop[playerid][i]][invP][2], _itemsInfo[PlayerBuyingItemsShop[playerid][i]][invP][3]);
	        			format(string,sizeof(string),"~w~Название:~n~~y~%s~n~~w~Цена:~n~~g~$%d",_itemsInfo[PlayerBuyingItemsShop[playerid][i]][invName],PlayerBuyingItemsShopProd[playerid][i] * Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bSettings][5]);
            			PlayerTextDrawSetString(playerid,buyingShopInfo[i][playerid],string);
	        			TextDrawShowForPlayer(playerid,buyingShopFon[i]);
	        			PlayerTextDrawShow(playerid,buyingShopItems[i][playerid]);
	        			PlayerTextDrawShow(playerid,buyingShopInfo[i][playerid]);
	    			}
	    		}
	    		return 1;
	    	}
	    	if(Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bUpdate][1] == 0) {
	    		for(new i; i != 16; i++) {
	    			if(Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][i] != 0) {
	    				PlayerTextDrawSetPreviewModel(playerid,buyingShopItems[i][playerid], _itemsInfo[Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][i]][invObject]);
	        			PlayerTextDrawSetPreviewRot(playerid, buyingShopItems[i][playerid], _itemsInfo[Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][i]][invP][0], _itemsInfo[Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][i]][invP][1], _itemsInfo[Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][i]][invP][2], _itemsInfo[Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][i]][invP][3]);
	        			format(string,sizeof(string),"~w~Название:~n~~y~%s~n~~w~Цена:~n~~g~$%d",_itemsInfo[Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][i]][invName],Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bProdItems][i] * Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bSettings][5]);
            			PlayerTextDrawSetString(playerid,buyingShopInfo[i][playerid],string);
	        			TextDrawShowForPlayer(playerid,buyingShopFon[i]);
	        			PlayerTextDrawShow(playerid,buyingShopItems[i][playerid]);
	        			PlayerTextDrawShow(playerid,buyingShopInfo[i][playerid]);
	    			}
	    		}
	    	}
	    	else {
	    		for(new i; i != 16; i++) {
	    			if(Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][i] != 0) {
	    				PlayerTextDrawSetPreviewModel(playerid,buyingShopItems[i][playerid], _itemsInfo[Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][i]][invObject]);
	        			PlayerTextDrawSetPreviewRot(playerid, buyingShopItems[i][playerid], _itemsInfo[Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][i]][invP][0], _itemsInfo[Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][i]][invP][1], _itemsInfo[Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][i]][invP][2], _itemsInfo[Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][i]][invP][3]);
	        			format(string,sizeof(string),"~w~Название:~n~~y~%s~n~~w~Цена:~n~~g~$%d",_itemsInfo[Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bItems][i]][invName],Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bProdItems][i] * Bizz::[GetPVarInt(playerid,"PlayerBizzID")][bSettings][5]);
            			PlayerTextDrawSetString(playerid,buyingShopInfo[i][playerid],string);
	        			TextDrawShowForPlayer(playerid,buyingShopFon[i]);
	        			PlayerTextDrawShow(playerid,buyingShopItems[i][playerid]);
	        			PlayerTextDrawShow(playerid,buyingShopInfo[i][playerid]);
	    			}
	    		}
	    	}
	    }
	    case 4: {
			//FracMaterials[Player[playerid][uMember]][GetPVarInt(playerid,"playerSelectBuyingSlot")]
	    	SetPVarInt(playerid,"UseSlots",4);
			new bool:shop = false;
	    	for(new i; i != 6; i ++) {
	    		if(FracGuns[Player[playerid][uMember]][i] != 0) {
	    			PlayerTextDrawSetPreviewModel(playerid,buyingShopItems[i][playerid], _itemsInfo[FracGuns[Player[playerid][uMember]][i]][invObject]);
	        		PlayerTextDrawSetPreviewRot(playerid, buyingShopItems[i][playerid], _itemsInfo[FracGuns[Player[playerid][uMember]][i]][invP][0], _itemsInfo[FracGuns[Player[playerid][uMember]][i]][invP][1], _itemsInfo[FracGuns[Player[playerid][uMember]][i]][invP][2], _itemsInfo[FracGuns[Player[playerid][uMember]][i]][invP][3]);
	        		format(string,sizeof(string),"~w~Название:~n~~y~%s~n~~w~С~y~ %d ~w~Ранга~n~Боеприпасов~y~ %d",
						_itemsInfo[FracGuns[Player[playerid][uMember]][i]][invName],
						F::[Player[playerid][uMember]][fGuns][i], 
						FracMaterials[Player[playerid][uMember]][i]);
       				PlayerTextDrawSetString(playerid,buyingShopInfo[i][playerid],string);
	        		TextDrawShowForPlayer(playerid,buyingShopFon[i]);
	        		PlayerTextDrawShow(playerid,buyingShopItems[i][playerid]);
	        		PlayerTextDrawShow(playerid,buyingShopInfo[i][playerid]);
	        		shop = true;
	    		}
	    	}
	    	if(shop == false) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но тут нет товаров!");
	    }
	    case 8: {/****/
	        SetPVarInt(playerid,"UseSlots",8);
	        
	        PlayerTextDrawSetPreviewModel(playerid, buyingShopItems[0][playerid], _itemsInfo[406][invObject] );
       		PlayerTextDrawSetPreviewRot(playerid, buyingShopItems[0][playerid], _itemsInfo[406][invP][0], _itemsInfo[406][invP][1], _itemsInfo[406][invP][2], _itemsInfo[406][invP][3]);
       		
       		format(string,sizeof(string),"~w~Название:~n~~y~%s~n~",_itemsInfo[406][invName]);
			PlayerTextDrawSetString(playerid, buyingShopInfo[0][playerid],string);
 			TextDrawShowForPlayer(playerid, buyingShopFon[0]);
  			PlayerTextDrawShow(playerid,buyingShopItems[0][playerid]);
  			PlayerTextDrawShow(playerid,buyingShopInfo[0][playerid]);

	    }
	    case 9: {// SADoC
	        setData( playerid, "UseSlots", 9 );
	        if( Player[playerid][uMember] ) sadoc_eat = { 406, 407, 408, 409 };
	        else sadoc_eat = { 407, 408, 0, 0 };
			for( new i; i < sizeof sadoc_eat; i++ ) {
			    if( !sadoc_eat[i] ) continue;
			    PlayerTextDrawSetPreviewModel(playerid, buyingShopItems[i][playerid], _itemsInfo[ sadoc_eat[i] ][invObject] );
       			PlayerTextDrawSetPreviewRot(playerid, buyingShopItems[i][playerid], _itemsInfo[ sadoc_eat[i] ][invP][0], _itemsInfo[ sadoc_eat[i] ][invP][1], _itemsInfo[ sadoc_eat[i] ][invP][2], _itemsInfo[ sadoc_eat[i] ][invP][3]);

       			format(string,sizeof(string),"~w~Название:~n~~y~%s~n~",_itemsInfo[ sadoc_eat[i] ][invName]);
				PlayerTextDrawSetString(playerid, buyingShopInfo[i][playerid],string);
 				TextDrawShowForPlayer(playerid, buyingShopFon[i]);
  				PlayerTextDrawShow(playerid,buyingShopItems[i][playerid]);
  				PlayerTextDrawShow(playerid,buyingShopInfo[i][playerid]);
			}
	    }
	}
	return 1;
}

stock showPhone(playerid)
{
    switch(_itemsInfo[Inv[playerid][invSlot][55]][invObject])
	{
        case 18874: TextDrawShowForPlayer(playerid,phoneFonOne[0]);
        case 18871: TextDrawShowForPlayer(playerid,phoneFonOne[1]);
        case 18872: TextDrawShowForPlayer(playerid,phoneFonOne[2]);
        case 18869: TextDrawShowForPlayer(playerid,phoneFonTwo[0]);
        case 18870: TextDrawShowForPlayer(playerid,phoneFonTwo[1]);
        case 18866: TextDrawShowForPlayer(playerid,phoneFonTwo[2]);
        case 18865: TextDrawShowForPlayer(playerid,phoneFonThree[0]);
        case 18868: TextDrawShowForPlayer(playerid,phoneFonThree[1]);
        case 18867: TextDrawShowForPlayer(playerid,phoneFonThree[2]);
        default: return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но у Вас нет телефона!");
    }
    switch(_itemsInfo[Inv[playerid][invSlot][55]][invObject]) {
        case 18874,18871,18872: for(new i = 1; i != 28; i++) TextDrawShowForPlayer(playerid,phoneOne[i]);
        case 18869,18870,18866: for(new i = 1; i != 19; i++) TextDrawShowForPlayer(playerid,phoneTwo[i]);
        case 18865,18868,18867: for(new i = 1; i != 19; i++) TextDrawShowForPlayer(playerid,phoneThree[i]);
    }
    new y,m,d,string[11];
    getdate(y,m,d);
    format(string,sizeof(string),"%02d/%02d/%d",d,m,y);
    TextDrawSetString(phoneThree[7],string);
    TextDrawSetString(phoneOne[22],string);
    SetPVarInt(playerid,"PlayerMenuShow",5);
    SelectTextDraw(playerid, 0xd3d3d3FF);
    SetPlayerSpecialAction(playerid,SPECIAL_ACTION_USECELLPHONE);
	SetPlayerAttachedObject(playerid,3,_itemsInfo[Inv[playerid][invSlot][55]][invObject],6,0.107999,0.015000,-0.016000,97.100006,-165.800048,-3.000013);
	MeAction(playerid,"достал(-а) сотовый телефон",1);
	return 1;
}

stock PhoneStatus(playerid,bool:status) {
	if(status == true) {
		if(GetPVarInt(playerid,"PlayerMenuShow") == 5) CancelSelectTextDraw(playerid);
		else {
			SetPlayerSpecialAction(playerid,SPECIAL_ACTION_USECELLPHONE);
			SetPlayerAttachedObject(playerid,3,_itemsInfo[Inv[playerid][invSlot][55]][invObject],6,0.107999,0.015000,-0.016000,97.100006,-165.800048,-3.000013);
			MeAction(playerid,"достал(-а) сотовый телефон",1);
		}
	}
	else {
		if(GetPVarInt(playerid,"PlayerMenuShow") == 5) SelectTextDraw(playerid, 0xd3d3d3FF);
		else {
			SetPlayerSpecialAction(playerid,SPECIAL_ACTION_STOPUSECELLPHONE);
	        RemovePlayerAttachedObject(playerid,3);
		}
	}
}

stock hidePhone(playerid) {
	switch(_itemsInfo[Inv[playerid][invSlot][55]][invObject]) {
        case 18874: TextDrawHideForPlayer(playerid,phoneFonOne[0]);
        case 18871: TextDrawHideForPlayer(playerid,phoneFonOne[1]);
        case 18872: TextDrawHideForPlayer(playerid,phoneFonOne[2]);
        case 18869: TextDrawHideForPlayer(playerid,phoneFonTwo[0]);
        case 18870: TextDrawHideForPlayer(playerid,phoneFonTwo[1]);
        case 18866: TextDrawHideForPlayer(playerid,phoneFonTwo[2]);
        case 18865: TextDrawHideForPlayer(playerid,phoneFonThree[0]);
        case 18868: TextDrawHideForPlayer(playerid,phoneFonThree[1]);
        case 18867: TextDrawHideForPlayer(playerid,phoneFonThree[2]);
        default: return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но у Вас нет телефона!");
    }
    switch(_itemsInfo[Inv[playerid][invSlot][55]][invObject]) {
        case 18874,18871,18872: for(new i = 1; i != 28; i++) TextDrawHideForPlayer(playerid,phoneOne[i]);
        case 18869,18870,18866: for(new i = 1; i != 19; i++) TextDrawHideForPlayer(playerid,phoneTwo[i]);
        case 18865,18868,18867: for(new i = 1; i != 19; i++) TextDrawHideForPlayer(playerid,phoneThree[i]);
    }
    SetPVarInt(playerid,"PlayerMenuShow",0);
    SetPlayerSpecialAction(playerid,SPECIAL_ACTION_STOPUSECELLPHONE);
	RemovePlayerAttachedObject(playerid,3);
    CancelSelectTextDraw(playerid);
    MeAction(playerid,"убрал(-а) сотовый телефон",1);
    return 1;
}

stock Hunger(playerid,type) {
	switch(type) {
	    case 0: {
			TextDrawShowForPlayer(playerid,HungerFon[0]);
			TextDrawShowForPlayer(playerid,HungerFon[1]);
			PlayerTextDrawTextSize(playerid,HungerProgres[playerid], 549.5 + Player[playerid][uHunger] / 100.0 * 54.5, 40.000000);
			PlayerTextDrawShow(playerid,HungerProgres[playerid]);
		}
		case 1: {
			PlayerTextDrawHide(playerid,HungerProgres[playerid]);
			TextDrawHideForPlayer(playerid,HungerFon[0]);
			TextDrawHideForPlayer(playerid,HungerFon[1]);
		}
	}
}

stock SaveAllProducts() 
{
	format:vb_string( "UPDATE gb_others SET sProducts = %d,MebelZavod = %d,WoodsZavod = %d,ToplivoZavod = %d,wsWoodsSklad = %d,wsWoods = %d",
	S::[0][sProducts],MebelZavod,WoodsZavod,ToplivoZavod,S::[0][wsWoodsSklad],S::[0][wsWoods]);
	mysql_tquery(1, vb_string, "", "");
	return 1;
}

stock showInventory(playerid) {
	clear_massive();
	if(GetPVarInt(playerid,"PlayerMenuShow") != 0) return 1;
	if(GetPVarInt(playerid,"PlayerCameraHouse") != 0) return 1;
	new Float:X, Float:Y, Float:Z, Float:R, Float:X2, Float:Y2,Float:health,Float:armour,bool:camera = true,string[128],Float:p[4];
	if(IsPlayerInAnyVehicle(playerid))
	{
		if(GetPlayerState(playerid) == PLAYER_STATE_DRIVER)
		{
			if(Player[playerid][uSettings][0] == 1)
			{
				for(new i; i != 3; i++) TextDrawHideForPlayer(playerid, SpeedFon[i]);
				for(new i; i != 8; i++) PlayerTextDrawHide(playerid,Speed[i][playerid]);
			}
		}
		camera = false;
	}
	SetPVarInt(playerid,"PlayerMenuShow",4);
	GetPlayerHealth(playerid,health);
	GetPlayerArmour(playerid,armour);
	SelectTextDraw(playerid,0xd3d3d3FF);
	new Float:kg;
	for(new i; i != 56; i++) kg += _itemsInfo[Inv[playerid][invSlot][i]][invKg];
	format(string,sizeof(string),"~y~%s~n~~w~%.1f/%.0f.0kg",Player[playerid][uName],kg,MAX_PLAYER_KG + Player[playerid][uJobDouble][6]);
	PlayerTextDrawSetString(playerid,invSPlayer[playerid][58],string);
	format(string,sizeof(string),"%.0f%",health);
	PlayerTextDrawSetString(playerid,invSPlayer[playerid][59],string);
	format(string,sizeof(string),"%.0f%",armour);
	PlayerTextDrawSetString(playerid,invSPlayer[playerid][60],string);
	PlayerTextDrawTextSize(playerid,invSPlayer[playerid][56], 224.4+health/100.0*190.0, -31.000000);
	PlayerTextDrawTextSize(playerid,invSPlayer[playerid][57], 224.4+armour/100.0*190.0, -31.000000);
	for(new i; i < 56; i++) {
		if(Inv[playerid][invSlot][i] == 0) PlayerTextDrawSetPreviewModel(playerid, invSPlayer[playerid][i], 19464),PlayerTextDrawSetPreviewRot(playerid, invSPlayer[playerid][i], 0.000000, 0.000000, 90.000000, 0.100000),PlayerTextDrawBackgroundColor(playerid,invSPlayer[playerid][i], 255);
		else PlayerTextDrawSetPreviewModel(playerid,invSPlayer[playerid][i], _itemsInfo[Inv[playerid][invSlot][i]][invObject]),PlayerTextDrawSetPreviewRot(playerid, invSPlayer[playerid][i], _itemsInfo[Inv[playerid][invSlot][i]][invP][0], _itemsInfo[Inv[playerid][invSlot][i]][invP][1], _itemsInfo[Inv[playerid][invSlot][i]][invP][2], _itemsInfo[Inv[playerid][invSlot][i]][invP][3]),PlayerTextDrawBackgroundColor(playerid,invSPlayer[playerid][i], 0xd3d3d3FF);
	}
	PlayerTextDrawSetSelectable(playerid,invSPlayer[playerid][52], 1);
 	if(Player[playerid][uIsPlayerJob][0] == 1 || Player[playerid][uIsPlayerJob][1] == 1 || Player[playerid][uIsPlayerJob][2] == 1 || D::[playerid][dWoodsDuty] != 0 ) PlayerTextDrawSetSelectable(playerid,invSPlayer[playerid][52], 0);
	checkHouseInventory( playerid );
	if( getData( playerid, "HInv:ID" ) ) camera = false;
	//общаки мафий!

	for(new i; i < MAX_VEHICLES; i++ ) 
	{
 		if( !IsValidVehicle( i ) ) 
			continue;
			
 		if( GetPlayerVirtualWorld(playerid) != GetVehicleVirtualWorld( i ) ) 
			continue;
			
		if( !IsVehicleStreamedIn( i, playerid ) )
			continue;
		
		if( V::[i][vNoBag] == true ) 
			continue;
			
 		if( V::[i][vLock] == true ) 
			continue;
		
    	if(IsPlayerInAnyVehicle(playerid)) continue;
 		GetCoordBootVehicle(i, p[0], p[1], p[2]);
		if(IsPlayerInRangeOfPoint(playerid, 3.0, p[0], p[1], p[2])) {
		    if(GetVehicleBag(i) == 0) continue;
		    if(i >= lspdcars[0] && i <= lspdcars[1] || i >= sherifcar[0] && i <= sherifcar[1] || i >= sheriffandpolice[0] && i <= sheriffandpolice[1]) {
		    	if(Player[playerid][uIsPlayerJob][0] == 0) continue;
		    }
		    if(i >= medicalcar[0] && i <= medicalcar[1]) {
		    	if(Player[playerid][uIsPlayerJob][1] == 0) continue;
		    }
		    if(i >= smicars[0] && i <= smicars[1]) {
		    	if(Player[playerid][uMember] != 4) continue;
		    }
		    if(i >= fd_cars[0] && i <= fd_cars[1]) {
		    	if(Player[playerid][uIsPlayerJob][2] == 0) continue;
		    }
		    if(i >= meria[0] && i <= meria[1]) {
		    	if(Player[playerid][uMember] != 6) continue;
		    }
		    if(i >= comm[0] && i <= comm[1]) {
		    	if(Player[playerid][uMember] != 7) continue;
		    }
			if( i >= sasd_car[0] && i <= sasd_car[1] ) {
				if(Player[playerid][uMember] != 8) continue;
			}
 			SetPVarInt(playerid,"PlayerVehicleID",i);
 			ShowUseSlots(playerid,1);
 			camera = false;
 			break;
		}
	}
	if(IsPlayerInRangeOfPoint(playerid,3.0,379.3506,-190.4740,1000.6328) || IsPlayerInRangeOfPoint(playerid,3.0,375.5897,-118.8041,1001.4995) ||
	IsPlayerInRangeOfPoint(playerid,3.0,377.4535,-67.4345,1001.5078) || IsPlayerInRangeOfPoint(playerid,3.0,369.6813,-6.0225,1001.8589) ||
	IsPlayerInRangeOfPoint(playerid,3.0,498.0475,-76.0367,998.7578) || IsPlayerInRangeOfPoint(playerid,3.0,1207.2336,-29.0828,1000.9531) || IsPlayerInRangeOfPoint(playerid,3.0,-784.1971,500.0738,1371.7422) ||
	IsPlayerInRangeOfPoint(playerid,3.0,203.8694,-43.2627,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,207.0882,-129.1814,1003.5078) || IsPlayerInRangeOfPoint(playerid,3.0,161.4221,-83.2581,1001.8047) ||
	IsPlayerInRangeOfPoint(playerid,3.0,206.3741,-8.1361,1001.2109) || IsPlayerInRangeOfPoint(playerid,3.0,204.3264,-159.3523,1000.5234) || IsPlayerInRangeOfPoint(playerid,3.0,-2237.1565,130.1796,1035.4141) ||
	IsPlayerInRangeOfPoint(playerid,3.0,207.6243,-100.3268,1005.2578) || IsPlayerInRangeOfPoint(playerid,3.0,210.1204,-102.2575,1005.2578) || IsPlayerInRangeOfPoint(playerid,3.0,210.5399,-34.1924,1001.9297) || IsPlayerInRangeOfPoint(playerid,3.0,206.9977,-135.6739,1002.8744) ||
	IsPlayerInRangeOfPoint(playerid,3.0,150.9207,-75.5895,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,211.3265,-9.5800,1001.2109) || IsPlayerInRangeOfPoint(playerid,3.0,198.8070,-157.5421,1000.5234) ||
	IsPlayerInRangeOfPoint(playerid,3.0,205.2868,-102.2578,1005.2578) || IsPlayerInRangeOfPoint(playerid,3.0,208.5928,-33.9872,1001.9297) || IsPlayerInRangeOfPoint(playerid,3.0,209.9369,-135.1686,1002.8672) ||
	IsPlayerInRangeOfPoint(playerid,3.0,149.3744,-78.7390,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,208.4021,-7.5041,1001.2109) || IsPlayerInRangeOfPoint(playerid,3.0,198.6052,-166.8229,1000.5234) ||
	IsPlayerInRangeOfPoint(playerid,3.0,212.4442,-96.4369,1005.2578) || IsPlayerInRangeOfPoint(playerid,3.0,197.3729,-40.3967,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,199.3410,-138.7777,1003.5078) ||
	IsPlayerInRangeOfPoint(playerid,3.0,147.4459,-72.5470,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,226.1939,-11.2933,1002.2109) || IsPlayerInRangeOfPoint(playerid,3.0,202.4432,-166.7652,1000.5234) ||
	IsPlayerInRangeOfPoint(playerid,3.0,205.0045,-96.9579,1005.2578) || IsPlayerInRangeOfPoint(playerid,3.0,210.7852,-44.9170,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,215.7504,-137.4998,1003.5078) ||
	IsPlayerInRangeOfPoint(playerid,3.0,166.4640,-80.5297,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,226.2144,-5.1318,1002.2109) || IsPlayerInRangeOfPoint(playerid,3.0,210.0818,-166.7970,1000.5234) ||
	IsPlayerInRangeOfPoint(playerid,3.0,202.5804,-96.4468,1005.2578) || IsPlayerInRangeOfPoint(playerid,3.0,197.3730,-48.3824,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,216.1559,-132.9930,1003.5078) ||
	IsPlayerInRangeOfPoint(playerid,3.0,156.3242,-80.4837,1001.8047) || IsPlayerInRangeOfPoint(playerid,3.0,215.5925,-9.6650,1001.2109) || IsPlayerInRangeOfPoint(playerid,3.0,206.6252,-166.7522,1000.5306) ||
	IsPlayerInRangeOfPoint(playerid,3.0,274.8398,1085.8550,1913.8648) || IsPlayerInRangeOfPoint(playerid,3.0,295.5261,-38.5112,1001.5156) || IsPlayerInRangeOfPoint(playerid,3.0,499.9670,-20.7732,1000.6797) ||
	IsPlayerInRangeOfPoint(playerid,3.0,-81.9160,-1597.5673,2860.2357)) {
		for(new i; i != cBizz; i++) {
			if(IsPlayerInRangeOfPoint(playerid,50.0,Bizz::[i][bEnter][4],Bizz::[i][bEnter][5],Bizz::[i][bEnter][6]) && GetPlayerVirtualWorld(playerid) == Bizz::[i][bID]) {
				SetPVarInt(playerid,"PlayerBizzID",i);
				break;
			}
		}
		ShowUseSlots(playerid,3);
		camera = false;
	}
	//
	if(
		IsPlayerInRangeOfPoint(playerid,3.0,629.8479,196.1600,2001.0836) 
		|| IsPlayerInRangeOfPoint(playerid,3.0,392.9364,-1882.3732,2501.0859) 
		|| IsPlayerInRangeOfPoint(playerid,3.0,-134.7845,-1897.9773,2501.0859) 
		|| IsPlayerInRangeOfPoint(playerid,3.0,907.3466,-1845.6542,2501.0859) 
		|| IsPlayerInRangeOfPoint(playerid,3.0,312.5520,-166.1330,999.6010)) //
	{
	    if(GetPlayerVirtualWorld(playerid) == 1 || GetPlayerVirtualWorld(playerid) == 110 || GetPlayerVirtualWorld( playerid ) == 8 ) {
			if(Player[playerid][uIsPlayerJob][0] == 1)
			{
				ShowUseSlots(playerid,4);
				camera = false;
			}
		}
		if(GetPlayerVirtualWorld(playerid) == 3)
		{
		    if(Player[playerid][uIsPlayerJob][2] == 1)
			{
				ShowUseSlots(playerid,4);
				camera = false;
			}
		}
	}
	if(	IsPlayerInRangeOfPoint( playerid, 5.0, 624.3196,-562.0367,2594.0859 ) || // SADoC
		IsPlayerInRangeOfPoint( playerid, 5.0, -141.9430,-1878.3663,3001.0859) || // GHETTO
		IsPlayerInRangeOfPoint( playerid, 5.0, 1374.8418,-1733.8414,2949.9790)|| // LSFD
		IsPlayerInRangeOfPoint( playerid, 5.0, 1178.4286,-1315.2794,2804.5207)|| // MEDIC
		IsPlayerInRangeOfPoint( playerid, 5.0, 1667.0906,-1628.2998,4698.9728) || 
		IsPlayerInRangeOfPoint( playerid, 5.0, 1309.8645,-891.4843,3001.0859 ) || // FD
		IsPlayerInRangeOfPoint( playerid, 5.0, -925.2145,-563.7732,3001.0859 )) 
	{ 
        switch(Player[playerid][uMember]) 
		{
	        case 1,2,3,4,5,8: {
				ShowUseSlots(playerid,8);
				camera = false;
			}
		}
	}
	if( IsPlayerInRangeOfPoint( playerid, 3.0, 71.2379,-342.3935,2101.0859 ) ) {
        ShowUseSlots( playerid, 9 );// Еда в тюрьме
		camera = false;
	}
	if(camera == true)
	{
		GetPlayerPos(playerid,X,Y,Z);
		GetPlayerFacingAngle(playerid,R);
		X2 = X - 3.5 * floatsin(R, degrees );
		Y2 = Y + 3.5 * floatcos(R, degrees );
		InterpolateCameraPos(playerid,X,Y,Z,X2,Y2,Z,600,1000);
		InterpolateCameraLookAt(playerid,X,Y,Z,X,Y,Z,600,1000);
 	}
 	for(new i; i != 22; i++) 
	{
		if( i == 21 )
			continue;
		
		TextDrawShowForPlayer(playerid,invPlayer[i]);
	}
	for(new s; s != 61; s++) PlayerTextDrawShow(playerid,invSPlayer[playerid][s]);
	return 1;
}

stock GetIDPlayer(name[])
{
	foreach(new i: Player) if(GetPVarInt(i, "uLogin") == 1) if(!strcmp(name,Player[i][uName],true)) return i;
	return 0;
}

stock showSettings(playerid) {
	new spawn[90],walk[25],talk[25],style[25], radio[30];

	switch(Player[playerid][uSettings][1])
	{
	    case 0: spawn = ""cGREEN"Стандарт. спавн";
	    case 1: spawn = ""cGREEN"Фракция";
	    case 2: spawn = ""cGREEN"Дом";
	    case 3: spawn = ""cGREEN"Квартира";
		case 4: spawn = ""cGREEN"Там где вышел";
	}
	switch(Player[playerid][uSettings][6]) {
		case 0: walk = ""cGREEN"Стандартная";
	    default: format(walk,sizeof(walk),""cGREEN"Походка %d",Player[playerid][uSettings][6]);
	}
	switch(Player[playerid][uSettings][7]) {
		case 0 : talk = ""cGREEN"Стандартный";
		case 7 : talk = ""cGREEN"Нет";
	    default: format(talk,sizeof(talk),""cGREEN"Стиль %d",Player[playerid][uSettings][7]);
	}
	switch(Player[playerid][uChangeStyle]) {
		case 0: style = ""cGREEN"Стандартный";
	    case 1: style = ""cGREEN"Бокс";
	    case 2: style = ""cGREEN"Кунг-Фу";
	    case 3: style = ""cGREEN"Кик-Бокс";
	}
	switch(Player[playerid][uSettings][8])
	{
	    case 0: radio = ""cRED"Выкл";
	    case 1: radio = ""cGREEN"Вкл";
	}
	format:vb_string( "{FFFFFF}1. Спидометр транспортного средства - %s\n2. Полоска сытости - %s\n3. Скрывать ники игроков - %s\n4. Показывать действия администрации - %s\n\
	{ffffff}5. Место спавна персонажа - %s\n6. Стиль походки - %s\n7. Стиль разговора - %s\n8. Стиль боя - %s\n9. Скрывать OOC чат в /b - %s\n\
	{ffffff}10. Скрывать OOC чат в /ro - %s\n11. Скрывать личные сообщения - %s\n12. Полоска очков - %s\n13. Отображение рации - %s\n\
	14. Отображение эфиров - %s\n\
	15. Установка кода безопасности",
		Player[playerid][uSettings][0] ? (""cGREEN"Вкл") : (""cRED"Выкл"),
		Player[playerid][uSettings][2] ? (""cGREEN"Вкл") : (""cRED"Выкл"),
		Player[playerid][uSettings][3] ? (""cGREEN"Да") : (""cRED"Нет"),
		Player[playerid][uSettings][5] ? (""cGREEN"Да") : (""cRED"Нет"),
		spawn,walk,talk,style,
		Player[playerid][uOOC] ? (""cGREEN"Вкл") : (""cRED"Выкл"),
		Player[playerid][uRO] ? (""cGREEN"Вкл") : (""cRED"Выкл"),
		Player[playerid][uPM] ? (""cGREEN"Вкл") : (""cRED"Выкл"),
		Player[playerid][uShowJobValue] ? (""cGREEN"Вкл") : (""cRED"Выкл"),
		radio,
		Player[playerid][uEther] ? (""cGREEN"Вкл") : (""cRED"Выкл")
	);
	
    showPlayerDialog(playerid,d_menu,2," ",vb_string,"Далее","Закрыть");
    return 1;
}



stock split(const strsrc[], strdest[][], delimiter) {
    new i, li;
    new aNum;
    new len;
    while(i <= strlen(strsrc)) {
        if(strsrc[i] == delimiter || i == strlen(strsrc)) {
            len                = strmid(strdest[aNum], strsrc, li, i, 128);
            strdest[aNum][len] = 0;
            li                 = i+1;
            aNum++;
        }
        i++;
    }
    return 1;
}
stock GetVehicleBagg( modelid )
{
	new slots;
	switch(modelid)
	{
	    case 400,444,458,556,557: slots = 9;
	    case 401,402,429,412,410,439,518,533,536,546,549,575,585,593: slots = 5;
	    case 403,477,481,484 .. 486,493,494,501 .. 504,509 .. 515,581,520,523 .. 524,604,605,587,588,525,583,584,530 .. 532,537 .. 539,552,564,568 .. 572,574,577,578: slots = 0;
	    case 404: slots = 11;
	    case 595: slots = 10;
	    case 405,442: slots = 7;
	    case 406,408,417,411,423,424,425,430,431,432,435,437,441,443,446,447,449,450,452,453,454,460,464 .. 465,469, 472,473,476,590,591,594,606 .. 608,610,611: slots = 0;
	    case 409,470,478,479,495,505,528,535,543,600: slots = 8;
	    case 413: slots = 15;
	    case 414: slots = 18;
	    case 415,451,500,506,541,555: slots = 3;
	    case 418, 407: slots = 12;
	    case 596,597,598: slots = 10;
	    case 419,420,426,436,445,466,467,474,475,480,491,492,496,507,516,529,534,542,547,550,551,560,562,566,567,576: slots = 6;
	    case 421,438,517,579,580: slots = 7;
	    case 422,489,490,599,601,416: slots = 10;
	    case 427,428,440,482,483,498,499,508,553,609,573: slots = 16;
	    case 433,455,456,519,548,592: slots = 18;
	    case 434,487,488,497,526,527,540,545,558,559,565,589,602,603: slots = 4;
	    case 448,457: slots = 2;
	    case 459: slots = 14;
		case 554,563,544: slots = 12;
		case 461, 462, 463, 468, 471, 521, 522, 582, 586: slots = 2;
	}
	return slots;
}

stock GetVehicleBag(vehicleid)
{
	new slots;
	switch(GetVehicleModel(vehicleid))
	{
	    case 400,444,458,556,557: slots = 9;
	    case 401,402,429,412,410,439,518,533,536,546,549,575,585,593: slots = 5;
	    case 403,477,481,484 .. 486,493,494,501 .. 504,509 .. 515,581,520,523 .. 524,604,605,587,588,525,583,584,530 .. 532,537 .. 539,552,564,568 .. 572,574,577,578: slots = 0;
	    case 404: slots = 11;
	    case 595: slots = 10;
	    case 405,442: slots = 7;
	    case 406,408,417,411,423,424,425,430,431,432,435,437,441,443,446,447,449,450,452,453,454,460,464 .. 465,469, 472,473,476,590,591,594,606 .. 608,610,611: slots = 0;
	    case 409,470,478,479,495,505,528,535,543,600: slots = 8;
	    case 413: slots = 15;
	    case 414: slots = 18;
	    case 415,451,500,506,541,555: slots = 3;
	    case 418, 407: slots = 12;
	    case 596,597,598: slots = 10;
	    case 419,420,426,436,445,466,467,474,475,480,491,492,496,507,516,529,534,542,547,550,551,560,562,566,567,576: slots = 6;
	    case 421,438,517,579,580: slots = 7;
	    case 422,489,490,599,601,416: slots = 10;
	    case 427,428,440,482,483,498,499,508,553,609, 573: slots = 16;
	    case 433,455,456,519,548,592: slots = 18;
	    case 434,487,488,497,526,527,540,545,558,559,565,589,602,603: slots = 4;
	    case 448,457: slots = 2;
	    case 459: slots = 14;
		case 554,563, 544: slots = 12;
		case 461, 462, 463, 468, 471, 521, 522, 582, 586: slots = 2;
	}
	return slots;
}

stock PlayerBuyingSkinShop(playerid,s1 = 0,s2 = 0,s3 = 0,s4 = 0,s5 = 0,s6 = 0,s7 = 0,s8 = 0,s9 = 0,s10 = 0,s11 = 0,s12 = 0,s13 = 0,s14 = 0,s15 = 0,s16 = 0) {
	PlayerBuyingItemsShop[playerid][0] = s1;
	PlayerBuyingItemsShop[playerid][1] = s2;
	PlayerBuyingItemsShop[playerid][2] = s3;
	PlayerBuyingItemsShop[playerid][3] = s4;
	PlayerBuyingItemsShop[playerid][4] = s5;
	PlayerBuyingItemsShop[playerid][5] = s6;
	PlayerBuyingItemsShop[playerid][6] = s7;
	PlayerBuyingItemsShop[playerid][7] = s8;
	PlayerBuyingItemsShop[playerid][8] = s9;
	PlayerBuyingItemsShop[playerid][9] = s10;
	PlayerBuyingItemsShop[playerid][10] = s11;
	PlayerBuyingItemsShop[playerid][11] = s12;
	PlayerBuyingItemsShop[playerid][12] = s13;
	PlayerBuyingItemsShop[playerid][13] = s14;
	PlayerBuyingItemsShop[playerid][14] = s15;
	PlayerBuyingItemsShop[playerid][15] = s16;
}

stock PlayerBuyingSkinShopProd(playerid,s1 = 0,s2 = 0,s3 = 0,s4 = 0,s5 = 0,s6 = 0,s7 = 0,s8 = 0,s9 = 0,s10 = 0,s11 = 0,s12 = 0,s13 = 0,s14 = 0,s15 = 0,s16 = 0) {
	PlayerBuyingItemsShopProd[playerid][0] = s1;
	PlayerBuyingItemsShopProd[playerid][1] = s2;
	PlayerBuyingItemsShopProd[playerid][2] = s3;
	PlayerBuyingItemsShopProd[playerid][3] = s4;
	PlayerBuyingItemsShopProd[playerid][4] = s5;
	PlayerBuyingItemsShopProd[playerid][5] = s6;
	PlayerBuyingItemsShopProd[playerid][6] = s7;
	PlayerBuyingItemsShopProd[playerid][7] = s8;
	PlayerBuyingItemsShopProd[playerid][8] = s9;
	PlayerBuyingItemsShopProd[playerid][9] = s10;
	PlayerBuyingItemsShopProd[playerid][10] = s11;
	PlayerBuyingItemsShopProd[playerid][11] = s12;
	PlayerBuyingItemsShopProd[playerid][12] = s13;
	PlayerBuyingItemsShopProd[playerid][13] = s14;
	PlayerBuyingItemsShopProd[playerid][14] = s15;
	PlayerBuyingItemsShopProd[playerid][15] = s16;
}
stock SetBizzInt(idx, stolb[], znach) {
	new Query[128];
	format(Query, sizeof(Query), "UPDATE gb_business SET %s = '%d' WHERE bID = '%d'", stolb, znach, idx);
	return mysql_tquery(1, Query, "", "");
}
stock SetBizzStr(idx, stolb[], znach[]) {
	new Query[128];
	format(Query, sizeof(Query), "UPDATE gb_business SET  %s = '%s' WHERE bID = '%d'", stolb, znach, idx);
	return mysql_tquery(1, Query, "", "");
}


stock SetCarStr(idx, stolb[], znach[]) {
	new Query[128];
	format(Query, sizeof(Query), "UPDATE gb_cars SET  %s = '%s' WHERE cID = '%d'", stolb, znach, idx);
	return mysql_tquery(1, Query, "", "");

}
stock SetCarInt(idx, stolb[], znach) {
	new Query[128];
	format(Query, sizeof(Query), "UPDATE gb_cars SET  %s = '%d' WHERE cID = '%d'", stolb, znach, idx);
	return mysql_tquery(1, Query, "", "");

}

stock ClothesBuying(id) {
	switch(Bizz::[id][bSettings][1]) {
		case 15:{
			Bizz::[id][bTextBuy][0] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,210.1204,-102.2575,1005.2578,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][1] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,205.2868,-102.2578,1005.2578,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][2] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,212.4442,-96.4369,1005.2578,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][3] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,205.0045,-96.9579,1005.2578,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][4] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,202.5804,-96.4468,1005.2578,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
		}
		case 1: {
			Bizz::[id][bTextBuy][0] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,210.5399,-34.1924,1001.9297,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][1] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,208.5928,-33.9872,1001.9297,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][2] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,197.3729,-40.3967,1001.8047,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][3] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,210.7852,-44.9170,1001.8047,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][4] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,197.3730,-48.3824,1001.8047,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
		}
		case 3: {
			Bizz::[id][bTextBuy][0] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,206.9977,-135.6739,1002.8744,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][1] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,209.9369,-135.1686,1002.8672,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][2] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,199.3410,-138.7777,1003.5078,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][3] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,215.7504,-137.4998,1003.5078,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][4] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,216.1559,-132.9930,1003.5078,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
		}
		case 18: {
			Bizz::[id][bTextBuy][0] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,150.9207,-75.5895,1001.8047,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][1] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,149.3744,-78.7390,1001.8047,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][2] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,147.4459,-72.5470,1001.8047,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][3] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,166.4640,-80.5297,1001.8047,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][4] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,156.3242,-80.4837,1001.8047,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
		}
		case 5: {
			Bizz::[id][bTextBuy][0] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,211.3265,-9.5800,1001.2109,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][1] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,208.4021,-7.5041,1001.2109,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][2] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,226.1939,-11.2933,1002.2109,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][3] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,226.2144,-5.1318,1002.2109,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][4] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,215.5925,-9.6650,1001.2109,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
		}
		case 14: {
			Bizz::[id][bTextBuy][0] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,198.8070,-157.5421,1000.5234,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][1] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,198.6052,-166.8229,1000.5234,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][2] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,202.4432,-166.7652,1000.5234,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][3] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,210.0818,-166.7970,1000.5234,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
			Bizz::[id][bTextBuy][4] = CreateDynamic3DTextLabel("Нажмите "cBLUE"Y\n{ffffff}[ Открыть свой инвентарь ]",0xFFFFFFFF,206.6252,-166.7522,1000.5306,5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,Bizz::[id][bID]);
		}
	}
}

stock AlhambraObjects(id) {
    Bizz::[id][bAObject][0] = CreateDynamicObject(2232, 477.60049, -12.90170, 1004.26349,   0.00000, 180.00000, 90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][1] = CreateDynamicObject(2232, 477.60049, -17.09960, 1004.26349,   0.00000, 180.00000, 90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][2] = CreateDynamicObject(2104, 477.14456, -17.65521, 1002.69043,   0.00000, 0.00000, -90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][3] = CreateDynamicObject(2101, 476.64120, -14.12650, 1002.90289,   0.00000, 0.00000, -90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][4] = CreateDynamicObject(1962, 477.07880, -11.76550, 1004.54572,   0.00000, 0.00000, -90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][5] = CreateDynamicObject(1961, 477.07880, -11.76548, 1003.64600,   0.00000, 0.00000, -90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][6] = CreateDynamicObject(1960, 477.08981, -12.54811, 1004.22198,   0.00000, 0.00000, -90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][7] = CreateDynamicObject(2173, 476.91269, -16.57600, 1002.68750,   0.00000, 0.00000, -270.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][8] = CreateDynamicObject(2173, 476.91269, -14.61240, 1002.68750,   0.00000, 0.00000, -270.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][9] = CreateDynamicObject(1955, 476.42325, -16.18555, 1003.67029,   89.00000, 40.00000, -200.18004,Bizz::[id][bID]);
	Bizz::[id][bAObject][10] = CreateDynamicObject(1726, 473.49500, -10.82700, 1002.67047,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][11] = CreateDynamicObject(1726, 474.02380, -12.32860, 1002.67102,   0.00000, 0.00000, 90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][12] = CreateDynamicObject(1727, 475.89505, -10.84550, 1002.69104,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][13] = CreateDynamicObject(1727, 476.64941, -19.91310, 1002.69098,   0.00000, 0.00000, -135.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][14] = CreateDynamicObject(2125, 475.66290, -16.21253, 1002.99622,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][15] = CreateDynamicObject(2125, 475.59760, -14.28439, 1002.99622,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][16] = CreateDynamicObject(2104, 477.14459, -18.23000, 1002.69043,   0.00000, 0.00000, -90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][17] = CreateDynamicObject(2596, 475.26611, -10.63760, 1004.95422,   6.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][18] = CreateDynamicObject(16780, 475.09531, -14.95660, 1005.43988,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][19] = CreateDynamicObject(1512, 476.58206, -16.91047, 1003.67676,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][20] = CreateDynamicObject(1520, 476.85983, -16.99803, 1003.52606,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][21] = CreateDynamicObject(1520, 476.73447, -18.23740, 1004.07166,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][22] = CreateDynamicObject(2101, 476.64120, -16.08650, 1002.90289,   0.00000, 0.00000, -90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][23] = CreateDynamicObject(1955, 476.38516, -14.84534, 1003.67029,   89.00000, 40.00000, -223.52005,Bizz::[id][bID]);
	Bizz::[id][bAObject][24] = CreateDynamicObject(14820, 476.69971, -15.03685, 1003.54999,   0.00000, 0.00000, -90.60000,Bizz::[id][bID]);
	Bizz::[id][bAObject][25] = CreateDynamicObject(14411, 475.26361, -23.76157, 999.47931,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][26] = CreateDynamicObject(1726, 505.36859, -1.38710, 999.63623,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][27] = CreateDynamicObject(1726, 506.87659, -0.84430, 999.63501,   0.00000, 0.00000, -90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][28] = CreateDynamicObject(1726, 506.85660, -3.52526, 999.63501,   0.00000, 0.00000, -90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][29] = CreateDynamicObject(1726, 506.87659, -6.12750, 999.63501,   0.00000, 0.00000, -90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][30] = CreateDynamicObject(1726, 507.42001, -7.61240, 999.63623,   0.00000, 0.00000, -180.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][31] = CreateDynamicObject(2126, 505.65170, -6.31731, 999.67651,   0.00000, 0.00000, 90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][32] = CreateDynamicObject(2126, 505.63531, -3.83705, 999.67651,   0.00000, 0.00000, 90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][33] = CreateDynamicObject(2229, 492.45911, -0.40720, 1001.04919,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][34] = CreateDynamicObject(2229, 483.22198, -0.35115, 1001.04919,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][35] = CreateDynamicObject(1789, 503.11642, -10.51024, 1000.21667,   0.00000, 0.00000, 144.71999,Bizz::[id][bID]);
	Bizz::[id][bAObject][36] = CreateDynamicObject(19328, 502.13876, -9.80449, 1003.07251,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][37] = CreateDynamicObject(19319, 483.07068, -3.04050, 1001.73718,   -16.00000, 0.00000, 113.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][38] = CreateDynamicObject(19318, 492.74545, -2.93049, 1001.77588,   -8.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][39] = CreateDynamicObject(2686, 503.97601, -13.19966, 1001.35156,   0.00000, 0.00000, -90.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][40] = CreateDynamicObject(2596, 503.79160, -1.20694, 1002.66980,   6.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][41] = CreateDynamicObject(2596, 504.55573, -7.78360, 1002.66980,   6.00000, 0.00000, 180.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][42] = CreateDynamicObject(1517, 505.31119, -3.84980, 1000.34381,   0.00000, 0.00000, 97.38000,Bizz::[id][bID]);
	Bizz::[id][bAObject][43] = CreateDynamicObject(1520, 505.09070, -6.40392, 1000.20313,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][44] = CreateDynamicObject(1520, 504.96570, -5.18887, 1000.20313,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][45] = CreateDynamicObject(1520, 505.04749, -4.02813, 1000.20313,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][46] = CreateDynamicObject(1517, 504.99213, -3.88187, 1000.34381,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][47] = CreateDynamicObject(1517, 505.28854, -2.73478, 1000.34381,   0.00000, 0.00000, -41.94000,Bizz::[id][bID]);
	Bizz::[id][bAObject][48] = CreateDynamicObject(1520, 505.31302, -4.05452, 1000.20313,   0.00000, 0.00000, -61.85999,Bizz::[id][bID]);
	Bizz::[id][bAObject][49] = CreateDynamicObject(1520, 504.77695, -3.96207, 1000.20313,   0.00000, 0.00000, -120.35999,Bizz::[id][bID]);
	Bizz::[id][bAObject][50] = CreateDynamicObject(1517, 505.05121, -2.78849, 1000.34381,   0.00000, 0.00000, -16.74000,Bizz::[id][bID]);
	Bizz::[id][bAObject][51] = CreateDynamicObject(19159, 487.82565, -13.87647, 1004.49969,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][52] = CreateDynamicObject(18102, 490.72791, -7.17784, 1005.77332,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
	Bizz::[id][bAObject][53] = CreateDynamicObject(18102, 493.26627, 9.16929, 1004.07458,   -90.00000, 0.00000, -8.10000,Bizz::[id][bID]);
}

stock ClothesObjects(id)
{
    Bizz::[id][bObjects][0] = CreateDynamicObject(18931, 201.26, -166.26, 999.87,   0.00, -90.00, -47.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][1] = CreateDynamicObject(18932, 200.71, -166.25, 999.87,   0.00, -90.00, 18.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][2] = CreateDynamicObject(18933, 200.20, -166.24, 999.87,   0.00, -90.00, 4.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][3] = CreateDynamicObject(18934, 199.52, -166.23, 999.87,   0.00, -90.00, 46.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][4] = CreateDynamicObject(18930, 201.69, -166.76, 999.87,   0.00, -90.00, -127.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][5] = CreateDynamicObject(18935, 198.98, -166.78, 999.87,   0.00, -90.00, -295.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][6] = CreateDynamicObject(18929, 201.17, -167.30, 999.87,   0.00, -90.00, -193.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][7] = CreateDynamicObject(18928, 200.59, -167.29, 999.87,   0.00, -90.00, -164.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][8] = CreateDynamicObject(18927, 200.02, -167.28, 999.87,   0.00, -90.00, -236.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][9] = CreateDynamicObject(18926, 199.43, -167.27, 999.87,   0.00, -90.00, -190.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][10] = CreateDynamicObject(19424, 201.07, -166.84, 1000.41,   -8.00, 0.00, -135.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][11] = CreateDynamicObject(19423, 200.64, -166.73, 1000.41,   -8.00, 0.00, -47.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][12] = CreateDynamicObject(19422, 200.16, -166.95, 1000.41,   -8.00, 0.00, 33.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][13] = CreateDynamicObject(19421, 199.61, -166.59, 1000.41,   -8.00, 0.00, -127.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][14] = CreateDynamicObject(18948, 208.98, -166.36, 999.88,   -10.00, -90.00, -76.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][15] = CreateDynamicObject(18949, 208.33, -166.18, 999.88,   -15.00, -90.00, -164.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][16] = CreateDynamicObject(18950, 207.74, -166.28, 999.88,   -15.00, -90.00, -287.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][17] = CreateDynamicObject(18947, 209.72, -166.82, 999.88,   -10.00, -90.00, 40.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][18] = CreateDynamicObject(18946, 208.95, -167.22, 999.88,   -10.00, -90.00, 149.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][19] = CreateDynamicObject(18945, 207.67, -167.28, 999.88,   -10.00, -90.00, 18.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][20] = CreateDynamicObject(18944, 207.02, -166.83, 999.88,   -10.00, -90.00, 105.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][21] = CreateDynamicObject(18951, 208.30, -167.30, 999.88,   -15.00, -90.00, -287.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][22] = CreateDynamicObject(18920, 207.67, -166.92, 1000.49,   60.00, 0.00, -69.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][23] = CreateDynamicObject(18913, 207.57, -166.68, 1000.49,   60.00, 0.00, 149.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][24] = CreateDynamicObject(18919, 208.07, -166.86, 1000.49,   60.00, 0.00, -33.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][25] = CreateDynamicObject(18918, 208.47, -166.89, 1000.49,   60.00, 0.00, 25.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][26] = CreateDynamicObject(18917, 208.97, -166.93, 1000.49,   60.00, 0.00, -43.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][27] = CreateDynamicObject(18916, 208.94, -166.67, 1000.49,   60.00, 0.00, -193.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][28] = CreateDynamicObject(18915, 208.53, -166.59, 1000.49,   60.00, 0.00, -105.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][29] = CreateDynamicObject(18914, 208.00, -166.62, 1000.49,   60.00, 0.00, 236.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][30] = CreateDynamicObject(18912, 207.97, -166.76, 1000.88,   60.00, 0.00, 265.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][31] = CreateDynamicObject(18911, 208.73, -166.77, 1000.88,   60.00, 0.00, 120.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][32] = CreateDynamicObject(19140, 201.23, -155.56, 1000.75,   0.00, 0.00, -127.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][33] = CreateDynamicObject(19139, 200.70, -155.59, 1000.75,   0.00, 0.00, -53.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][34] = CreateDynamicObject(19022, 199.79, -155.90, 1001.04,   0.00, 0.00, -105.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][35] = CreateDynamicObject(19035, 199.43, -156.05, 1001.03,   0.00, 0.00, -62.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][36] = CreateDynamicObject(19033, 199.01, -156.26, 1001.03,   0.00, 0.00, -11.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][37] = CreateDynamicObject(19031, 197.51, -157.80, 1001.04,   0.00, 0.00, -25.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][38] = CreateDynamicObject(19032, 197.26, -158.27, 1001.03,   0.00, 0.00, -45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][39] = CreateDynamicObject(19029, 197.51, -157.81, 1000.47,   0.00, 0.00, -77.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][40] = CreateDynamicObject(19027, 196.88, -159.28, 1000.75,   0.00, 0.00, -40.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][41] = CreateDynamicObject(19028, 196.78, -160.07, 1000.75,   0.00, 0.00, 55.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][42] = CreateDynamicObject(19012, 196.79, -159.71, 1000.75,   0.00, 0.00, -1.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][43] = CreateDynamicObject(19019, 198.54, -156.65, 1000.75,   0.00, 0.00, -98.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][44] = CreateDynamicObject(19024, 197.94, -157.23, 1000.75,   0.00, 0.00, -15.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][45] = CreateDynamicObject(19017, 199.58, -155.99, 1000.46,   0.00, 0.00, -55.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][46] = CreateDynamicObject(19018, 199.23, -156.19, 1000.46,   0.00, 0.00, -25.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][47] = CreateDynamicObject(19016, 199.98, -155.81, 1000.46,   0.00, 0.00, -84.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][48] = CreateDynamicObject(19014, 197.28, -158.18, 1000.46,   0.00, 0.00, -25.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][49] = CreateDynamicObject(19015, 197.11, -158.56, 1000.46,   0.00, 0.00, 11.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][50] = CreateDynamicObject(19013, 197.04, -158.71, 1001.03,   0.00, 0.00, 18.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][51] = CreateDynamicObject(19011, 198.21, -156.87, 1000.75,   0.00, 0.00, -49.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][52] = CreateDynamicObject(19007, 200.33, -155.70, 1000.75,   0.00, 0.00, -127.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][53] = CreateDynamicObject(18911, 216.15370, -136.04201, 1003.43829,   -265.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][54] = CreateDynamicObject(18912, 216.15370, -136.63100, 1003.43829,   -265.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][55] = CreateDynamicObject(18913, 216.15370, -137.23801, 1003.43829,   -265.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][56] = CreateDynamicObject(18914, 216.15370, -137.82100, 1003.43829,   -265.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][57] = CreateDynamicObject(18915, 216.15370, -138.40800, 1003.43829,   -265.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][58] = CreateDynamicObject(18916, 216.15370, -136.04201, 1004.27832,   -265.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][59] = CreateDynamicObject(18917, 216.15370, -136.63100, 1004.27832,   -265.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][60] = CreateDynamicObject(18918, 216.15370, -137.23801, 1004.27832,   -265.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][61] = CreateDynamicObject(18919, 216.15370, -137.82100, 1004.27832,   -265.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][62] = CreateDynamicObject(18920, 216.15370, -138.40800, 1004.25830,   -265.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][63] = CreateDynamicObject(19421, 209.93570, -136.75650, 1003.12061,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][64] = CreateDynamicObject(19422, 209.41217, -136.31111, 1003.12079,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][65] = CreateDynamicObject(19423, 209.94231, -135.79140, 1003.12079,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][66] = CreateDynamicObject(19424, 210.44540, -136.29680, 1003.12097,   0.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][67] = CreateDynamicObject(2491, 207.24290, -134.83482, 1001.86871,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][68] = CreateDynamicObject(18926, 198.91620, -138.80350, 1002.98810,   16.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][69] = CreateDynamicObject(18927, 198.91620, -138.80350, 1003.32813,   16.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][70] = CreateDynamicObject(18928, 198.91620, -138.80350, 1003.66809,   16.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][71] = CreateDynamicObject(18929, 198.72980, -138.56180, 1003.66809,   16.00000, -90.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][72] = CreateDynamicObject(18930, 198.72980, -138.56180, 1003.32813,   16.00000, -90.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][73] = CreateDynamicObject(18931, 198.72980, -138.56180, 1002.98810,   16.00000, -90.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][74] = CreateDynamicObject(18932, 198.48489, -138.73900, 1002.98810,   16.00000, -90.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][75] = CreateDynamicObject(18933, 198.48489, -138.73900, 1003.32813,   16.00000, -90.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][76] = CreateDynamicObject(18934, 198.48489, -138.73900, 1003.66809,   16.00000, -90.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][77] = CreateDynamicObject(18935, 198.66060, -138.97040, 1003.32813,   16.00000, -90.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][78] = CreateDynamicObject(2376, 217.56525, -134.19743, 1002.50592,   0.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][79] = CreateDynamicObject(18944, 217.06230, -132.17500, 1003.44067,   -10.00000, -90.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][80] = CreateDynamicObject(18945, 217.06230, -132.61501, 1003.44067,   -10.00000, -90.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][81] = CreateDynamicObject(18946, 217.06230, -133.45500, 1003.44067,   -10.00000, -90.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][82] = CreateDynamicObject(18947, 217.06230, -133.91499, 1003.44067,   -10.00000, -90.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][83] = CreateDynamicObject(18948, 217.06230, -133.03500, 1003.44067,   -10.00000, -90.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][84] = CreateDynamicObject(18949, 217.22231, -132.61501, 1003.84070,   -10.00000, -90.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][85] = CreateDynamicObject(18950, 217.22231, -133.03500, 1003.84070,   -10.00000, -90.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][86] = CreateDynamicObject(18951, 217.22231, -133.45500, 1003.84070,   -10.00000, -90.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][87] = CreateDynamicObject(19140, 206.99680, -135.25000, 1003.45978,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][88] = CreateDynamicObject(19139, 206.99680, -135.25000, 1003.31982,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][89] = CreateDynamicObject(19033, 206.99680, -135.25000, 1003.15979,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][90] = CreateDynamicObject(19035, 206.99680, -135.25000, 1002.99982,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][91] = CreateDynamicObject(19022, 206.99680, -135.25000, 1002.81982,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][92] = CreateDynamicObject(19032, 206.99680, -135.25000, 1002.63977,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][93] = CreateDynamicObject(19031, 206.99680, -135.25000, 1002.45978,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][94] = CreateDynamicObject(19029, 207.15910, -135.07561, 1003.45978,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][95] = CreateDynamicObject(19028, 207.15910, -135.07561, 1003.31982,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][96] = CreateDynamicObject(19027, 207.15910, -135.07561, 1003.15979,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][97] = CreateDynamicObject(19024, 207.15910, -135.07561, 1002.99982,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][98] = CreateDynamicObject(19019, 207.15910, -135.07561, 1002.81982,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][99] = CreateDynamicObject(19018, 207.15910, -135.07561, 1002.63977,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][100] = CreateDynamicObject(19017, 207.15910, -135.07561, 1002.45978,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][101] = CreateDynamicObject(19016, 206.81390, -135.06480, 1003.45978,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][102] = CreateDynamicObject(19015, 206.81390, -135.06480, 1003.31982,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][103] = CreateDynamicObject(19014, 206.81390, -135.06480, 1003.15979,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][104] = CreateDynamicObject(19013, 206.81390, -135.06480, 1002.97980,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][105] = CreateDynamicObject(19012, 206.81390, -135.06480, 1002.79980,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][106] = CreateDynamicObject(19011, 206.81390, -135.06480, 1002.61981,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][107] = CreateDynamicObject(19007, 206.81390, -135.06480, 1002.43982,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][108] = CreateDynamicObject(2376, 157.37204, -79.37580, 1000.82031,   356.85840, 90.00000, -1.57080,Bizz::[id][bID]);
    Bizz::[id][bObjects][109] = CreateDynamicObject(2491, 150.56467, -75.33871, 1000.85004,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][110] = CreateDynamicObject(18926, 146.53140, -72.25520, 1002.03082,   0.00000, -90.00000, -120.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][111] = CreateDynamicObject(18927, 147.15311, -71.61760, 1002.03082,   0.00000, -90.00000, -149.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][112] = CreateDynamicObject(18928, 146.53140, -72.25520, 1002.59082,   0.00000, -90.00000, -120.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][113] = CreateDynamicObject(18929, 147.15311, -71.61760, 1002.59082,   0.00000, -90.00000, -149.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][114] = CreateDynamicObject(18930, 147.64799, -71.24360, 1002.31079,   0.00000, -90.00000, -127.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][115] = CreateDynamicObject(18931, 148.56990, -70.76300, 1002.31079,   0.00000, -90.00000, -178.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][116] = CreateDynamicObject(18932, 146.12469, -72.74890, 1002.31079,   0.00000, -90.00000, -142.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][117] = CreateDynamicObject(18933, 145.62590, -73.73920, 1002.31079,   0.00000, -90.00000, -105.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][118] = CreateDynamicObject(18934, 145.91510, -73.20240, 1001.75079,   0.00000, -90.00000, -118.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][119] = CreateDynamicObject(18935, 148.11960, -71.01960, 1001.75079,   0.00000, -90.00000, -153.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][120] = CreateDynamicObject(18944, 157.52498, -79.65613, 1001.75470,   -10.00000, -90.00000, -90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][121] = CreateDynamicObject(18945, 157.52499, -80.09610, 1001.75470,   -10.00000, -90.00000, -90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][122] = CreateDynamicObject(18946, 157.52499, -80.53610, 1001.75470,   -10.00000, -90.00000, -90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][123] = CreateDynamicObject(18947, 157.52499, -81.01610, 1001.73468,   -14.00000, -90.00000, -90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][124] = CreateDynamicObject(18948, 157.52499, -81.43610, 1001.73468,   -14.00000, -90.00000, -90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][125] = CreateDynamicObject(18950, 157.70500, -81.01610, 1002.13470,   -14.00000, -90.00000, -90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][126] = CreateDynamicObject(18949, 157.70500, -80.53610, 1002.13470,   -14.00000, -90.00000, -90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][127] = CreateDynamicObject(18951, 157.70500, -80.09610, 1002.13470,   -14.00000, -90.00000, -90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][128] = CreateDynamicObject(2376, 164.86607, -79.37934, 1000.82031,   356.85840, 90.00000, -1.57080,Bizz::[id][bID]);
    Bizz::[id][bObjects][129] = CreateDynamicObject(18963, 165.39590, -81.44750, 1001.85522,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][130] = CreateDynamicObject(18911, 165.39349, -81.44930, 1001.85303,   90.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][131] = CreateDynamicObject(18963, 165.39590, -81.04750, 1001.85522,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][132] = CreateDynamicObject(18912, 165.39349, -81.04930, 1001.85303,   90.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][133] = CreateDynamicObject(18963, 165.39590, -80.55050, 1001.85522,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][134] = CreateDynamicObject(18913, 165.39349, -80.55230, 1001.85303,   90.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][135] = CreateDynamicObject(18963, 165.39590, -79.58750, 1001.85522,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][136] = CreateDynamicObject(18914, 165.39349, -79.59030, 1001.85303,   90.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][137] = CreateDynamicObject(18963, 165.39590, -79.98750, 1001.85522,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][138] = CreateDynamicObject(18915, 165.39349, -79.99030, 1001.85303,   90.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][139] = CreateDynamicObject(18963, 165.23590, -79.58750, 1002.25519,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][140] = CreateDynamicObject(18916, 165.23351, -79.59030, 1002.25299,   90.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][141] = CreateDynamicObject(18963, 165.23590, -79.98750, 1002.25519,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][142] = CreateDynamicObject(18917, 165.23351, -79.99030, 1002.25299,   90.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][143] = CreateDynamicObject(18963, 165.23590, -80.55050, 1002.25519,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][144] = CreateDynamicObject(18918, 165.23351, -80.55230, 1002.25299,   90.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][145] = CreateDynamicObject(18963, 165.23590, -81.04750, 1002.25519,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][146] = CreateDynamicObject(18919, 165.23351, -81.04930, 1002.25299,   90.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][147] = CreateDynamicObject(18963, 165.23579, -81.42750, 1002.25519,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][148] = CreateDynamicObject(18920, 165.23351, -81.42930, 1002.25299,   90.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][149] = CreateDynamicObject(2366, 150.21820, -79.01540, 1000.84967,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][150] = CreateDynamicObject(19421, 150.00693, -78.71376, 1002.10840,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][151] = CreateDynamicObject(19422, 150.26990, -78.28720, 1002.10840,   0.00000, 0.00000, 222.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][152] = CreateDynamicObject(19423, 150.26830, -79.11740, 1002.10840,   0.00000, 0.00000, 316.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][153] = CreateDynamicObject(19424, 150.74010, -79.17470, 1002.10840,   0.00000, 0.00000, 11.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][154] = CreateDynamicObject(19140, 150.31619, -75.74530, 1002.44128,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][155] = CreateDynamicObject(19139, 150.31619, -75.74530, 1002.28131,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][156] = CreateDynamicObject(19033, 150.31619, -75.74530, 1002.10132,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][157] = CreateDynamicObject(19035, 150.31619, -75.74530, 1001.90131,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][158] = CreateDynamicObject(19022, 150.31619, -75.74530, 1001.70129,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][159] = CreateDynamicObject(19032, 150.31619, -75.74530, 1001.48132,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][160] = CreateDynamicObject(19031, 150.15089, -75.56910, 1002.44128,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][161] = CreateDynamicObject(19029, 150.15089, -75.56910, 1002.28131,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][162] = CreateDynamicObject(19028, 150.15089, -75.56910, 1002.10132,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][163] = CreateDynamicObject(19027, 150.15089, -75.56910, 1001.90131,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][164] = CreateDynamicObject(19024, 150.15089, -75.56910, 1001.70129,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][165] = CreateDynamicObject(19019, 150.15089, -75.56910, 1001.48132,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][166] = CreateDynamicObject(19018, 150.48981, -75.57400, 1001.48132,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][167] = CreateDynamicObject(19017, 150.48981, -75.57400, 1001.70129,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][168] = CreateDynamicObject(19016, 150.48981, -75.57400, 1001.90131,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][169] = CreateDynamicObject(19015, 150.48981, -75.57400, 1002.10132,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][170] = CreateDynamicObject(19014, 150.48981, -75.57400, 1002.28131,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][171] = CreateDynamicObject(19013, 150.48981, -75.57400, 1002.44128,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][172] = CreateDynamicObject(19012, 150.31660, -75.41360, 1002.44128,   0.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][173] = CreateDynamicObject(19011, 150.31660, -75.41360, 1002.28131,   0.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][174] = CreateDynamicObject(19007, 150.31660, -75.41360, 1002.10132,   0.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][175] = CreateDynamicObject(2376, 201.43, -95.78, 1004.43,   0.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][176] = CreateDynamicObject(18947, 202.13, -95.45, 1005.75,   -15.00, -90.00, 45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][177] = CreateDynamicObject(18946, 203.08, -95.45, 1005.75,   -11.00, -90.00, -45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][178] = CreateDynamicObject(18948, 202.30, -95.51, 1005.34,   -15.00, -90.00, 20.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][179] = CreateDynamicObject(18949, 201.84, -95.56, 1005.34,   -15.00, -90.00, 20.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][180] = CreateDynamicObject(18945, 203.12, -95.99, 1004.81,   -15.00, -90.00, -20.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][181] = CreateDynamicObject(18944, 202.00, -95.96, 1004.80,   -15.00, -90.00, 20.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][182] = CreateDynamicObject(18950, 203.34, -95.56, 1005.34,   -15.00, -90.00, -20.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][183] = CreateDynamicObject(18951, 202.89, -95.54, 1005.34,   -15.00, -90.00, -20.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][184] = CreateDynamicObject(2376, 211.33, -95.77, 1004.43,   0.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][185] = CreateDynamicObject(2491, 210.56, -101.50, 1004.26,   0.00, 0.00, 45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][186] = CreateDynamicObject(2491, 204.86, -101.50, 1004.29,   0.00, 0.00, 45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][187] = CreateDynamicObject(19140, 210.42, -101.98, 1005.79,   0.00, 20.00, -135.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][188] = CreateDynamicObject(19139, 210.42, -101.98, 1005.60,   0.00, 20.00, -135.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][189] = CreateDynamicObject(19033, 210.42, -101.98, 1005.42,   0.00, 20.00, -135.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][190] = CreateDynamicObject(19035, 210.42, -101.98, 1005.25,   0.00, 20.00, -135.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][191] = CreateDynamicObject(19022, 210.71, -101.98, 1005.79,   0.00, 20.00, -45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][192] = CreateDynamicObject(19032, 210.70, -101.98, 1005.60,   0.00, 20.00, -45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][193] = CreateDynamicObject(19031, 210.70, -101.98, 1005.41,   0.00, 20.00, -45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][194] = CreateDynamicObject(19029, 210.70, -101.98, 1005.23,   0.00, 20.00, -45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][195] = CreateDynamicObject(19422, 205.05, -101.65, 1005.13,   110.00, 0.00, -40.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][196] = CreateDynamicObject(19421, 205.05, -101.65, 1005.58,   110.00, 0.00, -40.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][197] = CreateDynamicObject(19423, 205.07, -102.04, 1005.62,   110.00, 0.00, -135.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][198] = CreateDynamicObject(19424, 205.04, -102.04, 1005.17,   110.00, 0.00, -135.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][199] = CreateDynamicObject(18926, 211.97, -95.44, 1005.74,   180.00, 90.00, 20.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][200] = CreateDynamicObject(18927, 213.04, -95.42, 1005.74,   180.00, 90.00, -20.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][201] = CreateDynamicObject(18930, 213.07, -95.59, 1005.34,   180.00, 90.00, -20.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][202] = CreateDynamicObject(18929, 212.47, -95.58, 1005.34,   180.00, 90.00, 4.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][203] = CreateDynamicObject(18928, 211.83, -95.59, 1005.34,   180.00, 90.00, 20.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][204] = CreateDynamicObject(18931, 211.39, -96.03, 1004.79,   180.00, 90.00, 55.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][205] = CreateDynamicObject(18932, 211.89, -96.02, 1004.79,   180.00, 90.00, 55.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][206] = CreateDynamicObject(18935, 213.44, -96.02, 1004.79,   180.00, 90.00, -55.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][207] = CreateDynamicObject(18934, 212.97, -95.99, 1004.79,   180.00, 90.00, -55.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][208] = CreateDynamicObject(18933, 212.48, -95.99, 1004.79,   180.00, 90.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][209] = CreateDynamicObject(18916, 208.20, -96.69, 1006.07,   140.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][210] = CreateDynamicObject(18917, 208.47, -96.68, 1006.07,   140.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][211] = CreateDynamicObject(18918, 208.77, -96.69, 1006.07,   140.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][212] = CreateDynamicObject(18919, 209.08, -96.69, 1006.07,   140.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][213] = CreateDynamicObject(18920, 209.36, -96.69, 1006.07,   140.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][214] = CreateDynamicObject(18915, 205.61, -96.68, 1006.07,   140.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][215] = CreateDynamicObject(18914, 205.31, -96.70, 1006.07,   140.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][216] = CreateDynamicObject(18913, 204.99, -96.70, 1006.07,   140.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][217] = CreateDynamicObject(18912, 204.69, -96.69, 1006.07,   140.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][218] = CreateDynamicObject(18911, 204.39, -96.69, 1006.07,   140.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][219] = CreateDynamicObject(19018, 210.67, -101.71, 1005.23,   0.00, 20.00, 45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][220] = CreateDynamicObject(19019, 210.67, -101.71, 1005.43,   0.00, 20.00, 45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][221] = CreateDynamicObject(19027, 210.67, -101.71, 1005.62,   0.00, 20.00, 45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][222] = CreateDynamicObject(19028, 210.67, -101.71, 1005.80,   0.00, 20.00, 45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][223] = CreateDynamicObject(19014, 210.43, -101.71, 1005.24,   0.00, 20.00, 135.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][224] = CreateDynamicObject(19015, 210.43, -101.71, 1005.42,   0.00, 20.00, 135.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][225] = CreateDynamicObject(19016, 210.43, -101.71, 1005.61,   0.00, 20.00, 135.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][226] = CreateDynamicObject(19017, 210.43, -101.71, 1005.80,   0.00, 20.00, 135.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][227] = CreateDynamicObject(19011, 210.43, -101.71, 1005.07,   0.00, 20.00, 135.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][228] = CreateDynamicObject(19007, 210.42, -101.98, 1005.04,   0.00, 20.00, -135.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][229] = CreateDynamicObject(19012, 210.67, -101.71, 1005.06,   0.00, 20.00, 45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][230] = CreateDynamicObject(19013, 210.70, -101.98, 1005.06,   0.00, 20.00, -45.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][231] = CreateDynamicObject(18944, 215.22090, -8.63297, 1001.50470,   -12.00000, -90.00000, -62.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][232] = CreateDynamicObject(18945, 214.90440, -8.29813, 1001.50562,   -12.00000, -90.00000, -33.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][233] = CreateDynamicObject(18946, 214.32787, -8.27569, 1001.50562,   -12.00000, -90.00000, 25.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][234] = CreateDynamicObject(18947, 213.96838, -8.58903, 1001.50549,   -12.00000, -90.00000, 55.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][235] = CreateDynamicObject(18948, 213.97931, -9.19466, 1001.50549,   -12.00000, -90.00000, 113.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][236] = CreateDynamicObject(18949, 214.32460, -9.52760, 1001.50549,   -12.00000, -90.00000, 160.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][237] = CreateDynamicObject(18950, 214.84119, -9.52676, 1001.50531,   -12.00000, -90.00000, -148.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][238] = CreateDynamicObject(18951, 215.19591, -9.19152, 1001.50519,   -12.00000, -90.00000, -127.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][239] = CreateDynamicObject(19421, 208.08846, -8.50334, 1001.28418,   0.00000, 0.00000, 47.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][240] = CreateDynamicObject(19422, 208.08800, -7.90856, 1001.28442,   0.00000, 0.00000, 127.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][241] = CreateDynamicObject(19423, 207.46571, -7.84895, 1001.28418,   0.00000, 0.00000, -141.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][242] = CreateDynamicObject(19424, 207.47606, -8.51779, 1001.28442,   0.00000, 0.00000, -50.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][243] = CreateDynamicObject(2376, 225.07130, -12.65720, 1001.20752,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][244] = CreateDynamicObject(18926, 227.16420, -12.22250, 1002.12219,   0.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][245] = CreateDynamicObject(18927, 226.70419, -12.22250, 1002.12219,   0.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][246] = CreateDynamicObject(18928, 226.24420, -12.22250, 1002.12219,   0.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][247] = CreateDynamicObject(18929, 225.78419, -12.22250, 1002.12219,   0.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][248] = CreateDynamicObject(18930, 225.30420, -12.22250, 1002.12219,   0.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][249] = CreateDynamicObject(18931, 225.30420, -12.37830, 1002.52753,   0.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][250] = CreateDynamicObject(18932, 225.78419, -12.37830, 1002.52753,   0.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][251] = CreateDynamicObject(18933, 226.24420, -12.37830, 1002.52753,   0.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][252] = CreateDynamicObject(18934, 226.70419, -12.37830, 1002.52753,   0.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][253] = CreateDynamicObject(18935, 227.16420, -12.37830, 1002.52753,   0.00000, -90.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][254] = CreateDynamicObject(2376, 225.07130, -4.27720, 1001.20752,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][255] = CreateDynamicObject(18911, 225.27760, -4.06880, 1002.22168,   84.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][256] = CreateDynamicObject(18963, 225.27980, -4.07170, 1002.22260,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][257] = CreateDynamicObject(18963, 227.16420, -4.07170, 1002.22260,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][258] = CreateDynamicObject(18912, 227.16270, -4.06880, 1002.22168,   84.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][259] = CreateDynamicObject(18963, 226.70419, -4.07170, 1002.22260,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][260] = CreateDynamicObject(18913, 226.70200, -4.06880, 1002.22168,   84.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][261] = CreateDynamicObject(18963, 226.24420, -4.07170, 1002.22260,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][262] = CreateDynamicObject(18914, 226.24361, -4.06880, 1002.22168,   84.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][263] = CreateDynamicObject(18963, 225.78419, -4.07170, 1002.22260,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][264] = CreateDynamicObject(18915, 225.78320, -4.06880, 1002.22168,   84.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][265] = CreateDynamicObject(18963, 225.27980, -3.99170, 1002.64258,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][266] = CreateDynamicObject(18916, 225.27760, -3.98820, 1002.63440,   84.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][267] = CreateDynamicObject(18963, 225.78419, -3.99170, 1002.64258,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][268] = CreateDynamicObject(18917, 225.77960, -3.98820, 1002.63440,   84.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][269] = CreateDynamicObject(18963, 226.24420, -3.99170, 1002.64258,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][270] = CreateDynamicObject(18917, 226.23959, -3.98820, 1002.63440,   84.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][271] = CreateDynamicObject(18918, 226.23959, -3.98820, 1002.63440,   84.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][272] = CreateDynamicObject(18963, 226.70419, -3.99170, 1002.64258,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][273] = CreateDynamicObject(18919, 226.70200, -3.98820, 1002.63440,   84.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][274] = CreateDynamicObject(18963, 227.16420, -3.99170, 1002.64258,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][275] = CreateDynamicObject(18920, 227.16200, -3.98820, 1002.63440,   84.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][276] = CreateDynamicObject(2491, 211.52609, -8.70050, 1000.20813,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][277] = CreateDynamicObject(19140, 211.48199, -8.94000, 1001.81812,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][278] = CreateDynamicObject(19139, 211.48199, -8.94000, 1001.65808,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][279] = CreateDynamicObject(19033, 211.48199, -8.94000, 1001.47809,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][280] = CreateDynamicObject(19035, 211.48199, -8.94000, 1001.27808,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][281] = CreateDynamicObject(19022, 211.48199, -8.94000, 1001.03882,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][282] = CreateDynamicObject(19032, 211.48199, -8.94000, 1000.77881,   0.00000, 0.00000, 0.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][283] = CreateDynamicObject(19031, 211.27969, -8.75860, 1001.82123,   0.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][284] = CreateDynamicObject(19029, 211.27969, -8.75860, 1001.66119,   0.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][285] = CreateDynamicObject(19028, 211.27969, -8.75860, 1001.48120,   0.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][286] = CreateDynamicObject(19027, 211.27969, -8.75860, 1001.30121,   0.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][287] = CreateDynamicObject(19024, 211.27969, -8.75860, 1001.04120,   0.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][288] = CreateDynamicObject(19019, 211.27969, -8.75860, 1000.78119,   0.00000, 0.00000, 90.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][289] = CreateDynamicObject(19018, 211.27921, -9.13840, 1001.81421,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][290] = CreateDynamicObject(19017, 211.27921, -9.13840, 1001.65417,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][291] = CreateDynamicObject(19016, 211.27921, -9.13840, 1001.47418,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][292] = CreateDynamicObject(19015, 211.27921, -9.13840, 1001.27417,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][293] = CreateDynamicObject(19014, 211.27921, -9.13840, 1001.03418,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][294] = CreateDynamicObject(19013, 211.27921, -9.13840, 1000.77417,   0.00000, 0.00000, 270.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][295] = CreateDynamicObject(19012, 211.10150, -8.93430, 1001.82123,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][296] = CreateDynamicObject(19011, 211.10150, -8.93430, 1001.66119,   0.00000, 0.00000, 180.00000,Bizz::[id][bID]);
    Bizz::[id][bObjects][297] = CreateDynamicObject(2491, 208.84, -34.35, 1000.91,   0.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][298] = CreateDynamicObject(19421, 208.59, -34.34, 1002.10,   100.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][299] = CreateDynamicObject(19422, 208.59, -34.33, 1001.61,   100.00, 0.00, 0.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][300] = CreateDynamicObject(19423, 208.84, -34.61, 1002.29,   100.00, 0.00, -90.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][301] = CreateDynamicObject(19424, 208.84, -34.61, 1001.79,   100.00, 0.00, -90.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][302] = CreateDynamicObject(18944, 196.40, -49.63, 1002.61,   -10.00, -90.00, -25.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][303] = CreateDynamicObject(18945, 196.42, -48.06, 1002.61,   -10.00, -90.00, 25.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][304] = CreateDynamicObject(18946, 196.44, -48.30, 1002.25,   -10.00, -90.00, 25.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][305] = CreateDynamicObject(18947, 196.43, -47.04, 1002.25,   -10.00, -90.00, 142.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][306] = CreateDynamicObject(18948, 196.42, -47.06, 1001.88,   -15.00, -90.00, -156.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][307] = CreateDynamicObject(18949, 196.67, -48.15, 1001.56,   -15.00, -90.00, -47.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][308] = CreateDynamicObject(18950, 196.42, -49.69, 1001.87,   -15.00, -90.00, 331.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][309] = CreateDynamicObject(18951, 196.42, -48.38, 1001.88,   -15.00, -90.00, 4.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][310] = CreateDynamicObject(18926, 196.46, -41.29, 1001.87,   -15.00, -90.00, -25.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][311] = CreateDynamicObject(18929, 196.38, -41.56, 1002.25,   -1.00, -90.00, 215.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][312] = CreateDynamicObject(18928, 196.39, -40.53, 1002.25,   -1.00, -90.00, -76.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][313] = CreateDynamicObject(18927, 196.40, -38.72, 1002.25,   -1.00, -90.00, -156.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][314] = CreateDynamicObject(18930, 196.41, -41.80, 1002.61,   -1.00, -90.00, -40.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][315] = CreateDynamicObject(18931, 196.40, -40.04, 1002.61,   -1.00, -90.00, 207.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][316] = CreateDynamicObject(18932, 196.43, -38.99, 1002.61,   -1.00, -90.00, 302.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][317] = CreateDynamicObject(18935, 196.67, -40.29, 1001.57,   -1.00, -90.00, 309.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][318] = CreateDynamicObject(18933, 196.40, -38.97, 1001.89,   -1.00, -90.00, 185.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][319] = CreateDynamicObject(18934, 196.44, -40.32, 1001.88,   -1.00, -90.00, 309.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][320] = CreateDynamicObject(18917, 211.06, -44.52, 1002.66,   120.00, 0.00, -91.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][321] = CreateDynamicObject(18918, 211.05, -44.81, 1002.66,   120.00, 0.00, -91.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][322] = CreateDynamicObject(18919, 211.05, -45.09, 1002.66,   120.00, 0.00, -91.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][323] = CreateDynamicObject(18920, 211.05, -45.38, 1002.66,   120.00, 0.00, -91.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][324] = CreateDynamicObject(18914, 211.05, -44.95, 1001.79,   120.00, 0.00, -91.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][325] = CreateDynamicObject(18913, 211.04, -45.26, 1001.79,   120.00, 0.00, -91.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][326] = CreateDynamicObject(18915, 211.05, -44.68, 1001.79,   120.00, 0.00, -91.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][327] = CreateDynamicObject(18916, 211.05, -44.38, 1001.79,   120.00, 0.00, -91.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][328] = CreateDynamicObject(18911, 211.04, -46.03, 1001.79,   120.00, 0.00, -91.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][329] = CreateDynamicObject(18912, 211.05, -46.35, 1001.79,   120.00, 0.00, -91.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][330] = CreateDynamicObject(19140, 207.11, -32.35, 1001.69,   0.00, 0.00, -127.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][331] = CreateDynamicObject(19139, 206.59, -32.33, 1001.69,   0.00, 0.00, -55.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][332] = CreateDynamicObject(19022, 208.06, -32.35, 1001.98,   0.00, 0.00, -98.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][333] = CreateDynamicObject(19035, 207.48, -32.31, 1002.44,   0.00, 0.00, -55.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][334] = CreateDynamicObject(19033, 207.00, -32.32, 1002.44,   0.00, 0.00, -76.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][335] = CreateDynamicObject(19029, 209.84, -32.33, 1002.09,   0.00, 0.00, -127.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][336] = CreateDynamicObject(19031, 209.37, -32.32, 1002.09,   0.00, 0.00, -40.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][337] = CreateDynamicObject(19032, 209.08, -32.36, 1002.63,   0.00, 0.00, -142.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][338] = CreateDynamicObject(19028, 210.21, -32.32, 1002.34,   0.00, 0.00, -84.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][339] = CreateDynamicObject(19024, 210.80, -32.33, 1002.34,   0.00, 0.00, -120.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][340] = CreateDynamicObject(19027, 210.55, -32.33, 1002.34,   0.00, 0.00, -33.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][341] = CreateDynamicObject(19018, 211.25, -34.50, 1002.43,   0.00, 0.00, -207.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][342] = CreateDynamicObject(19019, 211.25, -33.99, 1002.43,   0.00, 0.00, -142.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][343] = CreateDynamicObject(19017, 211.24, -35.33, 1002.67,   0.00, 0.00, -120.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][344] = CreateDynamicObject(19015, 211.24, -35.33, 1002.01,   0.00, 0.00, -185.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][345] = CreateDynamicObject(19016, 211.25, -34.88, 1002.01,   0.00, 0.00, -135.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][346] = CreateDynamicObject(19013, 211.25, -33.19, 1002.03,   0.00, 0.00, -185.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][347] = CreateDynamicObject(19014, 211.25, -32.62, 1002.03,   0.00, 0.00, -161.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][348] = CreateDynamicObject(19011, 211.26, -33.43, 1002.75,   0.00, 0.00, -207.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][349] = CreateDynamicObject(19012, 211.23, -33.02, 1002.75,   0.00, 0.00, -113.00,Bizz::[id][bID]);
    Bizz::[id][bObjects][350] = CreateDynamicObject(19007, 210.58, -32.32, 1002.94,   0.00, 0.00, -91.00,Bizz::[id][bID]);
}

stock UpdateFuelBar(playerid,vehicleid)
{
	PlayerTextDrawTextSize(playerid,Speed[7][playerid], 295.0 + 62.0 * (V::[vehicleid][vFuel] / MaxVehicleFuel[GetVehicleModel(vehicleid) - 400]), 0.000000);
	PlayerTextDrawShow(playerid,Speed[7][playerid]);
}

stock NonSym( str[], max = 0, min = 0 ) 
{
	static 
		BadNameChars[][2] = {"/","\n","`","~","%","^","&","[","]","{","}","|","'"};
	
	for( new i = 0; i < sizeof( BadNameChars ); i++ ) 
	{
		if( strfind( str, BadNameChars[i], true ) != -1 || strlen( str ) > max || strlen( str ) < min ) 
			return 1;
	}
	
	return 0;
}

stock strreplace(string[], find, replace) 
{
	for(new i=0; string[i]; i++) {
		if(string[i] != find) continue;
		string[i] = replace;
	}
}

stock GetAvailableSeat(vehicleid, start = 1)
{
	new seats = GetVehicleMaxSeats(vehicleid);

	for (new i = start; i < seats; i ++) if (!IsVehicleSeatUsed(vehicleid, i)) {
	    return i;
	}
	return -1;
}

stock GetVehicleMaxSeats(vehicleid)
{
    static const g_arrMaxSeats[] = {
		4, 2, 2, 2, 4, 4, 1, 2, 2, 4, 2, 2, 2, 4, 2, 2, 4, 2, 4, 2, 4, 4, 2, 2, 2, 1, 4, 4, 4, 2,
		1, 7, 1, 2, 2, 0, 2, 7, 4, 2, 4, 1, 2, 2, 2, 4, 1, 2, 1, 0, 0, 2, 1, 1, 1, 2, 2, 2, 4, 4,
		2, 2, 2, 2, 1, 1, 4, 4, 2, 2, 4, 2, 1, 1, 2, 2, 1, 2, 2, 4, 2, 1, 4, 3, 1, 1, 1, 4, 2, 2,
		4, 2, 4, 1, 2, 2, 2, 4, 4, 2, 2, 1, 2, 2, 2, 2, 2, 4, 2, 1, 1, 2, 1, 1, 2, 2, 4, 2, 2, 1,
		1, 2, 2, 2, 2, 2, 2, 2, 2, 4, 1, 1, 1, 2, 2, 2, 2, 7, 7, 1, 4, 2, 2, 2, 2, 2, 4, 4, 2, 2,
		4, 4, 2, 1, 2, 2, 2, 2, 2, 2, 4, 4, 2, 2, 1, 2, 4, 4, 1, 0, 0, 1, 1, 2, 1, 2, 2, 1, 2, 4,
		4, 2, 4, 1, 0, 4, 2, 2, 2, 2, 0, 0, 7, 2, 2, 1, 4, 4, 4, 2, 2, 2, 2, 2, 4, 2, 0, 0, 0, 4,
		0, 0
	};
	new
	    model = GetVehicleModel(vehicleid);

	if (400 <= model <= 611)
	    return g_arrMaxSeats[model - 400];

	return 0;
}

stock IsVehicleSeatUsed(vehicleid, seat)
{
	foreach (new i : Player) if (IsPlayerInVehicle(i, vehicleid) && GetPlayerVehicleSeat(i) == seat) {
	    return 1;
	}
	return 0;
}

stock getDay(day = 0,month = 0, year = 0) {
	if(!day) getdate(year, month, day);
	new j, e, days;
	if (month <= 2) {
    	month += 12;
    	--year;
    }
    j = year % 100;
  	e = year / 100;
  	days = (day + (month + 1) * 26/10 + j + j/4 + e/4 - 2 * e) % 7;
	return days;
}

stock IsVehicleOccupied(vehicleid) {
	foreach(new i : Player) {
		if(IsPlayerInVehicle(i,vehicleid)) return 1;
	}
	return 0;
}

stock SendAdminMessageToAll( color, const message[], id = -1 ) {
	foreach(new i : Player) {
		if( getData( i, "uLogin" ) ) {
			if( Player[i][uSettings][5] == 1 || id == i ) SendClientMessage( i, color, message );
		}
	}
}

stock PlayerToKvadrat(playerid, Float:min_x, Float:min_y, Float:max_x, Float:max_y) {
    new Float:xxp,Float:yyp,Float:zzp;
    GetPlayerPos(playerid, xxp, yyp, zzp);
    if((xxp <= max_x && xxp >= min_x) && (yyp <= max_y && yyp >= min_y)) return true;
    return false;
}

stock IsPlayerInBandOnline(id) {
    foreach(new i : Player) {
        if(Player[i][uMemberGang] == id) return true;
    }
    return false;
}

stock spawnFreezeTime(playerid) {
	togglePlayerControllable(playerid,false);
	SetPVarInt(playerid,"playerFreezingTime",MAX_TIME_UNFREEZE_P);
}

stock togglePlayerControllable(playerid,bool:value) {
	if(value == false) SetPVarInt(playerid,"playerFreezing",0);
	else SetPVarInt(playerid,"playerFreezing",1);
    return TogglePlayerControllable(playerid,value);
}

stock sendLongMessage(playerid,message[], color1, color2, color3, color4, color5,Float:radius = 20.0,type = 0,prox = 1)
{
    new len = strlen(message),_iL = len / MAX_CHARS_PER_LINE;
    if( ( len % MAX_CHARS_PER_LINE ) ) _iL++;
    new _Line[MAX_CHARS_PER_LINE + 5];
    new _:_i@Index;
    while( _i@Index < _iL ) {
        if( _i@Index == 0 ) strmid( _Line, message, ( _i@Index * MAX_CHARS_PER_LINE ), ( _i@Index * MAX_CHARS_PER_LINE ) + MAX_CHARS_PER_LINE );
        else strmid( _Line, message, ( _i@Index * MAX_CHARS_PER_LINE ), ( _i@Index * MAX_CHARS_PER_LINE ) + MAX_CHARS_PER_LINE );

        #if defined FINAL_DOTS
        if( _iL > 1 ) {
            if( _i@Index == 0 ) format( _Line, sizeof _Line, "%s ...", _Line );
            else if( _i@Index > 0 && ( _i@Index + 1 ) < _iL ) format( _Line, sizeof _Line, "... %s ...", _Line );
            else format( _Line, sizeof _Line, "... %s", _Line );
        }
        #endif
		
		if( !prox )
		{
			SendClientMessage( playerid, color1, _Line );
		}
		else 
		{
			ProxDetector(radius, playerid, _Line,color1,color2,color3,color4,color5, type);
        }
		
		_i@Index++;
    }
    return 1;
}

stock GetIDfromName(name[]) {
	new string[128];
	format(string,sizeof(string),"SELECT uID FROM gb_users WHERE BINARY uName = '%s'",name);
    mysql_tquery(1, string, "MySQLQuery", "dd", 0, 32);
    return 1;
}

stock GetVehicleInfo(veh) {
	new id;
	for(new i; i != 85; i ++) {
	    if(CarsPrice[i][0] == GetVehicleModel(veh)) id = i;
	}
	return id;
}
public OnVehicleStreamIn(vehicleid, forplayerid) {
 	return 1;
}

public OnVehicleStreamOut(vehicleid, forplayerid) {
    return 1;
}

stock TurnPlayerFaceToPlayer(playerid, facingtoid)
{
    new Float:angle;
    new Float:misc = 5.0;
    new Float:x, Float:y, Float:z;
    new Float:ix, Float:iy, Float:iz;
    GetPlayerPos(facingtoid, x, y, z);
    GetPlayerPos(playerid, ix, iy, iz);
    angle = 180.0-atan2(ix-x,iy-y);
    angle += misc;
    misc *= -1;
    SetPlayerFacingAngle(playerid, angle+misc);
}


function MySQLQuery(playerid, type) {
	clear_massive();
	new data[120];
	new string[500], str[215];
	new Rows, Fields;
    cache_get_data(Rows, Fields);
	switch(type) 
	{   
	    case 5:
	    {
	        new BussinesOwner[32], BussinesName[32];
	        for(new j; j != Rows; j++)
	        {
	            //
	            cache_get_field_content(j, "bID", BussinesOwner, mysql), Bizz::[j][bID] = strval(BussinesOwner);
				cache_get_field_content(j, "bOwner", BussinesOwner, mysql);
				cache_get_field_content(j, "bName", BussinesName, mysql);

				cache_get_field_content(j, "bEnter", data, mysql), sscanf(data,"p<|>a<f>[7]",Bizz::[j][bEnter]);
				cache_get_field_content(j, "bUpdate", data, mysql), sscanf(data,"p<|>a<d>[3]",Bizz::[j][bUpdate]);
				cache_get_field_content(j, "bSettings", data, mysql), sscanf(data,"p<|>a<d>[8]",Bizz::[j][bSettings]);
				Bizz::[j][bBizzRent] = cache_get_field_content_int(j, "bBizzRent");
				Bizz::[j][SellDate] = cache_get_field_content_int(j, "SellDate");
				Bizz::[j][bOwnerID] = cache_get_field_content_int(j, "bOwnerID");
				Bizz::[j][bSellHour] = cache_get_field_content_int(j, "bSellHour"); // загружаем часы, когда бизнес должен слететь
                Bizz::[j][bRating] = cache_get_field_content_int(j, "bRate");

				strmid(Bizz::[j][bOwner], BussinesOwner, 0, strlen(BussinesOwner), 255);
				strmid(Bizz::[j][bName], BussinesName, 0, strlen(BussinesName), 255);
		    	switch(Bizz::[j][bSettings][7]) {
		    		case 0:{
		    			switch(Bizz::[j][bSettings][1]) {
		    				case 17:
							{
								CreateDynamicMapIcon(Bizz::[j][bEnter][0], Bizz::[j][bEnter][1], Bizz::[j][bEnter][2], 17, 0xFFFFFFFF, -1, -1, -1, 333.0);
							}
							case 5:
							{
								CreateDynamicMapIcon(Bizz::[j][bEnter][0], Bizz::[j][bEnter][1], Bizz::[j][bEnter][2], 29, 0xFFFFFFFF, -1, -1, -1, 333.0);
								Bizz::[j][bActor] = CreateActor(155, 375.3097,-117.2786,1001.4922,182.6519);
								SetActorVirtualWorld(Bizz::[j][bActor], Bizz::[j][bID]);
								CreateDynamic3DTextLabel("[ Продавец ]",0xFFFFFFFF,375.3097,-117.2786,1001.4922+1, 2.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, Bizz::[j][bID]);
							}
							case 9:
							{
								CreateDynamicMapIcon(Bizz::[j][bEnter][0], Bizz::[j][bEnter][1], Bizz::[j][bEnter][2], 14, 0xFFFFFFFF, -1, -1, -1, 333.0);
								Bizz::[j][bActor] = CreateActor(167, 368.6948,-4.4924,1001.8516,180.1452);
								SetActorVirtualWorld(Bizz::[j][bActor], Bizz::[j][bID]);
								CreateDynamic3DTextLabel("[ Продавец ]",0xFFFFFFFF,368.6948,-4.4924,1001.8516+1, 2.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, Bizz::[j][bID]);
							}
							case 10:
							{
								CreateDynamicMapIcon(Bizz::[j][bEnter][0], Bizz::[j][bEnter][1], Bizz::[j][bEnter][2], 10, 0xFFFFFFFF, -1, -1, -1, 333.0);
								Bizz::[j][bActor] = CreateActor(205, 376.5307,-65.8494,1001.5078,177.9750);
								SetActorVirtualWorld(Bizz::[j][bActor], Bizz::[j][bID]);
								CreateDynamic3DTextLabel("[ Продавец ]",0xFFFFFFFF,376.5307,-65.8494,1001.5078+1, 2.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, Bizz::[j][bID]);
							}
						}
		    			format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nЗакусочная "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[j][bID],Bizz::[j][bName],Bizz::[j][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));

		    			Bizz::[j][bItems][0] = 402; Bizz::[j][bItems][1] = 403; Bizz::[j][bItems][2] = 404; Bizz::[j][bItems][3] = 405;
		                Bizz::[j][bProdItems][0] = 10; Bizz::[j][bProdItems][1] = 15; Bizz::[j][bProdItems][2] = 20; Bizz::[j][bProdItems][3] = 20;
		                if(Bizz::[j][bUpdate][1] == 1) {
		                	Bizz::[j][bProdItems][4] = 40; Bizz::[j][bProdItems][5] = 40; Bizz::[j][bProdItems][6] = 50; Bizz::[j][bProdItems][7] = 60;
		                	Bizz::[j][bItems][4] = 406; Bizz::[j][bItems][5] = 407; Bizz::[j][bItems][6] = 408; Bizz::[j][bItems][7] = 409;
		            	}
		    		}
		    		case 1: {
		    			CreateDynamicMapIcon(Bizz::[j][bEnter][0], Bizz::[j][bEnter][1], Bizz::[j][bEnter][2], 49, 0xFFFFFFFF, -1, -1, -1, 100.0);
		    			format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nБар "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[j][bID],Bizz::[j][bName],Bizz::[j][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
		    			Bizz::[j][bItems][0] = 414;
						Bizz::[j][bItems][1] = 415;
						Bizz::[j][bItems][2] = 416;
						Bizz::[j][bItems][3] = 417;
						Bizz::[j][bItems][4] = 515;
						Bizz::[j][bItems][5] = 516;

						Bizz::[j][bProdItems][0] = 15;
						Bizz::[j][bProdItems][1] = 30;
						Bizz::[j][bProdItems][2] = 40;
						Bizz::[j][bProdItems][3] = 20;
						
						Bizz::[j][bProdItems][4] = 15;
						Bizz::[j][bProdItems][5] = 5;
						
						if(Bizz::[j][bUpdate][1] == 1) {
		        			Bizz::[j][bItems][6] = 418;
							Bizz::[j][bItems][7] = 419;
							Bizz::[j][bItems][8] = 420;
		        			Bizz::[j][bProdItems][6] = 20;
							Bizz::[j][bProdItems][7] = 30;
							Bizz::[j][bProdItems][8] = 45;
		        		}
		        		Bizz::[j][bActor] = CreateActor(59, 499.1651,-77.4642,998.7651,2.5068);
		        		SetActorVirtualWorld(Bizz::[j][bActor], Bizz::[j][bID]);
		        		CreateDynamic3DTextLabel("[ Бармен ]",0xFFFFFFFF,499.1651,-77.4642,998.7651+1, 2.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, Bizz::[j][bID]);
		    		}
		    		case 2: {
		    			CreateDynamicMapIcon(Bizz::[j][bEnter][0], Bizz::[j][bEnter][1], Bizz::[j][bEnter][2], 50, 0xFFFFFFFF, -1, -1, -1, 333.0);
		    			format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nРесторан "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[j][bID],Bizz::[j][bName],Bizz::[j][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
		    			Bizz::[j][bItems][0] = 444;
						Bizz::[j][bItems][1] = 445;
						Bizz::[j][bItems][2] = 446;
						Bizz::[j][bItems][3] = 447;
						Bizz::[j][bItems][4] = 515;
		        		Bizz::[j][bProdItems][0] = 15;
						Bizz::[j][bProdItems][1] = 30;
						Bizz::[j][bProdItems][2] = 40;
						Bizz::[j][bProdItems][3] = 20;
						Bizz::[j][bProdItems][4] = 25;
						
		        		if(Bizz::[j][bUpdate][1] == 1) {
		        			Bizz::[j][bItems][5] = 448;
							Bizz::[j][bItems][6] = 449;
		        			Bizz::[j][bProdItems][5] = 20;
							Bizz::[j][bProdItems][6] = 30;
		        		}
		        		Bizz::[j][bActor] = CreateActor(171, -782.8737,498.3214,1371.7422,3.4234);
		        		SetActorVirtualWorld(Bizz::[j][bActor], Bizz::[j][bID]);
		        		CreateDynamic3DTextLabel("[ Официант ]",0xFFFFFFFF,-782.8737,498.3214,1371.7422+1, 2.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, Bizz::[j][bID]);
		    		}
		    		case 3: {
		    			CreateDynamicMapIcon(Bizz::[j][bEnter][0], Bizz::[j][bEnter][1], Bizz::[j][bEnter][2], 45, 0xFFFFFFFF, -1, -1, -1, 333.0);
		    			format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nМагазин одежды "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[j][bID],Bizz::[j][bName],Bizz::[j][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
		    			if(Bizz::[j][bUpdate][1] == 1) {
		    				ClothesObjects(j);
		    				ClothesBuying(j);
		    			}
		    		}
		    		case 4: {
		    			
		    			format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nМагазин электроники "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[j][bID],Bizz::[j][bName],Bizz::[j][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
		    			Bizz::[j][bItems][0] = 393; Bizz::[j][bItems][1] = 394; Bizz::[j][bItems][2] = 395;
		        		Bizz::[j][bItems][3] = 396; Bizz::[j][bItems][4] = 397; Bizz::[j][bItems][5] = 398;
                        Bizz::[j][bItems][7] = 495; Bizz::[j][bItems][6] = 341;

		        		Bizz::[j][bProdItems][0] = 100; Bizz::[j][bProdItems][1] = 100; Bizz::[j][bProdItems][2] = 100;
		        		Bizz::[j][bProdItems][3] = 200; Bizz::[j][bProdItems][4] = 200; Bizz::[j][bProdItems][5] = 200;
		        		Bizz::[j][bProdItems][6] = 300; Bizz::[j][bProdItems][7] = 300;

		        		if(Bizz::[j][bUpdate][1] == 1)
						{
		        			Bizz::[j][bItems][8] = 399;
							Bizz::[j][bItems][9] = 400;
							Bizz::[j][bItems][10] = 401;
							Bizz::[j][bItems][11] = 469;

		        			Bizz::[j][bProdItems][8] = 300;
							Bizz::[j][bProdItems][9] = 300;
							Bizz::[j][bProdItems][10] = 300;
							Bizz::[j][bProdItems][11] = 300;
		        		}
		    		}
		    		case 5: {
		    			CreateDynamicMapIcon(Bizz::[j][bEnter][0], Bizz::[j][bEnter][1], Bizz::[j][bEnter][2], 55, 0xFFFFFFFF, -1, -1, -1, 333.0);
		    			format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nАвтосалон "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[j][bID],Bizz::[j][bName],Bizz::[j][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
		    		}
		    		case 6: {
		    			format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nМагазин оружия "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[j][bID],Bizz::[j][bName],Bizz::[j][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
		    			CreateDynamicMapIcon(Bizz::[j][bEnter][0], Bizz::[j][bEnter][1], Bizz::[j][bEnter][2], 6, 0xFFFFFFFF, -1, -1, -1, 333.0);
                        Bizz::[j][bItems][0] = 326; //бронежилет.



						
						Bizz::[j][bItems][1] = 329;
						Bizz::[j][bItems][2] = 330;
						Bizz::[j][bItems][3] = 387;

						Bizz::[j][bItems][4] = 324; //
						Bizz::[j][bItems][5] = 388;

						Bizz::[j][bItems][6] = 332;
						Bizz::[j][bItems][7] = 389;

						Bizz::[j][bItems][8] = 321;//
						Bizz::[j][bItems][9] = 337;
						Bizz::[j][bItems][10] = 390;

						if(Bizz::[j][bUpdate][1] == 1)
						{
       						Bizz::[j][bItems][11] = 323;//
							Bizz::[j][bItems][12] = 327;//
							Bizz::[j][bItems][13] = 338;
							Bizz::[j][bItems][14] = 391;
							Bizz::[j][bItems][15] = 392;
						}

						Bizz::[j][bProdItems][0] = 400;
						Bizz::[j][bProdItems][1] = 520,Bizz::[j][bProdItems][2] = 540,Bizz::[j][bProdItems][3] = 50;
						Bizz::[j][bProdItems][4] = 200,Bizz::[j][bProdItems][5] = 60;
						Bizz::[j][bProdItems][6] = 1100,Bizz::[j][bProdItems][7] = 40;
						Bizz::[j][bProdItems][8] = 140,Bizz::[j][bProdItems][9] = 880,Bizz::[j][bProdItems][10] = 45;
						Bizz::[j][bProdItems][11] = 550,Bizz::[j][bProdItems][12] = 700,Bizz::[j][bProdItems][13] = 2300,
						Bizz::[j][bProdItems][14] = 50,Bizz::[j][bProdItems][15] = 60;
						
						Bizz::[j][bActor] = CreateActor(179, 297.6844,-40.2153,1001.5156,3.0377);
						SetActorVirtualWorld(Bizz::[j][bActor], Bizz::[j][bID]);
						CreateDynamic3DTextLabel("[ Продавец ]",0xFFFFFFFF,297.6844,-40.2153,1001.5156+1, 2.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, Bizz::[j][bID]);
						
					}
		    		case 7:
					{
					    Bizz::[j][bActor] = CreateActor(14,-485.8131,-263.0600,2095.9097,89.6313);
		        		SetActorVirtualWorld(Bizz::[j][bActor], -1);
		    			format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nМагазин мебели "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[j][bID],Bizz::[j][bName],Bizz::[j][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
		
		    		}
		    		case 8: {
		    			format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nКлуб "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[j][bID],Bizz::[j][bName],Bizz::[j][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
		    			CreateDynamicMapIcon(Bizz::[j][bEnter][0], Bizz::[j][bEnter][1], Bizz::[j][bEnter][2], 48, 0xFFFFFFFF, -1, -1, -1, 333.0);

                        Bizz::[j][bItems][0] = 414;
						Bizz::[j][bItems][1] = 415;
						Bizz::[j][bItems][2] = 416;
						Bizz::[j][bItems][3] = 417;
		        		Bizz::[j][bProdItems][0] = 15;
						Bizz::[j][bProdItems][1] = 30;
						Bizz::[j][bProdItems][2] = 40;
						Bizz::[j][bProdItems][3] = 20;
           				Bizz::[j][bItems][4] = 418;
			   			Bizz::[j][bItems][5] = 419;
			   			Bizz::[j][bItems][6] = 420;
		        		Bizz::[j][bProdItems][4] = 20;
						Bizz::[j][bProdItems][5] = 30;
						Bizz::[j][bProdItems][6] = 45;
						
						Bizz::[j][bItems][7] = 515;
			   			Bizz::[j][bItems][8] = 516;
		        		Bizz::[j][bProdItems][7] = 16;
						Bizz::[j][bProdItems][8] = 3;
						
						if(Bizz::[j][bUpdate][1] == 1) {
		    				AlhambraObjects(j);
						}
		    		}
		    		case 9: {
		    			format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nЗаправка "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[j][bID],Bizz::[j][bName],Bizz::[j][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
		    			CreateDynamicMapIcon(Bizz::[j][bEnter][0], Bizz::[j][bEnter][1], Bizz::[j][bEnter][2], 47, 0xFFFFFFFF, -1, -1, -1, 333.0);
						Bizz::[j][bItems][0] = 442,
						Bizz::[j][bItems][1] = 414,
						Bizz::[j][bItems][2] = 402,
						Bizz::[j][bItems][3] = 406,
						Bizz::[j][bItems][4] = 404,
						Bizz::[j][bItems][5] = 450,
						Bizz::[j][bItems][6] = 457;
			   			Bizz::[j][bItems][7] = 516;
						
						Bizz::[j][bProdItems][0] = 20,
						Bizz::[j][bProdItems][1] = 15,
						Bizz::[j][bProdItems][2] = 10,
						Bizz::[j][bProdItems][3] = 40,
						Bizz::[j][bProdItems][4] = 20,
						Bizz::[j][bProdItems][5] = 40,
						Bizz::[j][bProdItems][6] = 40;
						Bizz::[j][bProdItems][7] = 8;

						Bizz::[j][bActor] = CreateActor(142, 274.2767,1087.7719,1913.8648,184.6350);
						SetActorVirtualWorld(Bizz::[j][bActor], Bizz::[j][bID]);
						CreateDynamic3DTextLabel("[ Продавец ]",0xFFFFFFFF,274.2767,1087.7719,1913.8648+1, 2.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID, Bizz::[j][bID]);
					}
					case 11: {
					    format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nАренда транспорта "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[j][bID],Bizz::[j][bName],Bizz::[j][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
					}
					case 12: {
					    format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nСпортзал "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[j][bID],Bizz::[j][bName],Bizz::[j][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));
		    			CreateDynamicMapIcon(Bizz::[j][bEnter][0], Bizz::[j][bEnter][1], Bizz::[j][bEnter][2], 54, 0xFFFFFFFF, -1, -1, -1, 333.0);
					}
					case 10: {


					    format(string,sizeof(string),"{ffffff}Номер бизнеса: %d\nВсе для отдыха "cBLUE"\"%s\"{ffffff}\nДвери: %s\n\nALT",Bizz::[j][bID],Bizz::[j][bName],Bizz::[j][bSettings][4] ? (""cRED"Закрыты"cBLUE"") : (""cGREEN"Открыты"cBLUE""));

						Bizz::[j][bItems][0] = 470,
						Bizz::[j][bItems][1] = 472,
						Bizz::[j][bItems][2] = 473,
						Bizz::[j][bItems][3] = 474,
						Bizz::[j][bItems][4] = 476,
						Bizz::[j][bItems][5] = 477,
						Bizz::[j][bItems][6] = 479,
						Bizz::[j][bItems][7] = 339;
						Bizz::[j][bItems][8] = 513;
						
						


						Bizz::[j][bProdItems][0] = 10,
						Bizz::[j][bProdItems][1] = 80,
						Bizz::[j][bProdItems][2] = 30,
						Bizz::[j][bProdItems][3] = 20,
						Bizz::[j][bProdItems][4] = 40,
						Bizz::[j][bProdItems][5] = 25,
						Bizz::[j][bProdItems][6] = 155,
						Bizz::[j][bProdItems][7] = 100;
						Bizz::[j][bProdItems][8] = 2;

						if(Bizz::[j][bUpdate][1] == 1)
						{
						    Bizz::[j][bItems][9] = 471,
						    Bizz::[j][bProdItems][9] = 100,

						    Bizz::[j][bItems][10] = 478,
						    Bizz::[j][bProdItems][10] = 150,

							Bizz::[j][bItems][11] = 324,
						    Bizz::[j][bProdItems][11] = 324,
						    
						    Bizz::[j][bItems][12] = 480,
						    Bizz::[j][bProdItems][12] = 20;
						    
						    
						}
					}
		    	}
		    	Bizz::[j][bText] = CreateDynamic3DTextLabel(string,0xFFFFFFFF,Bizz::[j][bEnter][0], Bizz::[j][bEnter][1], Bizz::[j][bEnter][2],5.0,INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1);
		    	CreateDynamicPickup(19132,23,Bizz::[j][bEnter][0], Bizz::[j][bEnter][1], Bizz::[j][bEnter][2], -1);
		        CreateDynamicPickup(19132,23,Bizz::[j][bEnter][4], Bizz::[j][bEnter][5], Bizz::[j][bEnter][6], Bizz::[j][bID]);
		        cBizz++;
			}
			printf("[LOADING MODE] Bizz Loading Done..");
	    }
		case 7:
		{

		    for(new j; j != Rows; j++)
	        {
	            Fields = cache_get_field_count(mysql);

			    f_mysql_fetch_row_format(j, query, Fields);
			    sscanf(query,"p<|>is[32]s[25]s[32]s[32]s[32]s[32]s[32]s[32]s[32]s[32]s[32]s[32]s[32]s[32]s[32]s[32]s[32]a<i>[15]a<i>[6]a<i>[7]",
		        F::[j][fID],F::[j][fName],F::[j][fLeader],
		        FRank[j][0],FRank[j][1],FRank[j][2],FRank[j][3],FRank[j][4],
		        FRank[j][5],FRank[j][6],FRank[j][7],FRank[j][8],FRank[j][9],
		        FRank[j][10],FRank[j][11],FRank[j][12],FRank[j][13],FRank[j][14],F::[j][fSkins],F::[j][fGuns],F::[j][fRank]);
		        //fRank[5]
			}
			printf("[LOADING MODE] Frac Loading Done..");
		}
		case 13:
		{
		    if(!Rows) return SendClientMessage(playerid,C_GRAY,""gbError"Во входящих сообщениях ничего нет.");
			else {
				new status,title[15],number,namel[MAX_PLAYER_NAME];
				string = "";
				Fields = cache_get_field_count(mysql);
				for(new cMessage; cMessage != Rows; cMessage++)
				{
			    	f_mysql_fetch_row_format(cMessage, query, Fields);
					sscanf(query,"p<|>is[128]is[25]",status,str,number,namel);
					strmid(title,str,0,15,128);
					format(str,sizeof(str),"\n%s%s ... | От "cBLUE"%d(%s)",(status==0)?("{ffffff}"):("{d3d3d3}"),title,number,namel);
					strcat(string,str);
				}
				showPlayerDialog(playerid,d_phone + 8,2,"Входящие",string,"Далее","Закрыть");
			}
			
		}
		case 16:
		{
		    if(!Rows) return SendClientMessage(playerid,C_GRAY,""gbError"Произошла ошибка! Обратитесь к Администрации.");
			else {
			    new id = GetPVarInt(playerid,"phoneSelectMessage");
			    Fields = cache_get_field_count(mysql);
			    new dates[32],status,text[128],number,name[MAX_PLAYER_NAME];
				for(new cMessage; cMessage != Rows; cMessage++)
				{
					f_mysql_fetch_row_format(cMessage, query, Fields);
				    sscanf(query,"p<|>s[32]is[128]is[25]",dates,status,text,number,name);
				    if(status == 0) {
						format(string,sizeof(string),"UPDATE gb_messages SET mRead = 1 WHERE mID = '%d' LIMIT 1", id);
      					mysql_tquery(1, string, "", "");
					}
					format(string,sizeof(string),"{ffffff}От | "cBLUE"%d(%s)\n\n{ffffff}%s\n\nДата | "cBLUE"%s",number,name,text,dates);
					showPlayerDialog(playerid,9999,0," ",string,"Закрыть","");
				}

			}
		}
		case 14:
		{
			if(!Rows) return SendClientMessage(playerid,C_GRAY,""gbError"В исходящих сообщениях ничего нет.");
			else {
				new status,title[15],number,namel[MAX_PLAYER_NAME];
				string = "";
				Fields = cache_get_field_count(mysql);
				for(new cMessage; cMessage != Rows; cMessage++)
				{
                	f_mysql_fetch_row_format(cMessage, query, Fields);
					sscanf(query,"p<|>is[128]is[25]",status,str,number,namel);
					strmid(title,str,0,15,128);
					format(str,sizeof(str),"\n%s%s ... | Кому "cBLUE"%d(%s)",(status==0)?("{ffffff}"):("{d3d3d3}"),title,number,namel);
					strcat(string,str);
				}
				showPlayerDialog(playerid,9999,2,"Исходящие",string,"Далее","Закрыть");
			}
			
		}
		case 18:
		{

            if(!Rows) SendClientMessage(playerid,-1,"Ошибка №1");
			else
			{
				new namel[MAX_PLAYER_NAME],rank;
				vb_string = "";
				for(new cMembers; cMembers != Rows; cMembers++)
				{
                	rank = cache_get_field_content_int(cMembers, "uRank");
					cache_get_field_content(cMembers, "uName", data, mysql), sscanf(data,"s[32]",namel);
					format(str,sizeof(str),"{ffffff}%i. {d3d3d3}%s - %s\n",cMembers + 1,namel,FRank[Player[playerid][uMember]][rank - 1]);
					strcat( vb_string,str);
					if(cMembers == 9) {
						SetPVarInt(playerid,"pageFrac",0);
						strcat(vb_string,"Далее >>");
					}
				}
				showPlayerDialog(playerid,d_frac + 12,2," ",vb_string,"Далее","Закрыть");
			}
		}
		case 20:
		{
		   	new namel[MAX_PLAYER_NAME],rank;
		    if(!Rows) SendClientMessage(playerid,-1,"Ошибка №1");
			else {
    			for(new cMembers; cMembers != Rows; cMembers++) {
                	rank = cache_get_field_content_int(cMembers, "uRank");
					cache_get_field_content(cMembers, "uName", data, mysql), sscanf(data,"s[32]",namel);
					format( gb_string, sizeof( gb_string ),"{ffffff}%i. {d3d3d3}%s - %s\n",cMembers + 1,namel,FRank[Player[playerid][uMember]][rank - 1]);
					strcat( vb_string, gb_string );
					if(cMembers == 9) {
						strcat( vb_string,"Далее >>");
					}
				}
				showPlayerDialog(playerid,d_frac + 12,2," ", vb_string,"Далее","Закрыть");
			}
		}
		case 31:
		{
		    if(Rows) {
		        Player[playerid][uID] = cache_get_field_content_int(0, "uID");
		        return Player[playerid][uID];
		    }
		}
		case 32:
		{
		    new id;
		    if(Rows) id = cache_get_field_content_int(0, "uID");
			return id;
		}
		case 33:
		{
		    if(Rows) {
		        new money = cache_get_field_content_int(0, "Money");
		        new id = cache_get_field_content_int(0, "BizzID");
		        SendClientMessage(playerid,C_GRAY,""gbInfo"Оповещаем Вас о том, что ваш бизнес был продан!");
		        Player[playerid][uMoney] += money;

				format(string, sizeof(string), ""gbAccess"Вам возвращено %d$ с вашего бизнеса", money);
				SendClientMessage(playerid,C_GRAY,string);

				format(string,sizeof(string),"DELETE FROM gb_business_money WHERE BINARY Name = '%s'", Player[playerid][uName]);
				mysql_tquery(1, string, "", "");

				mysql_format(1, string, sizeof(string),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
				mysql_tquery(1, string, "", "");

				for(new i; i != MAX_SLOTS; i ++) {
					switch(Inv[playerid][invSlot][i]) {
						case 377,410 .. 413,421 .. 425: {
							if(Inv[playerid][invSlotKol][i] == id) {
								Inv[playerid][invSlot][i] = 0;
                        		Inv[playerid][invSlotKol][i] = 0;
							}
						}
					}
				}

		    }
		    else return 1;
		}
		case 8: {
            Fields = cache_get_field_count(mysql);
			f_mysql_fetch_row_format(0, query, Fields);
		    sscanf(query,"p<|>iiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiia<i>[13]i",S::[0][sFerm][0],S::[0][sFerm][1],S::[0][sFerm][2],S::[0][sFerm][3],S::[0][sFerm][4],S::[0][sFerm][5],S::[0][sFerm][6],S::[0][sProducts],
			MebelZavod,ToplivoZavod,WoodsZavod,S::[0][wsWoods],S::[0][wsWoodsSklad],adminsPanel[0],adminsPanel[1],adminsPanel[2],adminsPanel[3],adminsPanel[4],adminsPanel[5],
			S::[0][sMeria][0],S::[0][sMeria][1],S::[0][sMeria][2],S::[0][sMeria][3],S::[0][sMeria][4],S::[0][sMeria][5],S::[0][sMeria][6],S::[0][sMeria][7],S::[0][sMeria][8],S::[0][sMeria][9],
			S::[0][sHouses],S::[0][sBusiness],adminsPanel[6],adminsPanel[7],adminsPanel[8],adminsPanel[9],adminsPanel[10],adminsPanel[11],S::[0][sNalog],adminsPanel[12]);
			printf( "[SYSTEM] Зарплаты загружены" );
		}	
	}
	return 1;
}

stock f_mysql_fetch_row_format(row, destination[], fields, max_len = sizeof(destination)) {
	clear_massive();
    strdel(destination, 0, max_len);
    for(new f=0; f < fields; f++) {
        if(f != 0)strcat(destination, "|", max_len);
        cache_get_row(row, f, gb_string, mysql);
        if(!f)strins(destination, gb_string, 0, max_len);
        else strcat(destination, gb_string, max_len);
    }
    return true;
}

function PhoneMessageOne(playerid, listitem) {
    new Rows, Fields;
    cache_get_data(Rows, Fields);
    if(!Rows) return SendClientMessage(playerid,C_GRAY,""gbError"Не удалось прочитать сообщение, неполадки в SA-Telecome.");
	else {
		for(new cMessage; cMessage != Rows; cMessage++) {
			if(cMessage == listitem) {
			    new id = cache_get_field_content_int(cMessage, "mID");
			    SetPVarInt(playerid,"phoneSelectMessage", id);
				break;
			}
		}
		showPlayerDialog(playerid,d_phone + 9,2," ","1. "cGRAY"Прочитать сообщение{ffffff}\n2. "cGRAY"Удалить сообщение","Далее","Закрыть");
	}
	return 1;
}

function ListForFrac(playerid, listitem) {
	clear_massive();
    new Rows, Fields;
    cache_get_data(Rows, Fields);
    new name[MAX_PLAYER_NAME], rank;
	if(Rows) {
		for(new cMembers; cMembers != Rows; cMembers++) {
			if(cMembers == listitem) {
				rank = cache_get_field_content_int(cMembers, "uRank");
				cache_get_field_content(cMembers, "uName", gb_string, mysql), sscanf(gb_string,"s[32]",name);
				SetPVarInt(playerid,"playerSelectFracID", cache_get_field_content_int(cMembers, "uID"));
				format( gb_string,sizeof(gb_string),"%s - %s",name,FRank[Player[playerid][uMember]][rank - 1]);
				showPlayerDialog(playerid,d_frac + 13,2, gb_string,"1. "cGRAY"Уволить человека из организации","Далее","Закрыть");
				break;
			}
		}
	}
	return 1;
}
forward MySQLSMS(playerid, strs[]);
public MySQLSMS(playerid, strs[])
{
    new Rows, Fields;
    cache_get_data(Rows, Fields);
	new result[64];
    if(!Rows) return SendClientMessage(playerid,C_GRAY,""gbError"Простите, но данный номер не найден в SA-Telecome.");
	else {
		SetPVarString(playerid,"phoneSMSName",result);
		SetPVarInt(playerid,"phoneSMSUser",strval(strs));
		showPlayerDialog(playerid,d_phone + 11,1," ","{ffffff}Введите текст СМС сообщения:\n\n"cRED"| Текст должен состоять только из букв и цифр.\n| Длинна текста не должна привышать 120 символов","Далее","Закрыть");
	}
	return 1;
}

stock GetPlayerID(Name[])
{
	foreach(new i : Player)
	{
		if(!strcmp(Name, Player[i][uName])) return i;
	}
	return -1;
}

forward BackupClear(playerid, calledbytimer);
public BackupClear(playerid, calledbytimer)
{
	if(IsPlayerConnected(playerid))
	{
		if(Player[playerid][uMember] == 8 || Player[playerid][uMember] == 1 || Player[playerid][uMember] == 2 || Player[playerid][uMember] == 5)
		{
   			if(GetPVarInt(playerid, "BKONFORPLAYER") == 1)
			{
				foreach(new i: Player) if(Player[i][uMember] == 1 || Player[i][uMember] == 2 || Player[i][uMember] == 5) SetPlayerMarkerForPlayer(i, playerid, FracColor[Player[playerid][uMember]]);
				if(calledbytimer != 1) SendClientMessage(playerid, -1, ""gbAccess"Ваш запрос о поддержке был отменён");
				else SendClientMessage(playerid, -1, ""gbAccess"Ваш запрос о поддержке автоматически отменён");
				SetPVarInt(playerid, "BKONFORPLAYER", 0);
			}
			else if(calledbytimer != 1) SendClientMessage(playerid, -1, ""gbError"Вы не запрашивали поддержку!");
		}
		else if(calledbytimer != 1) SendClientMessage(playerid, -1, ""gbError"Вы не состоите во фракции!");
	}
	return 1;
}

stock ProdVehicleLal(vehicleid)
{
	switch(GetVehicleModel(vehicleid))
	{
        case 409: return 3;
		case 491: return 2;
		case 517: return 2;
		case 527: return 2;
		case 535: return 2;
		case 442: return 3;
		case 551: return 2;
		case 555: return 2;
		case 405: return 2;
		case 412: return 2;
		case 419: return 2;
		case 421: return 2;
		case 436: return 2;
		case 467: return 2;
		case 462: return 1;
		
		case 487: return 4;
		case 469: return 5;
		case 511: return 7;
		case 519: return 6;
		case 593: return 5;
		case 484: return 3;
		case 454: return 3;
		case 493: return 4;
		case 473: return 2;
		case 446: return 3;
		case 452: return 3;
		
		default: return 1;

	}
	return 0;
}
	
stock GetMaxSpeedInVehicle(vehicleid)
{
	switch(GetVehicleModel(vehicleid))
	{

	    case 400: return 88;
	    case 401: return 83;
	    case 402: return 104;
	    case 403: return 61;
	    case 404: return 74;
	    case 405: return 91;
	    case 406: return 61;
	    case 407: return 82;
	    case 408: return 66;
	    case 409: return 88;
	    case 410: return 72;
	    case 411: return 122;
	    case 412: return 95;
	    case 413: return 61;
	    case 414: return 68;
	    case 415: return 107;
	    case 416: return 88;
	    //case 417: return INVALID;
	    case 418: return 68;
	    case 419: return 82;
	    case 420: return 81;
	    case 421: return 86;
	    case 422: return 78;
	    case 423: return 66;
	    case 424: return 76;
	    //case 425: return INVALID;
	    case 426: return 96;
	 	case 427: return 92;
	 	case 428: return 87;
	 	case 429: return 112;
	 	//case 430: return INVALID;
	    case 431: return 72;
	    case 432: return 81;
	    case 433: return 61;
	    case 434: return 93;
	    //case 435: return INVALID;
	    case 436: return 83;
	    case 437: return 88;
	    case 438: return 79;
	    case 439: return 94;
	    case 440: return 76;
	    case 442: return 77;
	    case 443: return 70;
	    case 444: return 62;
	    case 445: return 91;
	    case 448: return 93;
	    case 449: return 101;
	    case 451: return 107;
	    case 455: return 87;
	    case 456: return 59;
	    case 457: return 62;
	    case 458: return 87;
	    case 459: return 76;
	    case 461: return 88;
	    case 462: return 61;
	    case 463: return 78;
		case 466: return 82;
		case 467: return 78;
		case 468: return 78;
		case 470: return 87;
		case 471: return 61;
		case 474: return 82;
		case 475: return 97;
		case 477: return 104;
		case 478: return 66;
		case 479: return 78;
		case 480: return 102;
		case 481: return 80;
		case 482: return 87;
		case 483: return 86;
		case 485: return 56;
		case 486: return 39;
		case 489: return 77;
		case 490: return 82;
		case 491: return 82;
		case 492: return 78;
		case 494: return 118;
		case 495: return 98;
		case 496: return 90;
		case 498: return 85;
		case 499: return 68;
		case 500: return 78;
		case 502: return 119;
		case 503: return 119;
		case 504: return 96;
		case 505: return 78;
		case 506: return 100;
		case 507: return 92;
		case 508: return 60;
		case 509: return 90;
		case 510: return 110;
		case 514: return 67;
		case 515: return 79;
		case 516: return 87;
		case 517: return 88;
		case 518: return 91;
		case 521: return 109;
		case 522: return 112;
		case 523: return 104;
		case 524: return 72;
		case 525: return 89;
		case 526: return 88;
		case 527: return 83;
		case 528: return 98;
		case 529: return 83;
		case 530: return 33;
		case 531: return 39;
		case 532: return 61;
		case 533: return 93;
		case 534: return 94;
		case 535: return 88;
		case 536: return 96;
		case 539: return 55;
		case 540: return 83;
		case 541: return 113;
		case 542: return 91;
		case 543: return 84;
		case 544: return 82;
		case 545: return 82;
		case 546: return 83;
		case 547: return 79;
		case 550: return 80;
		case 551: return 87;
		case 552: return 67;
		case 554: return 80;
		case 555: return 88;
		case 556: return 62;
		case 557: return 62;
		case 558: return 87;
		case 559: return 99;
		case 560: return 94;
		case 561: return 85;
		case 562: return 99;
		case 565: return 92;
		case 566: return 89;
		case 567: return 96;
		case 568: return 81;
		case 571: return 52;
		case 572: return 33;
		case 573: return 61;
		case 574: return 33;
		case 575: return 88;
		case 576: return 88;
		case 578: return 72;
		case 579: return 88;
		case 580: return 85;
		case 581: return 110;
		case 582: return 76;
		case 583: return 47;
		case 585: return 85;
		case 586: return 107;
		case 587: return 92;
		case 588: return 60;
		case 589: return 90;
		case 596, 597, 598: return 98;
		case 599: return 88;
		case 600: return 84;
		case 601: return 61;
		case 602: return 94;
		case 603: return 95;
		case 604: return 82;
		case 605: return 84;
		case 609: return 60;
		default: return 190;
	}
	return false;
}

stock TunningGarages(playerid)
{
    if(IsPlayerInRangeOfPoint(playerid,20.0,2065.3801,-1832.5280,13.68)||IsPlayerInRangeOfPoint(playerid,20.0,-99.7154,1117.5011,19.88)||IsPlayerInRangeOfPoint(playerid,20.0,719.8336,-456.7990,16.47)||IsPlayerInRangeOfPoint(playerid,20.0,-1420.4562,2583.2180,55.98)||IsPlayerInRangeOfPoint(playerid,20.0,-2424.8093,1021.1127,50.53)||IsPlayerInRangeOfPoint(playerid,20.0,1975.0587,2161.9456,11.21)||
    IsPlayerInRangeOfPoint(playerid,20.0,487.9699,-1741.5265,11.28)||IsPlayerInRangeOfPoint(playerid,20.0,1025.7683,-1023.8249,32.24)||IsPlayerInRangeOfPoint(playerid,20.0,-1904.9709,285.8506,41.18)||IsPlayerInRangeOfPoint(playerid,20.0,615.2845,-124.2390,997.7112)||IsPlayerInRangeOfPoint(playerid,20.0,616.7787,-74.8150,997.6274)||IsPlayerInRangeOfPoint(playerid,20.0,617.5302,-1.9900,1001.06))return true;
    return false;
}

forward EffectGone(playerid);
public EffectGone(playerid)
{
	SetPlayerDrunkLevel(playerid,0);
	SetPVarInt(playerid, "NarkEffect", 0);
	SetPlayerWeather(playerid, weather);
	DeletePVar(playerid,"EffectGone");
	return 1;
}
stock StopStream(playerid)
{
	DeletePVar(playerid, "pAudioStream");
    StopAudioStreamForPlayer(playerid);
}

stock PlayStream(playerid, url[], Float:posX = 0.0, Float:posY = 0.0, Float:posZ = 0.0, Float:distance = 50.0, usepos = 0)
{
	if(GetPVarType(playerid, "pAudioStream")) StopAudioStreamForPlayer(playerid);
	else SetPVarInt(playerid, "pAudioStream", 1);
    PlayAudioStreamForPlayer(playerid, url, posX, posY, posZ, distance, usepos);
}
stock GetVehicleSpoiler(vehicleid)
{
	switch(GetVehicleModel(vehicleid))
	{
	    case 558..562, 565: return true;
	}
	return false;
}

stock Float:GetPointAngleToPoint(Float:x2, Float:y2, Float:X, Float:Y) {

	new Float:DX, Float:DY;
 	new Float:angle;

  	DX = floatabs(floatsub(x2,X));
  	DY = floatabs(floatsub(y2,Y));

  	if (DY == 0.0 || DX == 0.0) {
    	if(DY == 0 && DX > 0) angle = 0.0;
    	else if(DY == 0 && DX < 0) angle = 180.0;
    	else if(DY > 0 && DX == 0) angle = 90.0;
    	else if(DY < 0 && DX == 0) angle = 270.0;
    	else if(DY == 0 && DX == 0) angle = 0.0;
	}
  	else {
    	angle = atan(DX/DY);
    	if(X > x2 && Y <= y2) angle += 90.0;
    	else if(X <= x2 && Y < y2) angle = floatsub(90.0, angle);
    	else if(X < x2 && Y >= y2) angle -= 90.0;
   	 	else if(X >= x2 && Y > y2) angle = floatsub(270.0, angle);
  	}
  	return floatadd(angle, 90.0);
}

stock GetXYInFrontOfPoint(&Float:x, &Float:y, Float:angle, Float:distance) {
	x += (distance * floatsin(-angle, degrees));
	y += (distance * floatcos(-angle, degrees));
}

stock IsPlayerAimingAt(playerid, Float:x, Float:y, Float:z, Float:radius) {
	new Float:camera_x,Float:camera_y,Float:camera_z,Float:vector_x,Float:vector_y,Float:vector_z;
	GetPlayerCameraPos(playerid, camera_x, camera_y, camera_z);
	GetPlayerCameraFrontVector(playerid, vector_x, vector_y, vector_z);

	new Float:vertical, Float:horizontal;

	switch (GetPlayerWeapon(playerid))
 	{
 		case 34,35,36:
 		{
		  	if (DistanceCameraTargetToLocation(camera_x, camera_y, camera_z, x, y, z, vector_x, vector_y, vector_z) < radius) return true;
		  	return false;
	  	}
 		case 30,31:
 		{
		 	vertical = 4.0;
		 	horizontal = -1.6;
		}
	  	case 33:
	  	{
	  		vertical = 2.7;
		 	horizontal = -1.0;
 		}
	  	default:
	  	{
		  	vertical = 6.0;
		   	horizontal = -2.2;
	   	}
	}

	new Float:angle = GetPointAngleToPoint(0, 0, floatsqroot(vector_x*vector_x+vector_y*vector_y), vector_z) - 270.0;
	new Float:resize_x, Float:resize_y, Float:resize_z = floatsin(angle+vertical, degrees);
	GetXYInFrontOfPoint(resize_x, resize_y, GetPointAngleToPoint(0, 0, vector_x, vector_y)+horizontal, floatcos(angle+vertical, degrees));

	if(DistanceCameraTargetToLocation(camera_x, camera_y, camera_z, x, y, z, resize_x, resize_y, resize_z) < radius) return true;
 	return false;
}

stock GetXYInFrontOfPlayer(playerid, &Float:x, &Float:y, Float:distance)
{
	new Float:a;
	GetPlayerPos(playerid, x, y, a);
	if (IsPlayerInAnyVehicle(playerid)) GetVehicleZAngle(GetPlayerVehicleID(playerid), a);
	else GetPlayerFacingAngle(playerid, a);
	x += (distance * floatsin(-a, degrees));
	y += (distance * floatcos(-a, degrees));
	return 1;
}

stock JobValueNow(playerid, value, money, job) 
{
	clear_massive();
	
 	if( Player[playerid][uJobValue] - value >= 0 )
	{
		Player[playerid][uJobValue] -= value;
 	}
	else 
	{
		return 0;
	}
	
	userUpdate( playerid, "uJobValue", Player[playerid][uJobValue] );
	
	if( Player[playerid][uShowJobValue] ) 
	{
	    format( gb_string, sizeof gb_string, "Очки работы: %d", Player[playerid][uJobValue] );
		PlayerTextDrawSetString( playerid, JobValueText[playerid],"Очки работы");
	}
	
	if(job == -1) 
	{
	    if( D::[playerid][dWoodsDuty] != 0 ) 
		{
			if( Player[playerid][uJobDouble][JOB_WOOD] != 0 )
			{
				money += GiveDoubleMoney( playerid, JOB_WOOD, money );
			}
			
			switch( Player[playerid][uPremium] ) 
			{
				case 1 : money += floatround( money * 0.10 );
				case 2 : money += floatround( money * 0.15 );
				case 3 : money += floatround( money * 0.20 );
				case 4 : money += floatround( money * 0.25 );
			}
		}
	}	
	else 
	{
		switch( Player[playerid][uJob] )
		{
			case 1 :
			{
				if( Player[playerid][uJobDouble][JOB_TAXI] != 0 )
				{
					money += GiveDoubleMoney( playerid, JOB_TAXI, money );
				}
			}
			
			case 2 :
			{
				if( Player[playerid][uJobDouble][JOB_BUS] != 0 )
				{
					money += GiveDoubleMoney( playerid, JOB_BUS, money );
				}
			}
			
			case 3 :
			{
				if( Player[playerid][uJobDouble][JOB_VEHCOMPANY] != 0 )
				{
					money += GiveDoubleMoney( playerid, JOB_VEHCOMPANY, money );
				}
			}
		}
		
		switch( Player[playerid][uPremium] ) 
		{
			case 1 : money += floatround( money * 0.10 );
			case 2 : money += floatround( money * 0.15 );
			case 3 : money += floatround( money * 0.20 );
			case 4 : money += floatround( money * 0.25 );
		}
	}
	
	Player[playerid][uCheck] += money;
	userUpdate( playerid, "uCheck", Player[playerid][uCheck] );
	return true;
}

stock JobValueTextDraw( playerid, type ) 
{
	switch(type) 
	{
	    case 0: 
		{
			PlayerTextDrawHide(playerid, JobValueText[playerid] );
		}
		case 1:
		{
            format:gb_string( "Очки работы: %d", Player[playerid][uJobValue] );
			PlayerTextDrawSetString( playerid, JobValueText[playerid],gb_string );
			PlayerTextDrawShow( playerid, JobValueText[playerid] );
		}
	}
}

public OnPlayerEditAttachedObject(playerid, response, index, modelid, boneid,Float:fOffsetX, Float:fOffsetY, Float:fOffsetZ,Float:fRotX, Float:fRotY, Float:fRotZ,Float:fScaleX, Float:fScaleY, Float:fScaleZ ) {
    SetPlayerAttachedObject(playerid,index,modelid,boneid,fOffsetX,fOffsetY,fOffsetZ,fRotX,fRotY,fRotZ,fScaleX,fScaleY,fScaleZ);
    printf("%d, %d, %f, %f, %f,  %f, %f, %f, %f, %f, %f", modelid,boneid,fOffsetX,fOffsetY,fOffsetZ,fRotX,fRotY,fRotZ,fScaleX,fScaleY,fScaleZ);
	return true;
}

stock OnPlayerRentVeh( playerid, time ) 
{
    new 
		veh = GetPVarInt(playerid, "rent_veh"),
		price = GetPVarInt(playerid, "rent_price");
		
	foreach(new x: Player) 
	{
		if( !GetPVarInt(playerid, "uLogin") ) 
			continue;
			
		if(D::[x][dRentVehicleID] != veh || x == playerid)
			continue;
		
		removePlayerFromVehicle(playerid);
		
		if( D::[playerid][dRentVehicleID] )
		{
			SetVehicleToRespawn(GetPlayerVehicleID(playerid));
		}
		return 1;
	}
	
	SetPVarInt(playerid, "rent_time", time);

	format:vb_string( "{ffffff}Вы действительно хотите арендовать данное транспортное средство\nна "cGREEN"%i{ffffff} минут за "cGREEN"$%i{ffffff}?", time, price * time );
	showPlayerDialog(playerid, d_bizz + 35, DIALOG_STYLE_MSGBOX, "Аренда транспорта", vb_string, "Нет", "Да");
	return 1;
}

function OnPlayerRentTimeOut( playerid )
{
	if( IsPlayerInAnyVehicle( playerid ) )
	{
		removePlayerFromVehicle( playerid );
		
		if( D::[playerid][dRentVehicleID] ) 
		{
			SetVehicleToRespawn( D::[playerid][dRentVehicleID] );
		}
	}
	
	KillTimer( player_rent_timer[playerid] );
	return 1;
}


stock OnPlayerRentAccept(playerid) {
	new string[120];
    new veh = GetPVarInt(playerid, "rent_veh"), time = GetPVarInt(playerid, "rent_time"), price = GetPVarInt(playerid, "rent_price"), id = GetPVarInt(playerid, "rent_bizz");
    new cost = price * time;
	
	KillTimer( player_rent_timer[playerid] );
    if(Player[playerid][uMoney] < cost) {
		SendClientMessage(playerid, -1, ""gbError"Простите, но у Вас недостаточно денег для аренды транспорта");
        removePlayerFromVehicle(playerid);
        if(D::[playerid][dRentVehicleID]) SetVehicleToRespawn(GetPlayerVehicleID(playerid));
		return 1;
	}
	foreach(new x: Player) {
		if(!GetPVarInt(playerid, "uLogin")) continue;
		if(D::[x][dRentVehicleID] != veh || x == playerid) continue;
		removePlayerFromVehicle(playerid);
		if(D::[playerid][dRentVehicleID]) SetVehicleToRespawn(GetPlayerVehicleID(playerid));
		return 1;
	}
	if(Bizz::[id][bSettings][3] < cost)
	{
	    removePlayerFromVehicle(playerid);
		if(D::[playerid][dRentVehicleID]) SetVehicleToRespawn(GetPlayerVehicleID(playerid));
		if(Bizz::[id][bRating] > 0) Bizz::[id][bRating]--;
		SetBizzInt(Bizz::[id][bID],"bRate", Bizz::[id][bRating]);
		return SendClientMessage(playerid,C_GRAY,""gbError"В бизнесе закончились товары!");
	}
	
	
	Player[playerid][uMoney] -= cost;
 	mysql_format(1, string, sizeof(string),"UPDATE gb_users SET uMoney = '%d' WHERE BINARY uName = '%s'",Player[playerid][uMoney],Player[playerid][uName]);
	mysql_tquery(1, string, "", "");

	Bizz::[id][bSettings][3] -= cost;
	Bizz::[id][bSettings][6] += cost;
	if(Bizz::[id][bRating] < 5000) Bizz::[id][bRating]++;
	SetBizzInt(Bizz::[id][bID],"bRate", Bizz::[id][bRating]);
	format(string,sizeof(string),"%d|%d|%d|%d|%d|%d|%d|%d",Bizz::[id][bSettings][0],Bizz::[id][bSettings][1],Bizz::[id][bSettings][2],
	Bizz::[id][bSettings][3],Bizz::[id][bSettings][4],Bizz::[id][bSettings][5],Bizz::[id][bSettings][6],Bizz::[id][bSettings][7]);
	SetBizzStr(Bizz::[id][bID],"bSettings",string);
	
	if(GetVehicleModel(veh) != 442) ChangeVehicleColor(veh, random(150), random(150));
	
	V::[veh][vRentCar][0] = 1;
	V::[veh][vRentCar][1] = playerid;
	D::[playerid][dRentVehicleID] = veh;
	D::[playerid][dRentVehicleTime] = time;
	SendClientMessage(playerid, -1, ""gbAccess"Вы успешно арендовали транспорт!");
	SendClientMessage(playerid, -1, ""gbInfo"Для открытия / закрытия центрального замка, введите команду "cGREEN"\"/lock 5\".");
	
	
	return 1;
}
stock Getinic(name[]) //Инициалы
{
    new str[MAX_PLAYER_NAME],i;
    format(str,MAX_PLAYER_NAME,name);
    while(i<strlen(str)) { if(str[i]=='_') break; i++; }
    strdel(str,i+2,strlen(str)), strdel(str,1,i+1);
    return str;
}

stock SetPlayerFightingStyleEx( playerid ) {
    new Style[10];
	switch(Player[playerid][uChangeStyle]) {
	    case 0: SetPlayerFightingStyle(playerid, FIGHT_STYLE_NORMAL);
	    case 1: {
	        switch(Player[playerid][uStyle][0]) {
  				case 1000: for(new A; A != 7; A++) Style[A] = 1;
	     		case 800..999: for(new A; A != 6; A++) Style[A] = 1;
			    case 640..799: for(new A; A != 5; A++) Style[A] = 1;
	    	 	case 480..639: for(new A; A != 4; A++) Style[A] = 1;
			    case 320..479: for(new A; A != 3; A++) Style[A] = 1;
			    case 160..319: for(new A; A != 2; A++) Style[A] = 1;
			    case 1..159: Style[0] = 1;
			}
			new ChooseStyle = random(8);
			for(new A; A != 7; A++) if(A == ChooseStyle && Style[A] == 1) return SetPlayerFightingStyle(playerid, FIGHT_STYLE_BOXING);
	    }
	    case 2: {
	        switch(Player[playerid][uStyle][1]) {
			    case 1000: for(new A; A != 4; A++) Style[A] = 1;
			    case 600..999: for(new A; A != 3; A++) Style[A] = 1;
			    case 300..599: for(new A; A != 2; A++) Style[A] = 1;
			    case 1..299: Style[0] = 1;
			}
			new ChooseStyle = random(5);
			for(new A; A != 4; A++) if(A == ChooseStyle && Style[A] == 1) return SetPlayerFightingStyle(playerid, FIGHT_STYLE_KUNGFU);
	    }
	    case 3: {
	        switch(Player[playerid][uStyle][4]) {
			    case 1000: for(new A; A != 4; A++) Style[A] = 1;
			    case 600..999: for(new A; A != 3; A++) Style[A] = 1;
			    case 300..599: for(new A; A != 2; A++) Style[A] = 1;
			    case 1..299: Style[0] = 1;
			}
			new ChooseStyle = random(5);
			for(new A; A != 4; A++) if(A == ChooseStyle && Style[A] == 1) return SetPlayerFightingStyle(playerid, FIGHT_STYLE_KNEEHEAD);
	    }
	}
	return 1;
}

stock LaunchPlayerGym(playerid, gym) {
	
	if(!IsPlayerInDynamicArea(playerid, GymData[gym][gymAreaID])) return 0;
	if(GymData[gym][gymStatus] != playerid && GymData[gym][gymStatus] != INVALID_PLAYER_ID) return SendClientMessage(playerid, -1, ""gbError"Данный тренажер уже занят.");
	else if(GymData[gym][gymStatus] == INVALID_PLAYER_ID) {
	    if(Player[playerid][uValueSt] >= 200) return SendClientMessage(playerid, -1, ""gbError"Вы слишком устали, приходите завтра.");
	    
	    SetPVarInt(playerid, "gym_id", gym + 1);
	    GymData[gym][gymStatus] = playerid;
	    SetPlayerPos(playerid, GymData[gym][gymPosX], GymData[gym][gymPosY], GymData[gym][gymPosZ]);
	    SetPlayerFacingAngle(playerid, GymData[gym][gymPosA]);
	   	D::[playerid][dGymTimer] = SetTimerEx("GymTimer", 50, true, "i", playerid);
	    switch(GymData[gym][gymType]) {
	    	case GYM_TYPE_VELO: {
	    	    ApplyAnimation(playerid, "GYMNASIUM", "gym_bike_geton", 4.0, 0, 0, 0, 1, 0, 1);
			}
			case GYM_TYPE_TRACK: {
			    ApplyAnimation(playerid, "GYMNASIUM", "gym_tread_geton", 4, 0, 0, 0, 1, 0, 1);
			}
			case GYM_TYPE_BENCH: {
			    ApplyAnimation(playerid, "benchpress", "gym_bp_geton", 4, 0, 0, 0, 1, 0, 1);
			    RemovePlayerAttachedObject(playerid, 2);
			}
			case GYM_TYPE_BARB: {
			    ApplyAnimation(playerid, "Freeweights", "gym_free_pickup", 4, 0, 0, 0, 1, 0, 1);
			    RemovePlayerAttachedObject(playerid, 2);
			}
			default: return 0;
		}
		//for(new i; i < 2; i ++) PlayerTextDrawShow(playerid, TextDrawForBar[i][playerid]);
		universalbar[playerid] = CreatePlayerProgressBar(playerid, 618.411,145.083,5.647,106.166, 786038783, 5);
		UpdatePlayerProgressBar(playerid, universalbar[playerid]);
		ShowPlayerProgressBar(playerid, universalbar[playerid]);
		SetPlayerProgressBarMaxValue(playerid, universalbar[playerid], 70);
		SetPlayerProgressBarValue(playerid, universalbar[playerid], 0);
		UpdatePlayerProgressBar(playerid, universalbar[playerid]);
		
		SetPVarInt(playerid, "gym_value", 0);
		SetPVarInt(playerid, "gym_bar_show", 1);
		
		
		//PlayerTextDrawSetString(playerid, TextDrawForBar[1][playerid], "Прогресс:");
	}
	else if(GymData[gym][gymStatus] == playerid) {
	    DeletePVar(playerid, "gym_id");
	    DeletePVar(playerid, "gym_tick");
	    GymData[gym][gymStatus] = INVALID_PLAYER_ID;
	    SetCameraBehindPlayer(playerid);
	    KillTimer(D::[playerid][dGymTimer]);
		switch(GymData[gym][gymType]) {
			case GYM_TYPE_VELO: {
			    ApplyAnimation(playerid, "GYMNASIUM", "gym_bike_getoff", 4.0, 0, 0, 0, 0, 0, 1);
			}
			case GYM_TYPE_TRACK: {
			    ApplyAnimation(playerid, "GYMNASIUM", "gym_tread_getoff", 4, 0, 0, 0, 0, 0);
			}
			case GYM_TYPE_BENCH: {
			    ApplyAnimation(playerid, "benchpress", "gym_bp_getoff", 4, 0, 0, 0, 0, 0);
			    RemovePlayerAttachedObject(playerid, 2);
			}
			case GYM_TYPE_BARB: {
			    ApplyAnimation(playerid, "Freeweights", "gym_free_putdown", 4, 0, 0, 0, 0, 0);
			    RemovePlayerAttachedObject(playerid, 2);
			}
		}
		//for(new i; i < 2; i ++) PlayerTextDrawHide(playerid, TextDrawForBar[i][playerid]);
		if(GetPVarInt(playerid, "gym_bar_show") >= 1) {
			HidePlayerProgressBar(playerid, universalbar[playerid]);
			DestroyPlayerProgressBar(playerid, universalbar[playerid]);
			SetPVarInt(playerid, "gym_bar_show", 0);
		}

	}
	return 1;
}

stock EngageInGym(playerid) {
	new
	    b_gym = GetPVarInt(playerid, "gym_id")
	;
	if(!b_gym) return 0;
	if(b_gym < 1 || b_gym > sizeof(GymData)) return 0;
	if(GymData[b_gym - 1][gymStatus] != playerid) return 0;
	if(!IsPlayerInDynamicArea(playerid, GymData[b_gym - 1][gymAreaID])) return 0;
	new
	    b_tick = GetTickCount() - GetPVarInt(playerid, "gym_tick")
	;
	switch(GymData[b_gym - 1][gymType]) {
		case GYM_TYPE_VELO: {
			if(b_tick >= 1000) ApplyAnimation(playerid,"GYMNASIUM","gym_bike_pedal", 4.0, 0, 0, 0, 1, -1, 1);
			else if(b_tick >= 500) ApplyAnimation(playerid,"GYMNASIUM","gym_bike_fast", 4.0, 0, 0, 0, 1, -1, 1);
			else if(GetPVarInt(playerid, "gym_tick")) ApplyAnimation(playerid,"GYMNASIUM","gym_bike_faster", 4.0, 0, 0, 0, 1, -1, 1);
		}
		case GYM_TYPE_TRACK: {
		    if(b_tick >= 1000) ApplyAnimation(playerid,"GYMNASIUM","gym_tread_walk", 4.0, 0, 0, 0, 1, -1, 1);
			else if(b_tick >= 500) ApplyAnimation(playerid,"GYMNASIUM","gym_tread_jog", 4.0, 0, 0, 0, 1, -1, 1);
			else if(GetPVarInt(playerid, "gym_tick")) ApplyAnimation(playerid,"GYMNASIUM","gym_tread_sprint", 4.0, 0, 0, 0, 1, -1, 1);
		    //if(b_tick >= 1000) ApplyAnimation(playerid, "GYMNASIUM", "gym_tread_jog", 4, 0, 0, 0, 1, 0);
		}
		case GYM_TYPE_BENCH: {
		    if(b_tick >= 1000) ApplyAnimation(playerid, "benchpress", "gym_bp_up_smooth", 4, 0, 0, 0, 1, 0);
			else if(b_tick >= 500) ApplyAnimation(playerid, "benchpress", "gym_bp_up_smooth", 4, 0, 0, 0, 1, 0);
			else if(GetPVarInt(playerid, "gym_tick")) ApplyAnimation(playerid, "benchpress", "gym_bp_up_smooth", 4, 0, 0, 0, 1, 0);
			if(!IsPlayerAttachedObjectSlotUsed(playerid, 2)) SetPlayerAttachedObject(playerid, 2, 2913, 6, 0.033000, 0.028000, -0.104999, 5.699995, -1.999999, 0.500062, 1.000000, 1.000000, 1.000000);
		}
		case GYM_TYPE_BARB: {
		    if(b_tick >= 1000) ApplyAnimation(playerid,"Freeweights","gym_free_celebrate", 4, 0, 0, 0, 1, 0);
			else if(b_tick >= 500) ApplyAnimation(playerid,"Freeweights","gym_free_up_smooth", 4, 0, 0, 0, 1, 0);
			else if(GetPVarInt(playerid, "gym_tick")) ApplyAnimation(playerid,"Freeweights","gym_free_up_smooth", 4, 0, 0, 0, 1, 0);
			if(!IsPlayerAttachedObjectSlotUsed(playerid, 2)) SetPlayerAttachedObject(playerid, 2, 2915, 6, 0.083999, 0.000000, -0.039999, -7.199998, -87.000038, -3.199999, 1.000000, 1.000000, 1.000000);
		}
	}

	SetPVarInt(playerid, "gym_value", GetPVarInt(playerid, "gym_value") + 1);
	if(GetPVarInt(playerid, "gym_bar_show") >= 1)
	{
 		SetPlayerProgressBarValue(playerid, universalbar[playerid], GetPVarInt(playerid, "gym_value"));
 		UpdatePlayerProgressBar(playerid, universalbar[playerid]);
	}
	if(GetPVarInt(playerid, "gym_value") >= 70)
	{
	    if(Player[playerid][uValueSt] >= 200)
	    {
	        DeletePVar(playerid, "gym_id");
		    DeletePVar(playerid, "gym_tick");
		    GymData[b_gym - 1][gymStatus] = INVALID_PLAYER_ID;
		    SetCameraBehindPlayer(playerid);
		    KillTimer(D::[playerid][dGymTimer]);
			switch(GymData[b_gym - 1][gymType]) {
				case GYM_TYPE_VELO: {
				    ApplyAnimation(playerid, "GYMNASIUM", "gym_bike_getoff", 4.0, 0, 0, 0, 0, 0, 1);
				}
				case GYM_TYPE_TRACK: {
				    ApplyAnimation(playerid, "GYMNASIUM", "gym_tread_getoff", 4, 0, 0, 0, 0, 0);
				}
				case GYM_TYPE_BENCH: {
				    ApplyAnimation(playerid, "benchpress", "gym_bp_getoff", 4, 0, 0, 0, 0, 0);
				    RemovePlayerAttachedObject(playerid, 2);
				}
				case GYM_TYPE_BARB: {
				    ApplyAnimation(playerid, "Freeweights", "gym_free_putdown", 4, 0, 0, 0, 0, 0);
				    RemovePlayerAttachedObject(playerid, 2);
				}
			}
			//for(new i; i < 2; i ++) PlayerTextDrawHide(playerid, TextDrawForBar[i][playerid]);
			if(GetPVarInt(playerid, "gym_bar_show") >= 1) {
				HidePlayerProgressBar(playerid, universalbar[playerid]);
				DestroyPlayerProgressBar(playerid, universalbar[playerid]);
				SetPVarInt(playerid, "gym_bar_show", 0);
			}
	        return 1;
	    }
        switch(GymData[b_gym - 1][gymType]) {
			case GYM_TYPE_VELO, GYM_TYPE_TRACK: {
                Player[playerid][uStyle][2]++;
                Player[playerid][uValueSt]++;
				GameTextForPlayer(playerid, "~w~Endurance ~g~+", 500, 1);
				nowUpdateInfo(playerid, "d" , "gb_users" , "uName" , "StyleThree" , Player[playerid][uStyle][2]);
				nowUpdateInfo(playerid, "d" , "gb_users" , "uName" , "ValueSt" , Player[playerid][uValueSt]);
			}
			case GYM_TYPE_BENCH, GYM_TYPE_BARB: {
		        Player[playerid][uStyle][3]++;
		        Player[playerid][uValueSt]++;
				GameTextForPlayer(playerid, "~w~Streight ~g~+", 500, 1);
				nowUpdateInfo(playerid, "d" , "gb_users" , "uName" , "StyleFour" , Player[playerid][uStyle][3]);
				nowUpdateInfo(playerid, "d" , "gb_users" , "uName" , "ValueSt" , Player[playerid][uValueSt]);
			}
		}
		SetPlayerProgressBarValue(playerid, universalbar[playerid], 1);
		UpdatePlayerProgressBar(playerid, universalbar[playerid]);
		SetPVarInt(playerid, "gym_value", 0);
	}
	SetPVarInt(playerid, "gym_tick", GetTickCount());
	return 1;
}

public OnPlayerSelectDynamicObject(playerid, objectid, modelid, Float:x, Float:y, Float:z) {
	//SendClientMessage( playerid, -1, "ОБЪЕКТ КЛИКНУЛ" );
	if( GetPVarInt( playerid, "d_select" ) ) {
		for( new i; i < MAX_OBJECT ; i++ ) {
		    if(ObjList[i][oID]) {
		        if( ObjList[i][oObject] == objectid ) {
		            DestroyDynamicObject( objectid );
		            //DestroyDynamicObject(ObjList[i][oObject]);
					
					if( IsValidDynamic3DTextLabel( ObjList[i][o3DText] ) )
					{
						DestroyDynamic3DTextLabel( ObjList[i][o3DText] );
						ObjList[i][o3DText] = Text3D: INVALID_3DTEXT_ID;
			      	}
					
					ObjList[i][Obj_X] = 0, ObjList[i][Obj_Y] = 0,ObjList[i][Obj_Z] = 0;
			      	ObjList[i][ObjRx] = 0, ObjList[i][ObjRy] = 0, ObjList[i][ObjRz] = 0;
			      	ObjList[i][oModel] = 0, ObjList[i][oID] = 0;
			      	DeletePVar( playerid, "d_select" );
					SetPVarInt( playerid, "FDObject:Select", 0 );
			      	CancelEdit( playerid );
			      	SendClientMessage(playerid, -1, ""gbAccess"Вы убрали объект.");
			      	cObjectS--;
			      	break;
		        }
		    }
		}
	}
	return true;
}

forward GymTimer(playerid);
public GymTimer(playerid) {
	new
	    b_gym = GetPVarInt(playerid, "gym_id")
	;
	if(!b_gym) { KillTimer(D::[playerid][dGymTimer]); return 0; }
	if(b_gym < 1 || b_gym > sizeof(GymData)) { KillTimer(D::[playerid][dGymTimer]); return 0; }
	if(GymData[b_gym - 1][gymStatus] != playerid) { KillTimer(D::[playerid][dGymTimer]); return 0; }
	if(!IsPlayerInDynamicArea(playerid, GymData[b_gym - 1][gymAreaID]))
	{
	    //for(new i; i < 2; i ++) PlayerTextDrawHide(playerid, TextDrawForBar[i][playerid]);
		if(GetPVarInt(playerid, "gym_bar_show") >= 1) {
			HidePlayerProgressBar(playerid, universalbar[playerid]);
			DestroyPlayerProgressBar(playerid, universalbar[playerid]);
			SetPVarInt(playerid, "gym_bar_show", 0);
		}
		if(IsPlayerAttachedObjectSlotUsed(playerid, 2)) RemovePlayerAttachedObject(playerid, 2);
		SetPlayerSpecialAction(playerid, SPECIAL_ACTION_NONE);
  		ClearAnimations(playerid);
		KillTimer(D::[playerid][dGymTimer]);
		DeletePVar(playerid, "gym_id");
	    DeletePVar(playerid, "gym_tick");
	    GymData[b_gym - 1][gymStatus] = INVALID_PLAYER_ID;
	    SetCameraBehindPlayer(playerid);
		return 0;
	}
	new
	    b_tick = GetTickCount() - GetPVarInt(playerid, "gym_tick")
	;
	switch(GymData[b_gym - 1][gymType]) {
		case GYM_TYPE_VELO: {
			if(GetPVarInt(playerid, "gym_tick") && b_tick >= 1000) ApplyAnimation(playerid,"GYMNASIUM","gym_bike_pedal", 4.0, 0, 0, 0, 1, -1, 1);
			else if(GetPVarInt(playerid, "gym_tick") && b_tick >= 500) ApplyAnimation(playerid,"GYMNASIUM","gym_bike_fast", 4.0, 0, 0, 0, 1, -1, 1);
			else if(GetPVarInt(playerid, "gym_tick")) ApplyAnimation(playerid,"GYMNASIUM","gym_bike_faster", 4.0, 0, 0, 0, 1, -1, 1);
		}
		case GYM_TYPE_TRACK: {
			if(GetPVarInt(playerid, "gym_tick") && b_tick >= 1000) ApplyAnimation(playerid,"GYMNASIUM","gym_tread_walk", 4.0, 0, 0, 0, 1, -1, 1);
			else if(GetPVarInt(playerid, "gym_tick") && b_tick >= 500) ApplyAnimation(playerid,"GYMNASIUM","gym_tread_jog", 4.0, 0, 0, 0, 1, -1, 1);
			else if(GetPVarInt(playerid, "gym_tick")) ApplyAnimation(playerid,"GYMNASIUM","gym_tread_sprint", 4.0, 0, 0, 0, 1, -1, 1);
		}
		case GYM_TYPE_BENCH: {
			if(GetPVarInt(playerid, "gym_tick") && b_tick >= 1000) ApplyAnimation(playerid, "benchpress", "gym_bp_up_smooth", 4, 0, 0, 0, 1, 0);
			else if(GetPVarInt(playerid, "gym_tick") && b_tick >= 500) ApplyAnimation(playerid, "benchpress", "gym_bp_up_smooth", 4, 0, 0, 0, 1, 0);
			else if(GetPVarInt(playerid, "gym_tick")) ApplyAnimation(playerid, "benchpress", "gym_bp_up_smooth", 4, 0, 0, 0, 1, 0);
			if(!IsPlayerAttachedObjectSlotUsed(playerid, 2)) SetPlayerAttachedObject(playerid, 2, 2913, 6, 0.033000, 0.028000, -0.104999, 5.699995, -1.999999, 0.500062, 1.000000, 1.000000, 1.000000);
		}
		case GYM_TYPE_BARB: {
		    if(GetPVarInt(playerid, "gym_tick") && b_tick >= 1000) ApplyAnimation(playerid,"Freeweights","gym_free_up_smooth", 4, 0, 0, 0, 1, 0);
			else if(GetPVarInt(playerid, "gym_tick") && b_tick >= 500) ApplyAnimation(playerid,"Freeweights","gym_free_up_smooth", 4, 0, 0, 0, 1, 0);
			else if(GetPVarInt(playerid, "gym_tick")) ApplyAnimation(playerid,"Freeweights","gym_free_up_smooth", 4, 0, 0, 0, 1, 0);
		    if(!IsPlayerAttachedObjectSlotUsed(playerid, 2)) SetPlayerAttachedObject(playerid, 2, 2915, 6, 0.083999, 0.000000, -0.039999, -7.199998, -87.000038, -3.199999, 1.000000, 1.000000, 1.000000);
		}
	}
	return 1;
}
stock SpeedPed(playerid)
{
    new Float:x, Float:y, Float:z;
    GetPlayerVelocity(playerid, x, y, z);
    return floatround(floatsqroot(x*x+y*y)*100);
}
stock GetBizNalog(bizid)
{
	new typeids;
	switch(Bizz::[bizid][bSettings][7] - 1)
	{
	    case 1: typeids = S::[0][sNalog][1];
	    case 2: typeids = S::[0][sNalog][2];
	    case 3: typeids = S::[0][sNalog][3];
	    case 4: typeids = S::[0][sNalog][4];
	    case 5: typeids = S::[0][sNalog][5];
	    case 6: typeids = S::[0][sNalog][6];
	    case 7: typeids = S::[0][sNalog][7];
	    case 8: typeids = S::[0][sNalog][8];
	    case 9: typeids = S::[0][sNalog][9];
	    case 10: typeids = S::[0][sNalog][10];
	    case 11: typeids = S::[0][sNalog][11];
	    case 12: typeids = S::[0][sNalog][12];
	    case 13: typeids = S::[0][sNalog][13];
	    //case 14: typeids = S::[0][sNalog][13];
	}
	return typeids;
}
public OnPlayerCommandReceived( playerid, cmdtext[] ) 
{
	clear_massive();
	
	if( !getData( playerid, "uLogin" ) ) 
	{
		SendMes( playerid, C_WHITE, ""gbError"Для использования чата, Вам необходимо авторизоваться." );
		return 0;
	}	
	
	return 1;
}

public OnPlayerCommandPerformed( playerid, cmdtext[], success ) 
{
	
	if( !success ) 
		return SendClientMessage( playerid, C_WHITE,""gbError"Команда не найдена. Используйте "cBLUE"Y{ffffff} для помощи." );

	return 1;
}
